<!DOCTYPE html>
<!--
 | Generated by Apache Maven Doxia Site Renderer 1.7.4 at 02 enero 2017 
 | Rendered using Apache Maven Fluido Skin 1.6
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es" lang="es">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="author" content="Clinton Begin" />
    <meta name="author" content="Eduardo Macarron" />
    <meta name="Date-Revision-yyyymmdd" content="20170102" />
    <meta http-equiv="Content-Language" content="es" />
    <title>MyBatis &#x2013; MyBatis 3 | Primeros pasos</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-1.6.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
      <script type="text/javascript" src="./js/apache-maven-fluido-1.6.min.js"></script>
      </head>
    <body class="topBarDisabled">
      <div class="container-fluid">
      <div id="banner">
        <div class="pull-left"><div id="bannerLeft"><h2>mybatis</h2>
</div>
</div>
        <div class="pull-right"><a href="../../" id="bannerRight" title="MyBatis logo"><img src="http://mybatis.github.io/images/mybatis-logo.png"  alt="MyBatis logo"/></a></div>
        <div class="clear"><hr/></div>
      </div>

      <div id="breadcrumbs">
        <ul class="breadcrumb">
        <li id="publishDate">Publicado el: 02 enero 2017<span class="divider">|</span>
</li>
          <li id="projectVersion">Versión: 3.4.3-SNAPSHOT</li>
        </ul>
      </div>
      <div class="row-fluid">
        <div id="leftColumn" class="span2">
          <div class="well sidebar-nav">
<ul class="nav nav-list">
          <li class="nav-header">Manual de Referencia</li>
    <li><a href="index.html" title="Introducción"><span class="none"></span>Introducción</a>  </li>
    <li class="active"><a href="#"><span class="none"></span>Primeros pasos</a>
  </li>
    <li><a href="configuration.html" title="Configuración"><span class="icon-chevron-right"></span>Configuración</a>  </li>
    <li><a href="sqlmap-xml.html" title="Ficheros XML de mapeo"><span class="icon-chevron-right"></span>Ficheros XML de mapeo</a>  </li>
    <li><a href="dynamic-sql.html" title="SQL dinámico"><span class="none"></span>SQL dinámico</a>  </li>
    <li><a href="java-api.html" title="Java API"><span class="icon-chevron-right"></span>Java API</a>  </li>
    <li><a href="statement-builders.html" title="La clase SQL"><span class="none"></span>La clase SQL</a>  </li>
    <li><a href="logging.html" title="Logging"><span class="none"></span>Logging</a>  </li>
          <li class="nav-header">Documentación del proyecto</li>
    <li><a href="project-info.html" title="Información del proyecto"><span class="icon-chevron-right"></span>Información del proyecto</a>  </li>
    <li><a href="project-reports.html" title="Informes del proyecto"><span class="icon-chevron-right"></span>Informes del proyecto</a>  </li>
  </ul>
          <hr />
          <div id="poweredBy">
              <div class="clear"></div>
              <div class="clear"></div>
              <div class="clear"></div>
              <div class="clear"></div>
  <a href="http://maven.apache.org/" title="Generado por Maven" class="poweredBy"><img class="builtBy" alt="Generado por Maven" src="./images/logos/maven-feather.png" /></a>
              </div>
          </div>
        </div>
        <div id="bodyColumn"  class="span10" >


	
		<div class="section">
<h2><a name="Primeros_pasos"></a>Primeros pasos</h2>
		
    
    
<div class="section">
<h3><a name="Instalacin"></a>Instalaci&#xf3;n</h3>
      
<p>
        Para usar MyBatis s&#xf3;lo tienes que incluir el fichero
        <a class="externalLink" href="https://github.com/mybatis/mybatis-3/releases">mybatis-x.x.x.jar</a>
        en el classpath.
      </p>
      
<p>
        Si usas Maven a&#xf1;ade esta dependencia en tu pom.xml:
      </p>
        
<div class="source"><pre class="prettyprint">
&lt;dependency&gt;
  &lt;groupId&gt;org.mybatis&lt;/groupId&gt;
  &lt;artifactId&gt;mybatis&lt;/artifactId&gt;
  &lt;version&gt;x.x.x&lt;/version&gt;
&lt;/dependency&gt;</pre></div>
    </div>    
    
			
<div class="section">
<h3><a name="Cmo_crear_un_SqlSessionFactory_a_partir_de_XML"></a>C&#xf3;mo crear un SqlSessionFactory a partir de XML</h3>
		
			
<p>
				Una aplicaci&#xf3;n que usa MyBatis debe utilizar una instancia de
				SqlSessionFactory. Se puede obtener una instancia de
				SqlSessionFactory mediante un SqlSessionFactoryBuilder. Un
				SqlSessionFactoryBuilder
				puede construir una instancia de SqlSessionFactory a partir de un fichero
				de configuraci&#xf3;n XML o de una
				instancia personalizada de la clase Configuration.
			</p>
				
<p>
					Crear una instancia SqlSessionFactory desde un fichero xml es muy
					sencillo. Se recomienda usar un
					classpath resource, pero es posible usar cualquier InputStream, incluso
					creado con un path de fichero o una
					URL de tipo file://. MyBatis proporciona una clase de utilidad,
					llamada Resources, que contiene m&#xe9;todos
					que simplifican la carga de recursos desde el classpath u otras
					ubicaciones.
				</p>
				
<div class="source"><pre class="prettyprint">
String resource = &quot;org/mybatis/example/mybatis-config.xml&quot;;
InputStream inputStream = Resources.getResourceAsStream(resource);
SqlSessionFactory sqlSessionFactory = new SqlSessionFactoryBuilder().build(inputStream);</pre></div>
				
<p>
					El fichero de configuraci&#xf3;n XML contiene la configuraci&#xf3;n del
					<i>core</i>
					de MyBatis, incluyendo el DataSource
					para obtener instancias de conexi&#xf3;n a la base de datos y tambi&#xe9;n un
					TransactionManager para
					determinar c&#xf3;mo deben controlarse las transacciones. Los detalles completos
					de la configuraci&#xf3;n XML
					se describen m&#xe1;s adelante en este documento, pero continuaci&#xf3;n se
					muestra un ejemplo sencillo:
				</p>
				
<div class="source"><pre class="prettyprint">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;
&lt;!DOCTYPE configuration
  PUBLIC &quot;-//mybatis.org//DTD Config 3.0//EN&quot;
  &quot;http://mybatis.org/dtd/mybatis-3-config.dtd&quot;&gt;
&lt;configuration&gt;
  &lt;environments default=&quot;development&quot;&gt;
    &lt;environment id=&quot;development&quot;&gt;
      &lt;transactionManager type=&quot;JDBC&quot;/&gt;
      &lt;dataSource type=&quot;POOLED&quot;&gt;
        &lt;property name=&quot;driver&quot; value=&quot;${driver}&quot;/&gt;
        &lt;property name=&quot;url&quot; value=&quot;${url}&quot;/&gt;
        &lt;property name=&quot;username&quot; value=&quot;${username}&quot;/&gt;
        &lt;property name=&quot;password&quot; value=&quot;${password}&quot;/&gt;
      &lt;/dataSource&gt;
    &lt;/environment&gt;
  &lt;/environments&gt;
  &lt;mappers&gt;
    &lt;mapper resource=&quot;org/mybatis/example/BlogMapper.xml&quot;/&gt;
  &lt;/mappers&gt;
&lt;/configuration&gt;</pre></div>
				
<p>
					Aunque hay mucha m&#xe1;s informaci&#xf3;n sobre el fichero de configuraci&#xf3;n XML,
					el ejemplo anterior contiene
					las partes m&#xe1;s importantes. Observa que hay una cabecera XML,
					requerida para validar el fichero XML.
					El cuerpo del elemento environment contiene la configuraci&#xf3;n de la
					gesti&#xf3;n de transacciones
					correspondiente al entorno. El elemento mappers contiene la lista de mappers &#x2013; Los
					ficheros XML que
					contienen las sentencias SQL y las definiciones de mapeo.
				</p>
			</div>
			
<div class="section">
<h3><a name="Cmo_crear_un_SqlSessionFactory_sin_XML"></a>C&#xf3;mo crear un SqlSessionFactory sin XML</h3>
				
<p>
					Si lo prefieres puedes crear la configuraci&#xf3;n directamente desde
					Java, en lugar de desde XML, o crear tu
					propio
					<i>builder</i>
					. MyBatis dispone una clase Configuration que proporciona las
					mismas opciones de
					configuraci&#xf3;n que el fichero XML.
				</p>
				
<div class="source"><pre class="prettyprint">DataSource dataSource = BlogDataSourceFactory.getBlogDataSource();
TransactionFactory transactionFactory = new JdbcTransactionFactory();
Environment environment = new Environment(&quot;development&quot;, transactionFactory, dataSource);
Configuration configuration = new Configuration(environment);
configuration.addMapper(BlogMapper.class);
SqlSessionFactory sqlSessionFactory = new SqlSessionFactoryBuilder().build(configuration);</pre></div>
				
<p>
					Puedes observar que en este caso la configuraci&#xf3;n est&#xe1; a&#xf1;adiendo una
					clase mapper. Las clases mapper
					son clases Java que contienen anotaciones de mapeo SQL que permiten
					evitar el uso de XML. Sin
					embargo el XML sigue siendo necesario en ocasiones, debido a ciertas
					limitaciones de las anotaciones
					Java y la complejidad que pueden alcanzar los mapeos (ej. mapeos
					anidados de Joins). Por esto, MyBatis
					siempre busca si existe un fichero XML asociado a la clase mapper (en este
					caso, se buscar&#xe1; un fichero
					con nombre BlogMapper.xml cuyo nombre deriva del classpath y nombre de
					BlogMapper.class).
					Hablaremos m&#xe1;s sobre esto m&#xe1;s adelante.
				</p>
			</div>
			
<div class="section">
<h3><a name="Cmo_obtener_un_SqlSession_a_partir_del_SqlSessionFactory"></a>C&#xf3;mo obtener un SqlSession a partir del SqlSessionFactory</h3>
				
<p>
					Ahora que dispones de un SqlSessionFactory, tal y como su nombre indica,
					puedes adquirir una instancia
					de SqlSession. SqlSession contiene todos los m&#xe9;todos necesarios para
					ejecutar sentencias SQL contra la
					base de datos. Puedes ejecutar mapped statements con la instancia de
					SqlSession de la siguiente forma:
				</p>
				
<div class="source"><pre class="prettyprint">SqlSession session = sqlSessionFactory.openSession();
try {
  Blog blog = (Blog) session.selectOne(&quot;org.mybatis.example.BlogMapper.selectBlog&quot;, 101);
} finally {
  session.close();
}</pre></div>
				
<p>
					Aunque esta forma de trabajar con la SqlSession funciona correctamente y
					les ser&#xe1; familiar a aquellos que han usado las versiones anteriores
					de MyBatis, actualmente existe una opci&#xf3;n m&#xe1;s recomendada. Usar un
					interface (ej. BlogMapper.class) que describe tanto el par&#xe1;metro de
					entrada como el de retorno para una sentencia. De esta forma
					tendr&#xe1;s un c&#xf3;digo m&#xe1;s sencillo y type safe, sin castings ni
					literales de tipo String que son fuente frecuente de errores.
				</p>
				
<p>
					Por ejemplo:
				</p>
				
<div class="source"><pre class="prettyprint">SqlSession session = sqlSessionFactory.openSession();
try {
  BlogMapper mapper = session.getMapper(BlogMapper.class);
  Blog blog = mapper.selectBlog(101);
} finally {
  session.close();
}</pre></div>
				
<p>
					Vemos con detalle c&#xf3;mo funciona esto.
				</p>
			</div>
			
<div class="section">
<h3><a name="Cmo_funcionan_los_Mapped_Statements"></a>C&#xf3;mo funcionan los Mapped Statements</h3>
				
<p>
					Te estar&#xe1;s preguntando qu&#xe9; se est&#xe1; ejecutando en SqlSession o en la
					clase Mapper. Los
					<i>Mapped Statements</i>
					son una materia muy densa, y ser&#xe1; el tema que domine la mayor parte
					de esta documentaci&#xf3;n. Pero, para que te hagas una idea de qu&#xe9; se
					est&#xe1; ejecutando realmente proporcionaremos un par de ejemplos.
				</p>
				
<p>
					En cualquiera de los ejemplos a continuaci&#xf3;n podr&#xed;an haberse usado
					indistintamente XML o anotaciones. Veamos primero el XML. Todas las
					opciones de configuraci&#xf3;n de MyBatis pueden obtenerse mediante el
					lenguaje de mapeo XML que ha popularizado a MyBatis durante a&#xf1;os.
					Si ya has usado MyBatis antes el concepto te ser&#xe1; familiar, pero
					ver&#xe1;s que hay numerosas mejoras en los ficheros de mapeo XML que
					iremos explicando m&#xe1;s adelante. Por ejemplo este mapped statement
					en XML har&#xed;a funcionar correctamente la llamada al SqlSession que
					hemos visto previamente.
				</p>
				
<div class="source"><pre class="prettyprint">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;
&lt;!DOCTYPE mapper
  PUBLIC &quot;-//mybatis.org//DTD Mapper 3.0//EN&quot;
  &quot;http://mybatis.org/dtd/mybatis-3-mapper.dtd&quot;&gt;
&lt;mapper namespace=&quot;org.mybatis.example.BlogMapper&quot;&gt;
  &lt;select id=&quot;selectBlog&quot; resultType=&quot;Blog&quot;&gt;
    select * from Blog where id = #{id}
  &lt;/select&gt;
&lt;/mapper&gt;</pre></div>
				
<p>
					Aunque pudiera parecer que hay excesivo XML para un ejemplo tan simple,
					en realidad no hay tanto. Puedes definir tantos mapped statements
					en un solo fichero XML como quieras as&#xed; que rentabilizar&#xe1;s las
					l&#xed;neas XML extra que corresponden a la cabecera XML y a la
					declaraci&#xf3;n de doctype. El resto del fichero se explica por s&#xed;
					mismo. Define un nombre para el mapped statement &#x201c;selectBlog&#x201d;, en
					un namespace (espacio de nombres) &#x201c;org.mybatis.example.BlogMapper&#x201d;,
					que permite realizar una llamada especificando el nombre completo
					(fully qualified) &#x201c;org.mybatis.example.BlogMapper.selectBlog&#x201d; tal y
					como muestra el c&#xf3;digo a continuaci&#xf3;n:
				</p>
				
<div class="source"><pre class="prettyprint">Blog blog = session.selectOne(&quot;org.mybatis.example.BlogMapper.selectBlog&quot;, 101);</pre></div>
				
<p>
					Observa el gran parecido que hay entre esta llamada y la llamada a una
					clase java y hay una raz&#xf3;n para eso. Este literal puede mapearse
					con una clase que tenga el mismo nombre que el namespace, con un
					m&#xe9;todo que coincida con el nombre del statement, y con par&#xe1;metros
					de entrada y retorno iguales que los del statement. Esto permite
					que puedas hacer la misma llamada contra una interfaz Mapper tal y
					como se muestra a continuaci&#xf3;n:
				</p>
				
<div class="source"><pre class="prettyprint">BlogMapper mapper = session.getMapper(BlogMapper.class);
Blog blog = mapper.selectBlog(101);</pre></div>
				
<p>
					Este segunda forma de llamada tiene muchas ventajas. Primeramente, no
					se usan literales de tipo String lo cual es mucho m&#xe1;s seguro dado
					que los errores se detectan en tiempo de compilaci&#xf3;n. Segundo, si
					tu IDE dispone de autocompletado de c&#xf3;digo podr&#xe1;s aprovecharlo.
				</p>
				<hr />
				
<p>
					<span class="label important">NOTA</span>
					<b>Una nota sobre los namespaces.</b>
				</p>
				
<p>
					<b>Los namespaces (espacios de nombres)</b>
					eran opcionales en versiones anteriores de MyBatis, lo cual creaba
					confusi&#xf3;n y era de poca ayuda. Los namespaces son ahora
					obligatorios y tienen un prop&#xf3;sito m&#xe1;s all&#xe1; de la clasificaci&#xf3;n de
					statements.
				</p>
				
<p>
					Los namespaces permiten realizar el enlace con los interfaces como se
					ha visto anteriormente, e incluso si crees que no los vas a usar a
					corto plazo, es recomendable que sigas estas pr&#xe1;cticas de
					organizaci&#xf3;n de c&#xf3;digo por si en un futuro decides hacer lo
					contrario. Usar un namespace y colocarlo en el paquete java que
					corresponde con el namespace har&#xe1; tu c&#xf3;digo m&#xe1;s legible y mejorar&#xe1;
					la usabilidad de MyBatis a largo plazo.
				</p>
				
<p>
					<b>Resoluci&#xf3;n de nombres:</b>
					Para reducir la cantidad de texto a escribir MyBatis usa las
					siguientes normas de resoluci&#xf3;n de nombres para todos los elementos
					de configuraci&#xf3;n, incluidos statements, result maps, cach&#xe9;s, etc.
				</p>
				
<ul>
					
<li>Primeramente se buscan directamente los nombres completamente
						cualificados (fully qualified names) (ej.
						&#x201c;com.mypackage.MyMapper.selectAllThings&#x201d;).
					</li>
					
<li>Pueden usarse los nombres cortos (ej. &#x201c;selectAllThings&#x201d;)
						siempre que no haya ambig&#xfc;edad. Sin embargo, si hubiera dos o m&#xe1;s
						elementos (ej. &#x201c;com.foo.selectAllThings&quot; y
						&quot;com.bar.selectAllThings&#x201d;), entonces obtendr&#xe1;s un error indicando
						que el nombre es ambiguo y que debe ser &#x201c;fully qualified&#x201d;.
					</li>
				</ul>
				<hr />
				
<p>
					Hay otro aspecto importante sobre las clases Mapper como BlogMapper.
					Sus mapped statements pueden no estar en ning&#xfa;n fichero XML. En su
					lugar, pueden usarse anotaciones. Por ejemplo, el XML puede ser
					eliminado y reemplazarse por:
				</p>
				
<div class="source"><pre class="prettyprint">package org.mybatis.example;
public interface BlogMapper {
  @Select(&quot;SELECT * FROM blog WHERE id = #{id}&quot;)
  Blog selectBlog(int id);
}</pre></div>
				
<p>
					Las anotaciones son mucho m&#xe1;s claras para sentencias sencillas, sin
					embargo, las anotaciones java son limitadas y m&#xe1;s complicadas de
					usar para sentencias complejas. Por lo tanto, si tienes que hacer
					algo complejo, es mejor que uses los ficheros XML.
				</p>
				
<p>
					Es decisi&#xf3;n tuya y de tu proyecto cu&#xe1;l de los dos m&#xe9;todos usar y c&#xf3;mo
					de importante es que los mapped statements est&#xe9;n definidos de forma
					consistente. Dicho esto, no est&#xe1;s limitado a usar un solo m&#xe9;todo,
					puedes migrar f&#xe1;cilmente de los mapped statements basados en
					anotaciones a XML y viceversa.
				</p>
			</div>
			
<div class="section">
<h3><a name="ambito_y_ciclo_de_vida"></a>&#xc1;mbito y ciclo de vida</h3>
				
<p>Es muy importante entender los distintos &#xe1;mbitos y ciclos de vida
					de las clases de las que hemos hablado hasta ahora. Usarlas de
					forma incorrecta puede traer serias complicaciones.</p>
				<hr />
				
<p>
					<span class="label important">NOTA</span>
					<b>Ciclo de vida de los objetos y frameworks de inyecci&#xf3;n de
						dependencias</b>
				</p>
				
<p>
					Los frameworks de inyecci&#xf3;n de dependencias pueden crear
					SqlSessions y mappers
					<i>thread safe</i>
					(reeentrante) y
					transaccionales, e inyectarlos directmaente en tus beans de forma que puedes
					olvidarte de su ciclo de vida.
					Echa un vistazo a los sub-projectos MyBatis-Spring o MyBatis-Guice para
					conocer m&#xe1;s detalles sobre c&#xf3;mo usar
					MyBatis con estos frameworks.
				</p>
				<hr />

				
<div class="section">
<h4><a name="SqlSessionFactoryBuilder"></a>SqlSessionFactoryBuilder</h4>
				
<p>Esta clase puede instanciarse, usarse y desecharse. No es
					necesario mantenerla una vez que ya has creado la
					SqlSessionFactory. Por lo tanto el mejor &#xe1;mbito para el
					SqlSessionFactoryBuilder es el m&#xe9;todo (ej. una variable local de
					m&#xe9;todo). Puedes reusar el SqlSessionFactoryBuilder para construir
					m&#xe1;s de una instancia de SqlSessionFactory, pero aun as&#xed; es
					recomendable no conservar el objeto para asegurarse de que todos
					los recursos utilizados para el parseo de XML se han liberado
					correctamente y est&#xe1;n disponibles para temas m&#xe1;s importantes.
				</p>
				</div>
<div class="section">
<h4><a name="SqlSessionFactory"></a>SqlSessionFactory</h4>
				
<p>Una vez creado, el SqlSessionFactory deber&#xed;a existir durante toda
					la ejecuci&#xf3;n de tu aplicaci&#xf3;n. No deber&#xed;a haber ning&#xfa;n o casi
					ning&#xfa;n motivo para eliminarlo o recrearlo. Es una buena pr&#xe1;ctica el
					no recrear el SqlSessionFactory en tu aplicaci&#xf3;n m&#xe1;s de una vez. Y
					lo contrario deber&#xed;a considerarse c&#xf3;digo sospechoso. Por tanto el
					mejor &#xe1;mbito para el SqlSessionFactory es el &#xe1;mbito de aplicaci&#xf3;n.
					Esto puede conseguirse de muchas formas. Lo m&#xe1;s sencillo es usar el
					patr&#xf3;n Singleton o el Static Singleton. </p>
				</div>
<div class="section">
<h4><a name="SqlSession"></a>SqlSession</h4>
				
<p>Cada thread (hilo de ejecuci&#xf3;n) deber&#xed;a tener su propia instancia
					de SqlSession. Las instancias de SqlSession no son thread safe y no
					deben ser compartidas. Por tanto el &#xe1;mbito adecuado es el de
					petici&#xf3;n (request) o bien el m&#xe9;todo. No guardes nunca instancias de
					SqlSession en un campo est&#xe1;tico o incluso en una propiedad de
					instancia de una clase. Nunca guardes referencias a una SqlSession
					en ning&#xfa;n tipo de &#xe1;mbito gestionado como la HttpSession. Si est&#xe1;s
					usando un framework web considera que el SqlSession deber&#xed;a tener
					un &#xe1;mbito similar al HttpRequest. Es decir, cuando recibas una
					petici&#xf3;n http puedes abrir una SqlSession y cerrarla cuando
					devuelvas la respuesta. Cerrar la SqlSession es muy importante.
					Deber&#xed;as asegurarte de que se cierra con un bloque finally. A
					continuaci&#xf3;n se muestra el patr&#xf3;n est&#xe1;ndar para asegurarse de que
					las sesiones se cierran correctamente.</p>
				
<div class="source"><pre class="prettyprint">SqlSession session = sqlSessionFactory.openSession();
try {
  // do work
} finally {
  session.close();
}</pre></div>
				
<p>Usando este patr&#xf3;n en todo el c&#xf3;digo se asegura que los recursos
					de base de datos se liberar&#xe1;n correctamente.</p>
				</div>
<div class="section">
<h4><a name="Instancias_de_mapper"></a>Instancias de mapper</h4>
				
<p>Los mappers son interfaces que creas como enlace con los mapped
					statements. Las instancias de mappers se obtienen de una
					SqlSession. Y por tanto, t&#xe9;cnicamente el mayor &#xe1;mbito de una
					instancia de Mapper es el mismo que el de la SqlSession de la que
					fueron creados. Sin embargo el &#xe1;mbito m&#xe1;s recomendable para una
					instancia de mapper es el &#xe1;mbito de m&#xe9;todo. Es decir, deber&#xed;an ser
					obtenidos en el m&#xe9;todo que vaya a usarlos y posteriormente
					descartarlos. No es necesario que sean cerrados expl&#xed;citamente.
					Aunque no es un problema propagar estos objetos por varias clases
					dentro de una misma llamada, debes tener cuidado porque puede que
					la situaci&#xf3;n se te vaya de las manos. Hazlo f&#xe1;cil (keep it simple)
					y mant&#xe9;n los mappers en el &#xe1;mbito de m&#xe9;todo. Este ejemplo muestra
					esta pr&#xe1;ctica:</p>
				
<div class="source"><pre class="prettyprint">SqlSession session = sqlSessionFactory.openSession();
try {
  BlogMapper mapper = session.getMapper(BlogMapper.class);
  // do work
} finally {
  session.close();
}
</pre></div>

			</div></div>
		</div>
	

        </div>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>Copyright &copy;2009&#x2013;2017
<a href="http://www.mybatis.org/">MyBatis.org</a>.
All rights reserved.</p>
        </div>
        </div>
    </footer>
    </body>
</html>
