<!DOCTYPE html>
<!--
 | Generated by Apache Maven Doxia Site Renderer 1.7.4 at 02 1월 2017 
 | Rendered using Apache Maven Fluido Skin 1.6
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ko" lang="ko">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="author" content="Clinton Begin" />
    <meta name="author" content="이동국(한국어 번역)" />
    <meta name="Date-Revision-yyyymmdd" content="20170102" />
    <meta http-equiv="Content-Language" content="ko" />
    <title>MyBatis &#x2013; 마이바티스 3 | 동적 SQL</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-1.6.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
      <script type="text/javascript" src="./js/apache-maven-fluido-1.6.min.js"></script>
      </head>
    <body class="topBarDisabled">
      <div class="container-fluid">
      <div id="banner">
        <div class="pull-left"><div id="bannerLeft"><h2>mybatis</h2>
</div>
</div>
        <div class="pull-right"><a href="../../" id="bannerRight" title="MyBatis logo"><img src="http://mybatis.github.io/images/mybatis-logo.png"  alt="MyBatis logo"/></a></div>
        <div class="clear"><hr/></div>
      </div>

      <div id="breadcrumbs">
        <ul class="breadcrumb">
        <li id="publishDate">Last Published: 02 1월 2017<span class="divider">|</span>
</li>
          <li id="projectVersion">Version: 3.4.3-SNAPSHOT</li>
        </ul>
      </div>
      <div class="row-fluid">
        <div id="leftColumn" class="span2">
          <div class="well sidebar-nav">
<ul class="nav nav-list">
          <li class="nav-header">Core</li>
    <li><a href="index.html" title="소개"><span class="none"></span>소개</a>  </li>
    <li><a href="getting-started.html" title="시작하기"><span class="none"></span>시작하기</a>  </li>
    <li><a href="configuration.html" title="매퍼 설정"><span class="icon-chevron-right"></span>매퍼 설정</a>  </li>
    <li><a href="sqlmap-xml.html" title="Mapper XML 파일"><span class="icon-chevron-right"></span>Mapper XML 파일</a>  </li>
    <li class="active"><a href="#"><span class="none"></span>동적 SQL</a>
  </li>
    <li><a href="java-api.html" title="자바 API"><span class="icon-chevron-right"></span>자바 API</a>  </li>
    <li><a href="statement-builders.html" title="SQL Builder 클래스"><span class="none"></span>SQL Builder 클래스</a>  </li>
    <li><a href="logging.html" title="로깅"><span class="none"></span>로깅</a>  </li>
          <li class="nav-header">프로젝트 문서화</li>
    <li><a href="project-info.html" title="프로젝트 정보"><span class="icon-chevron-right"></span>프로젝트 정보</a>  </li>
    <li><a href="project-reports.html" title="프로젝트 보고서"><span class="icon-chevron-right"></span>프로젝트 보고서</a>  </li>
  </ul>
          <hr />
          <div id="poweredBy">
              <div class="clear"></div>
              <div class="clear"></div>
              <div class="clear"></div>
              <div class="clear"></div>
  <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy"><img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" /></a>
              </div>
          </div>
        </div>
        <div id="bodyColumn"  class="span10" >


  
    <div class="section">
<h2><a name="a_SQL"></a>&#xb3d9;&#xc801; SQL</h2>
      
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc758; &#xac00;&#xc7a5; &#xac15;&#xb825;&#xd55c; &#xae30;&#xb2a5; &#xc911; &#xd558;&#xb098;&#xb294; &#xb3d9;&#xc801; SQL&#xc744; &#xcc98;&#xb9ac;&#xd558;&#xb294; &#xbc29;&#xbc95;&#xc774;&#xb2e4;. 
	  JDBC&#xb098; &#xb2e4;&#xb978; &#xc720;&#xc0ac;&#xd55c; &#xd504;&#xb808;&#xc784;&#xc6cc;&#xd06c;&#xb97c; &#xc0ac;&#xc6a9;&#xd574;&#xbcf8; &#xacbd;&#xd5d8;&#xc774; &#xc788;&#xb2e4;&#xba74; &#xb3d9;&#xc801;&#xc73c;&#xb85c; SQL &#xc744; &#xad6c;&#xc131;&#xd558;&#xb294; &#xac83;&#xc774; &#xc5bc;&#xb9c8;&#xb098; &#xd798;&#xb4e0; &#xc791;&#xc5c5;&#xc778;&#xc9c0; &#xc774;&#xd574;&#xd560; &#xac83;&#xc774;&#xb2e4;. 
	  &#xac04;&#xd639; &#xacf5;&#xbc31;&#xc774;&#xb098; &#xcf64;&#xb9c8;&#xb97c; &#xbd99;&#xc774;&#xb294; &#xac83;&#xc744; &#xc78a;&#xc5b4;&#xbcf8; &#xc801;&#xb3c4; &#xc788;&#xc744; &#xac83;&#xc774;&#xb2e4;. 
	  &#xb3d9;&#xc801; SQL &#xc740; &#xadf8;&#xb9cc;&#xd07c; &#xc5b4;&#xb824;&#xc6b4; &#xac83;&#xc774;&#xb2e4;.</p>
      
<p>&#xb3d9;&#xc801; SQL &#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xac83;&#xc740; &#xacb0;&#xcf54; &#xd30c;&#xd2f0;&#xac00; &#xb420; &#xc218; &#xc5c6;&#xc744; &#xac83;&#xc774;&#xb2e4;. 
	  &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xac15;&#xb825;&#xd55c; &#xb3d9;&#xc801; SQL &#xc5b8;&#xc5b4;&#xb85c; &#xc774; &#xc0c1;&#xd669;&#xc740; &#xac1c;&#xc120;&#xd55c;&#xb2e4;.</p>
      
<p>&#xb3d9;&#xc801; SQL &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb4e4;&#xc740; JSTL&#xc774;&#xb098; XML&#xae30;&#xbc18;&#xc758; &#xd14d;&#xc2a4;&#xd2b8; &#xd504;&#xb85c;&#xc138;&#xc11c;&#xb97c; &#xc0ac;&#xc6a9;&#xd574; &#xbcf8; &#xc0ac;&#xb78c;&#xc5d0;&#xac8c;&#xb294; &#xce5c;&#xc219;&#xd560; &#xac83;&#xc774;&#xb2e4;. 
	  &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc758; &#xc774;&#xc804; &#xbc84;&#xc804;&#xc5d0;&#xc11c;&#xb294; &#xc54c;&#xace0; &#xc774;&#xd574;&#xd574;&#xc57c; &#xd560; &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xac00; &#xb9ce;&#xc558;&#xb2e4;. 
	  &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; 3 &#xc5d0;&#xc11c;&#xb294; &#xc774;&#xb97c; &#xd06c;&#xac8c; &#xac1c;&#xc120;&#xd588;&#xace0; &#xc2e4;&#xc81c; &#xc0ac;&#xc6a9;&#xd574;&#xc57c; &#xd560; &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xac00; &#xbc18; &#xc774;&#xd558;&#xb85c; &#xc904;&#xc5c8;&#xb2e4;. 
	  &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc758; &#xb2e4;&#xb978; &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xc758; &#xc0ac;&#xc6a9;&#xc744; &#xcd5c;&#xb300;&#xd55c; &#xc81c;&#xac70;&#xd558;&#xae30; &#xc704;&#xd574; OGNL &#xae30;&#xbc18;&#xc758; &#xd45c;&#xd604;&#xc2dd;&#xc744; &#xac00;&#xc838;&#xc654;&#xb2e4;.</p>
      
<ul>
        
<li>if</li>
        
<li>choose (when, otherwise)</li>
        
<li>trim (where, set)</li>
        
<li>foreach</li>
      </ul>
      <a name="if"></a>
<div class="section" id="if">
<h3><a name="if"></a>if</h3>
        
<p>&#xb3d9;&#xc801; SQL &#xc5d0;&#xc11c; &#xac00;&#xc7a5; &#xacf5;&#xd1b5;&#xc801;&#xc73c;&#xb85c; &#xc0ac;&#xc6a9;&#xb418;&#xb294; &#xac83;&#xc73c;&#xb85c; where&#xc758; &#xc77c;&#xbd80;&#xb85c; &#xd3ec;&#xd568;&#xb420; &#xc218; &#xc788;&#xb2e4;. 
		&#xc608;&#xb97c; &#xb4e4;&#xba74;:</p>
        
<div class="source"><pre class="prettyprint">&lt;select id=&quot;findActiveBlogWithTitleLike&quot; 
     resultType=&quot;Blog&quot;&gt;
  SELECT * FROM BLOG 
  WHERE state = &#x2018;ACTIVE&#x2019; 
  &lt;if test=&quot;title != null&quot;&gt;
    AND title like #{title}
  &lt;/if&gt;
&lt;/select&gt;</pre></div>
        
<p>&#xc774; &#xad6c;&#xbb38;&#xc740; &#xc120;&#xd0dd;&#xc801;&#xc73c;&#xb85c; &#xbb38;&#xc790;&#xc5f4; &#xac80;&#xc0c9; &#xae30;&#xb2a5;&#xc744; &#xc81c;&#xacf5;&#xd560; &#xac83;&#xc774;&#xb2e4;. 
		&#xb9cc;&#xc57d;&#xc5d0; title &#xac12;&#xc774; &#xc5c6;&#xb2e4;&#xba74; &#xbaa8;&#xb4e0; active &#xc0c1;&#xd0dc;&#xc758; Blog &#xac00; &#xb9ac;&#xd134;&#xb420; &#xac83;&#xc774;&#xb2e4;. 
		&#xd558;&#xc9c0;&#xb9cc; title &#xac12;&#xc774; &#xc788;&#xb2e4;&#xba74; &#xadf8; &#xac12;&#xacfc; &#xbe44;&#xc2b7;&#xd55c; &#xb370;&#xc774;&#xd130;&#xb97c; &#xcc3e;&#xac8c; &#xb420; &#xac83;&#xc774;&#xb2e4;.</p>
        
<p>title&#xacfc; author&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xc5ec; &#xac80;&#xc0c9;&#xd558;&#xace0; &#xc2f6;&#xb2e4;&#xba74;? 
		&#xba3c;&#xc800; &#xc758;&#xbbf8;&#xac00; &#xc880;&#xb354; &#xc798; &#xc804;&#xb2ec;&#xb418;&#xb3c4;&#xb85d; &#xad6c;&#xbb38;&#xc758; &#xc774;&#xb984;&#xc744; &#xbcc0;&#xacbd;&#xd560; &#xac83;&#xc774;&#xb2e4;. 
		&#xadf8;&#xb9ac;&#xace0; &#xb2e4;&#xb978; &#xc870;&#xac74;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;.</p>
        
<div class="source"><pre class="prettyprint">&lt;select id=&quot;findActiveBlogLike&quot; 
     resultType=&quot;Blog&quot;&gt;
  SELECT * FROM BLOG WHERE state = &#x2018;ACTIVE&#x2019; 
  &lt;if test=&quot;title != null&quot;&gt;
    AND title like #{title}
  &lt;/if&gt;
  &lt;if test=&quot;author != null and author.name != null&quot;&gt;
    AND author_name like #{author.name}
  &lt;/if&gt;
&lt;/select&gt;</pre></div>
      </div>
      <a name="chooseWhenOtherwise"></a>
<div class="section" id="chooseWhenOtherwise">
<h3><a name="choose_when_otherwise"></a>choose, when, otherwise</h3>
        
<p>&#xc6b0;&#xb9ac;&#xb294; &#xc885;&#xc885; &#xc801;&#xc6a9; &#xd560; &#xbaa8;&#xb4e0; &#xc870;&#xac74;&#xc744; &#xc6d0;&#xd558;&#xb294; &#xb300;&#xc2e0;&#xc5d0; &#xd55c;&#xac00;&#xc9c0; &#xacbd;&#xc6b0;&#xb9cc;&#xc744; &#xc6d0;&#xd560; &#xc218; &#xc788;&#xb2e4;. 
		&#xc790;&#xbc14;&#xc5d0;&#xc11c;&#xb294; switch &#xad6c;&#xbb38;&#xacfc; &#xc720;&#xc0ac;&#xd558;&#xba70; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc5d0;&#xc11c;&#xb294; choose &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb97c; &#xc81c;&#xacf5;&#xd55c;&#xb2e4;.</p>
        
<p>&#xc704; &#xc608;&#xc81c;&#xb97c; &#xb2e4;&#xc2dc; &#xc0ac;&#xc6a9;&#xd574;&#xbcf4;&#xc790;. 
		&#xc9c0;&#xae08;&#xc740; title&#xb9cc;&#xc73c;&#xb85c; &#xac80;&#xc0c9;&#xd558;&#xace0; author&#xac00; &#xc788;&#xb2e4;&#xba74; &#xadf8; &#xac12;&#xc73c;&#xb85c; &#xac80;&#xc0c9;&#xb41c;&#xb2e4;. 
		&#xb458;&#xb2e4; &#xc81c;&#xacf5;&#xd558;&#xc9c0; &#xc54a;&#xb294;&#xb2e4;&#xba74; featured &#xc0c1;&#xd0dc;&#xc758; blog&#xac00; &#xb9ac;&#xd134;&#xb41c;&#xb2e4;.</p>
        
<div class="source"><pre class="prettyprint">&lt;select id=&quot;findActiveBlogLike&quot; 
     resultType=&quot;Blog&quot;&gt;
  SELECT * FROM BLOG WHERE state = &#x2018;ACTIVE&#x2019;
  &lt;choose&gt;
    &lt;when test=&quot;title != null&quot;&gt;
      AND title like #{title}
    &lt;/when&gt;
    &lt;when test=&quot;author != null and author.name != null&quot;&gt;
      AND author_name like #{author.name}
    &lt;/when&gt;
    &lt;otherwise&gt;
      AND featured = 1
    &lt;/otherwise&gt;
  &lt;/choose&gt;
&lt;/select&gt;</pre></div>
      </div>
      <a name="trimWhereSet"></a>
<div class="section" id="trimWhereSet">
<h3><a name="trim_where_set"></a>trim, where, set</h3>
        
<p>&#xc55e;&#xc11c; &#xc608;&#xc81c;&#xb294; &#xc545;&#xba85;&#xb192;&#xac8c; &#xb2e4;&#xc591;&#xd55c; &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xac00; &#xc0ac;&#xc6a9;&#xb41c; &#xb3d9;&#xc801; SQL &#xc774;&#xb2e4;. 
		&#x201c;if&#x201d; &#xc608;&#xc81c;&#xb97c; &#xc0ac;&#xc6a9;&#xd574;&#xbcf4;&#xc790;.</p>
        
<div class="source"><pre class="prettyprint">&lt;select id=&quot;findActiveBlogLike&quot; 
     resultType=&quot;Blog&quot;&gt;
  SELECT * FROM BLOG 
  WHERE 
  &lt;if test=&quot;state != null&quot;&gt;
    state = #{state}
  &lt;/if&gt; 
  &lt;if test=&quot;title != null&quot;&gt;
    AND title like #{title}
  &lt;/if&gt;
  &lt;if test=&quot;author != null and author.name != null&quot;&gt;
    AND author_name like #{author.name}
  &lt;/if&gt;
&lt;/select&gt;</pre></div>
        
<p>&#xc5b4;&#xb5a4; &#xc870;&#xac74;&#xc5d0;&#xb3c4; &#xd574;&#xb2f9;&#xb418;&#xc9c0; &#xc54a;&#xb294;&#xb2e4;&#xba74; &#xc5b4;&#xb5a4; &#xc77c;&#xc774; &#xbc8c;&#xc5b4;&#xc9c8;&#xae4c;? 
		&#xc544;&#xb9c8;&#xb3c4; &#xb2e4;&#xc74c;&#xacfc; &#xac19;&#xc740; SQL &#xc774; &#xb9cc;&#xb4e4;&#xc5b4;&#xc9c8; &#xac83;&#xc774;&#xb2e4;.</p>
        
<div class="source"><pre class="prettyprint">SELECT * FROM BLOG 
WHERE</pre></div>
        
<p>&#xc544;&#xb9c8;&#xb3c4; &#xc774;&#xac74; &#xc2e4;&#xd328;&#xd560; &#xac83;&#xc774;&#xb2e4;. 
		&#xb450;&#xbc88;&#xc9f8; &#xc870;&#xac74;&#xc5d0;&#xb9cc; &#xd574;&#xb2f9;&#xb41c;&#xb2e4;&#xba74; &#xbb34;&#xc2a8; &#xc77c;&#xc774; &#xbc8c;&#xc5b4;&#xc9c8;&#xae4c;? 
		&#xc544;&#xb9c8;&#xb3c4; &#xb2e4;&#xc74c;&#xacfc; &#xac19;&#xc740; SQL&#xc774; &#xb9cc;&#xb4e4;&#xc5b4;&#xc9c8; &#xac83;&#xc774;&#xb2e4;.</p>
        
<div class="source"><pre class="prettyprint">SELECT * FROM BLOG 
WHERE 
AND title like &#x2018;someTitle&#x2019;</pre></div>
        
<p>&#xc774;&#xac83;&#xb3c4; &#xc544;&#xb9c8; &#xc2e4;&#xd328;&#xd560; &#xac83;&#xc774;&#xb2e4;. 
		&#xc774; &#xbb38;&#xc81c;&#xb294; &#xc870;&#xac74;&#xb9cc; &#xac00;&#xc9c0;&#xace0;&#xb294; &#xd574;&#xacb0;&#xb418;&#xc9c0; &#xc54a;&#xc558;&#xb2e4;. 
		&#xc774;&#xb807;&#xac8c; &#xc791;&#xc131;&#xd588;&#xb2e4;&#xba74; &#xb2e4;&#xc2dc;&#xb294; &#xc774;&#xb807;&#xac8c; &#xc791;&#xc131;&#xd558;&#xc9c0; &#xc54a;&#xac8c; &#xb420; &#xac83;&#xc774;&#xb2e4;.</p>
        
<p>&#xc2e4;&#xd328;&#xd558;&#xc9c0; &#xc54a;&#xae30; &#xc704;&#xd574;&#xc11c; &#xc870;&#xae08; &#xc218;&#xc815;&#xd574;&#xc57c; &#xd55c;&#xb2e4;. 
		&#xc870;&#xae08; &#xc218;&#xc815;&#xd558;&#xba74; &#xc544;&#xb9c8;&#xb3c4; &#xb2e4;&#xc74c;&#xacfc; &#xac19;&#xc744; &#xac83;&#xc774;&#xb2e4;.</p>
        
<div class="source"><pre class="prettyprint">&lt;select id=&quot;findActiveBlogLike&quot; 
     resultType=&quot;Blog&quot;&gt;
  SELECT * FROM BLOG 
  &lt;where&gt; 
    &lt;if test=&quot;state != null&quot;&gt;
         state = #{state}
    &lt;/if&gt; 
    &lt;if test=&quot;title != null&quot;&gt;
        AND title like #{title}
    &lt;/if&gt;
    &lt;if test=&quot;author != null and author.name != null&quot;&gt;
        AND author_name like #{author.name}
    &lt;/if&gt;
  &lt;/where&gt;
&lt;/select&gt;</pre></div>
        
<p>where &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb294; &#xd0dc;&#xadf8;&#xc5d0; &#xc758;&#xd574; &#xcee8;&#xd150;&#xce20;&#xac00; &#xb9ac;&#xd134;&#xb418;&#xba74; &#xb2e8;&#xc21c;&#xd788; &#x201c;WHERE&#x201d;&#xb9cc;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. 
		&#xac8c;&#xb2e4;&#xac00; &#xcee8;&#xd150;&#xce20;&#xac00; &#x201c;AND&#x201d;&#xb098; &#x201c;OR&#x201d;&#xb85c; &#xc2dc;&#xc791;&#xd55c;&#xb2e4;&#xba74; &#xadf8; &#x201c;AND&#x201d;&#xb098; &#x201c;OR&#x201d;&#xb97c; &#xc9c0;&#xc6cc;&#xbc84;&#xb9b0;&#xb2e4;.</p>
        
<p>&#xb9cc;&#xc57d;&#xc5d0; where &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xac00; &#xae30;&#xb300;&#xd55c; &#xac83;&#xcc98;&#xb7fc; &#xc791;&#xb3d9;&#xd558;&#xc9c0; &#xc54a;&#xb294;&#xb2e4;&#xba74; trim &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb97c; &#xc0ac;&#xc6a9;&#xc790; &#xc815;&#xc758;&#xd560; &#xc218;&#xb3c4; &#xc788;&#xb2e4;. 
		&#xc608;&#xb97c;&#xb4e4;&#xc5b4; &#xb2e4;&#xc74c;&#xc740; where &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xc5d0; &#xb300;&#xd55c; trim &#xae30;&#xb2a5;&#xacfc; &#xb3d9;&#xc77c;&#xd558;&#xb2e4;.</p>
        
<div class="source"><pre class="prettyprint">&lt;trim prefix=&quot;WHERE&quot; prefixOverrides=&quot;AND |OR &quot;&gt;
  ... 
&lt;/trim&gt;</pre></div>
        
<p>override &#xc18d;&#xc131;&#xc740; &#xc624;&#xbc84;&#xb77c;&#xc774;&#xb4dc;&#xd558;&#xb294; &#xd14d;&#xc2a4;&#xd2b8;&#xc758; &#xbaa9;&#xb85d;&#xc744; &#xc81c;&#xd55c;&#xd55c;&#xb2e4;. 
		&#xacb0;&#xacfc;&#xb294; override &#xc18d;&#xc131;&#xc5d0; &#xba85;&#xc2dc;&#xb41c; &#xac83;&#xb4e4;&#xc744; &#xc9c0;&#xc6b0;&#xace0; with &#xc18d;&#xc131;&#xc5d0; &#xba85;&#xc2dc;&#xb41c; &#xac83;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;.</p>
        
<p>&#xb2e4;&#xc74c; &#xc608;&#xc81c;&#xb294; &#xb3d9;&#xc801;&#xc778; update &#xad6c;&#xbb38;&#xc758; &#xc720;&#xc0ac;&#xd55c; &#xacbd;&#xc6b0;&#xc774;&#xb2e4;. 
		set &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb294; update &#xd558;&#xace0;&#xc790; &#xd558;&#xb294; &#xce7c;&#xb7fc;&#xc744; &#xb3d9;&#xc801;&#xc73c;&#xb85c; &#xd3ec;&#xd568;&#xc2dc;&#xd0a4;&#xae30; &#xc704;&#xd574; &#xc0ac;&#xc6a9;&#xb420; &#xc218; &#xc788;&#xb2e4;. 
		&#xc608;&#xb97c; &#xb4e4;&#xc5b4;:</p>
        
<div class="source"><pre class="prettyprint">&lt;update id=&quot;updateAuthorIfNecessary&quot;&gt;
  update Author
    &lt;set&gt;
      &lt;if test=&quot;username != null&quot;&gt;username=#{username},&lt;/if&gt;
      &lt;if test=&quot;password != null&quot;&gt;password=#{password},&lt;/if&gt;
      &lt;if test=&quot;email != null&quot;&gt;email=#{email},&lt;/if&gt;
      &lt;if test=&quot;bio != null&quot;&gt;bio=#{bio}&lt;/if&gt;
    &lt;/set&gt;
  where id=#{id}
&lt;/update&gt;</pre></div>
        
<p>&#xc5ec;&#xae30;&#xc11c; set &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb294; &#xb3d9;&#xc801;&#xc73c;&#xb85c; SET &#xd0a4;&#xc6cc;&#xb4dc;&#xb97c; &#xbd99;&#xd788;&#xace0; &#xd544;&#xc694;&#xc5c6;&#xb294; &#xcf64;&#xb9c8;&#xb97c; &#xc81c;&#xac70;&#xd55c;&#xb2e4;.</p>
        
<p>&#xc544;&#xb9c8;&#xb3c4; trim &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb85c; &#xcc98;&#xb9ac;&#xd55c;&#xb2e4;&#xba74; &#xc544;&#xb798;&#xc640; &#xac19;&#xc744; &#xac83;&#xc774;&#xb2e4;.</p>
        
<div class="source"><pre class="prettyprint">&lt;trim prefix=&quot;SET&quot; suffixOverrides=&quot;,&quot;&gt;
  ...
&lt;/trim&gt;</pre></div>
        
<p>&#xc774; &#xacbd;&#xc6b0; &#xc811;&#xb450;&#xc0ac;&#xb294; &#xcd94;&#xac00;&#xd558;&#xace0; &#xc811;&#xbbf8;&#xc0ac;&#xb97c; &#xc624;&#xbc84;&#xb77c;&#xc774;&#xb529; &#xd55c;&#xb2e4;.</p>
      </div>
      
<div class="section">
<h3><a name="foreach"></a>foreach</h3>
        
<p>&#xb3d9;&#xc801; SQL &#xc5d0;&#xc11c; &#xacf5;&#xd1b5;&#xc801;&#xc73c;&#xb85c; &#xd544;&#xc694;&#xd55c; &#xac83;&#xc740; collection &#xc5d0; &#xb300;&#xd574; &#xbc18;&#xbcf5;&#xcc98;&#xb9ac;&#xb97c; &#xd558;&#xb294; &#xac83;&#xc774;&#xb2e4;. 
		&#xc885;&#xc885; IN &#xc870;&#xac74;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xac8c; &#xb41c;&#xb2e4;. 
		&#xc608;&#xb97c;&#xb4e4;&#xba74;</p>
        
<div class="source"><pre class="prettyprint">&lt;select id=&quot;selectPostIn&quot; resultType=&quot;domain.blog.Post&quot;&gt;
  SELECT *
  FROM POST P
  WHERE ID in
  &lt;foreach item=&quot;item&quot; index=&quot;index&quot; collection=&quot;list&quot;
      open=&quot;(&quot; separator=&quot;,&quot; close=&quot;)&quot;&gt;
        #{item}
  &lt;/foreach&gt;
&lt;/select&gt;</pre></div>
        
<p>foreach&#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb294; &#xb9e4;&#xc6b0; &#xac15;&#xb825;&#xd558;&#xace0; collection &#xc744; &#xba85;&#xc2dc;&#xd558;&#xb294; &#xac83;&#xc744; &#xd5c8;&#xc6a9;&#xd55c;&#xb2e4;. 
		&#xc5d8;&#xb9ac;&#xba3c;&#xd2b8; &#xb0b4;&#xbd80;&#xc5d0;&#xc11c; &#xc0ac;&#xc6a9;&#xd560; &#xc218; &#xc788;&#xb294; item, index&#xb450;&#xac00;&#xc9c0; &#xbcc0;&#xc218;&#xb97c; &#xc120;&#xc5b8;&#xd55c;&#xb2e4;. 
		&#xc774; &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb294; &#xb610;&#xd55c; &#xc5f4;&#xace0; &#xb2eb;&#xb294; &#xbb38;&#xc790;&#xc5f4;&#xb85c; &#xba85;&#xc2dc;&#xd560; &#xc218; &#xc788;&#xace0; &#xbc18;&#xbcf5;&#xac04;&#xc5d0; &#xb458; &#xc218; &#xc788;&#xb294; &#xad6c;&#xbd84;&#xc790;&#xb3c4; &#xcd94;&#xac00;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p>
        
<p><span class="label important">&#xcc38;&#xace0;</span> &#xceec;&#xb809;&#xc158; &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb85c; Map&#xc774;&#xb098; &#xbc30;&#xc5f4;&#xac1d;&#xccb4;&#xc640; &#xb354;&#xbd88;&#xc5b4; List, Set&#xb4f1;&#xacfc; &#xac19;&#xc740; &#xbc18;&#xbcf5;&#xac00;&#xb2a5;&#xd55c; &#xac1d;&#xccb4;&#xb97c; &#xc804;&#xb2ec;&#xd560; &#xc218; &#xc788;&#xb2e4;. &#xbc18;&#xbcf5;&#xac00;&#xb2a5;&#xd558;&#xac70;&#xb098; &#xbc30;&#xc5f4;&#xc744; &#xc0ac;&#xc6a9;&#xd560;&#xb54c; index&#xac12;&#xc740; &#xd604;&#xc7ac; &#xba87;&#xbc88;&#xc9f8; &#xbc18;&#xbcf5;&#xc778;&#xc9c0;&#xb97c; &#xb098;&#xd0c0;&#xb0b4;&#xace0; value&#xd56d;&#xbaa9;&#xc740; &#xbc18;&#xbcf5;&#xacfc;&#xc815;&#xc5d0;&#xc11c; &#xac00;&#xc838;&#xc624;&#xb294; &#xc694;&#xc18c;&#xb97c; &#xb098;&#xd0c0;&#xb0b8;&#xb2e4;. Map&#xc744; &#xc0ac;&#xc6a9;&#xd560;&#xb54c; index&#xb294; key&#xac1d;&#xccb4;&#xac00; &#xb418;&#xace0; &#xd56d;&#xbaa9;&#xc740; value&#xac1d;&#xccb4;&#xac00; &#xb41c;&#xb2e4;. </p>
        
<p>XML&#xc124;&#xc815; &#xd30c;&#xc77c;&#xacfc; XML &#xb9e4;&#xd551; &#xd30c;&#xc77c;&#xc5d0; &#xb300;&#xd574;&#xc11c;&#xb294; &#xc774; &#xc815;&#xb3c4;&#xc5d0;&#xc11c; &#xc815;&#xb9ac;&#xd558;&#xace0; &#xb2e4;&#xc74c; &#xc139;&#xc158;&#xc5d0;&#xc11c;&#xb294; Java API &#xc5d0; &#xb300;&#xd574; &#xc880;&#xb354; &#xc0c1;&#xc138;&#xd558;&#xac8c; &#xc0b4;&#xd3b4;&#xbcfc; &#xac83;&#xc774;&#xb2e4;.</p>
      </div>
  
<div class="section">
<h3><a name="bind"></a>bind</h3>
  
<p><tt>bind</tt> &#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb294; OGNL&#xd45c;&#xd604;&#xc744; &#xc0ac;&#xc6a9;&#xd574;&#xc11c; &#xbcc0;&#xc218;&#xb97c; &#xb9cc;&#xb4e0; &#xb4a4; &#xcee8;&#xd14d;&#xc2a4;&#xd2b8;&#xc5d0; &#xbc14;&#xc778;&#xb529;&#xd55c;&#xb2e4;. 
  &#xc608;&#xb97c;&#xb4e4;&#xba74; </p>
  
<div class="source"><pre class="prettyprint">
&lt;select id=&quot;selectBlogsLike&quot; resultType=&quot;Blog&quot;&gt;
  &lt;bind name=&quot;pattern&quot; value=&quot;'%' + _parameter.getTitle() + '%'&quot; /&gt;
  SELECT * FROM BLOG
  WHERE title LIKE #{pattern}
&lt;/select&gt;</pre></div>
  </div>
      
<div class="section">
<h3><a name="Multi-db_vendor_support"></a>Multi-db vendor support</h3>
        
<p>&quot;_databaseId&quot; &#xbcc0;&#xc218;&#xb85c; &#xc124;&#xc815;&#xb41c; databaseIdProvider&#xac00; &#xb3d9;&#xc801;&#xc778; &#xcf54;&#xb4dc;&#xc5d0;&#xb3c4; &#xc0ac;&#xc6a9;&#xac00;&#xb2a5;&#xd558;&#xb2e4;&#xba74; &#xb370;&#xc774;&#xd130;&#xbca0;&#xc774;&#xc2a4; &#xc81c;&#xd488;&#xbcc4;&#xb85c; &#xc11c;&#xb85c;&#xb2e4;&#xb978; &#xad6c;&#xbb38;&#xc744; &#xc0ac;&#xc6a9;&#xd560; &#xc218; &#xc788;&#xb2e4;. 
		&#xb2e4;&#xc74c;&#xc758; &#xc608;&#xc81c;&#xb97c; &#xbcf4;&#xb77c;:</p>
        
<div class="source"><pre class="prettyprint">&lt;insert id=&quot;insert&quot;&gt;
  &lt;selectKey keyProperty=&quot;id&quot; resultType=&quot;int&quot; order=&quot;BEFORE&quot;&gt;
    &lt;if test=&quot;_databaseId == 'oracle'&quot;&gt;
      select seq_users.nextval from dual
    &lt;/if&gt;
    &lt;if test=&quot;_databaseId == 'db2'&quot;&gt;
      select nextval for seq_users from sysibm.sysdummy1&quot;
    &lt;/if&gt;
  &lt;/selectKey&gt;
  insert into users values (#{id}, #{name})
&lt;/insert&gt;
</pre></div>
      </div>
  
<div class="section">
<h3><a name="Pluggable_Scripting_Languages_For_Dynamic_SQL"></a>Pluggable Scripting Languages For Dynamic SQL</h3>
    
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; 3.2&#xbd80;&#xd130;&#xb294; &#xd50c;&#xb7ec;&#xadf8;&#xc778; &#xd615;&#xd0dc;&#xb85c; &#xc2a4;&#xd06c;&#xb9bd;&#xd2b8; &#xc5b8;&#xc5b4;&#xb97c; &#xc0ac;&#xc6a9;&#xd560; &#xc218; &#xc788;&#xb2e4;. 
    &#xadf8;&#xb798;&#xc11c; &#xc5b8;&#xc5b4;&#xbcc4; &#xb4dc;&#xb77c;&#xc774;&#xbc84;&#xb97c; &#xc7a5;&#xcc29;&#xd558;&#xace0; &#xb3d9;&#xc801; SQL&#xcffc;&#xb9ac;&#xb97c; &#xc791;&#xc131;&#xd560;&#xb54c; &#xadf8; &#xc5b8;&#xc5b4;&#xb97c; &#xc0ac;&#xc6a9;&#xd560; &#xc218; &#xc788;&#xb2e4;. </p>
    
<p>&#xb450;&#xac1c;&#xc758; &#xb0b4;&#xc7a5;&#xb41c; &#xc5b8;&#xc5b4;&#xac00; &#xc788;&#xb2e4;. </p>
    
<ul>
    
<li>xml</li>
    
<li>raw</li>
    </ul>
    
<p><tt>xml</tt> &#xc5b8;&#xc5b4;&#xb294; &#xc124;&#xc815;&#xd558;&#xc9c0; &#xc54a;&#xc744;&#xb54c; &#xae30;&#xbcf8;&#xc73c;&#xb85c; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xac12;&#xc774;&#xb2e4;. 
    <tt>xml</tt>&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xba74; &#xc774;&#xc804;&#xc5d0; &#xb2e4;&#xb8ec; &#xbaa8;&#xb4e0; &#xb3d9;&#xc801;&#xd0dc;&#xadf8;&#xb97c; &#xc2e4;&#xd589;&#xd560; &#xc218; &#xc788;&#xb2e4;. </p>
    
<p><tt>raw</tt> &#xc5b8;&#xc5b4;&#xb294; &#xc0ac;&#xc2e4; &#xae30;&#xb2a5;&#xc774; &#xc870;&#xae08; &#xbd80;&#xc871;&#xd558;&#xb2e4;. 
    <tt>raw</tt>&#xc124;&#xc815;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xba74; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb97c; &#xce58;&#xd658;&#xd574;&#xc11c; &#xb370;&#xc774;&#xd130;&#xbca0;&#xc774;&#xc2a4; &#xb4dc;&#xb77c;&#xc774;&#xbc84;&#xc5d0; &#xad6c;&#xbb38;&#xc744; &#xc804;&#xb2ec;&#xd55c;&#xb2e4;. 
    &#xc9d0;&#xc791;&#xd558;&#xb294; &#xac83;&#xcc98;&#xb7fc; <tt>raw</tt> &#xc5b8;&#xc5b4;&#xb294; <tt>xml</tt> &#xc5b8;&#xc5b4;&#xbcf4;&#xb2e4; &#xc870;&#xae08;&#xb354; &#xbe60;&#xb974;&#xb2e4;. 
    </p>
    
<p>&#xb2e4;&#xc74c;&#xcc98;&#xb7fc; <tt>lang</tt> &#xc18d;&#xc131;&#xc744; &#xcd94;&#xac00;&#xd574;&#xc11c; &#xad6c;&#xbb38;&#xc5d0;&#xc11c; &#xc0ac;&#xc6a9;&#xd560; &#xc5b8;&#xc5b4;&#xb97c; &#xba85;&#xc2dc;&#xd560; &#xc218; &#xc788;&#xb2e4;. 
    </p>
  
<div class="source"><pre class="prettyprint">&lt;select id=&quot;selectBlog&quot; lang=&quot;raw&quot;&gt;
  SELECT * FROM BLOG
&lt;/select&gt;</pre></div>
    
<p>&#xb610;&#xb294; &#xb9e4;&#xd37c;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xacbd;&#xc6b0;&#xb77c;&#xba74; <tt>@Lang</tt> &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xc744; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;. </p>
  
<div class="source"><pre class="prettyprint">public interface Mapper {
  @Lang(RawLanguageDriver.class)
  @Select(&quot;SELECT * FROM BLOG&quot;)
  List&lt;Blog&gt; selectBlog();
}</pre></div>
    
<p>&#xb2e4;&#xc74c;&#xc758; &#xc778;&#xd130;&#xd398;&#xc774;&#xc2a4;&#xb97c; &#xad6c;&#xd604;&#xd574;&#xc11c; &#xc790;&#xc2e0;&#xb9cc;&#xc758; &#xc5b8;&#xc5b4; &#xb4dc;&#xb77c;&#xc774;&#xbc84;&#xb97c; &#xad6c;&#xd604;&#xd560; &#xc218;&#xb3c4; &#xc788;&#xb2e4;. </p>
  
<div class="source"><pre class="prettyprint">public interface LanguageDriver {
  ParameterHandler createParameterHandler(MappedStatement mappedStatement, Object parameterObject, BoundSql boundSql);
  SqlSource createSqlSource(Configuration configuration, XNode script, Class&lt;?&gt; parameterType);
  SqlSource createSqlSource(Configuration configuration, String script, Class&lt;?&gt; parameterType);
}</pre></div>    
	</div>
    </div>
  

        </div>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>Copyright &copy;2009&#x2013;2017
<a href="http://www.mybatis.org/">MyBatis.org</a>.
All rights reserved.</p>
        </div>
        </div>
    </footer>
    </body>
</html>
