<!DOCTYPE html>


<!--
 | Generated by Apache Maven Doxia Site Renderer 2.0.0-M18 from src/site/ko/markdown/getting-started.md at 28 6월 2024
 | Rendered using Apache Maven Fluido Skin 2.0.0-M9
-->
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="generator" content="Apache Maven Doxia Site Renderer 2.0.0-M18" />
    <meta name="author" content="Clinton Begin, 이동국(한국어 번역)" />
    <title>mybatis</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-2.0.0-M9.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
    <script src="./js/apache-maven-fluido-2.0.0-M9.min.js"></script>
  </head>
  <body>
    <div class="container-fluid container-fluid-top">
      <header>
        <div id="banner">
          <div class="pull-left"></div>
          <div class="pull-right"><div id="bannerRight"><h1><a href="https://blog.mybatis.org/" class="externalLink"><img class="imageLink" src="../../images/mybatis-logo.png" alt="MyBatis logo" /> MyBatis</a></h1></div></div>
          <div class="clear"><hr/></div>
        </div>

        <div id="breadcrumbs">
          <ul class="breadcrumb">
        <li id="publishDate">Last Published: 02 4월 2024<span class="divider">|</span>
</li>
          <li id="projectVersion">Version: 3.5.17-SNAPSHOT</li>
          </ul>
        </div>
      </header>
      <div class="row-fluid">
        <header id="leftColumn" class="span2">
          <nav class="well sidebar-nav">
  <ul class="nav nav-list">
   <li class="nav-header">Core</li>
    <li><a href="index.html">소개</a></li>
    <li class="active"><a>시작하기</a></li>
    <li><a href="configuration.html"><span class="icon-chevron-right"></span>매퍼 설정</a></li>
    <li><a href="sqlmap-xml.html"><span class="icon-chevron-right"></span>Mapper XML 파일</a></li>
    <li><a href="dynamic-sql.html">동적 SQL</a></li>
    <li><a href="java-api.html"><span class="icon-chevron-right"></span>자바 API</a></li>
    <li><a href="statement-builders.html">SQL Builder 클래스</a></li>
    <li><a href="logging.html">로깅</a></li>
   <li class="nav-header">프로젝트 문서화</li>
    <li><a href="project-info.html"><span class="icon-chevron-right"></span>프로젝트 정보</a></li>
    <li><a href="project-reports.html"><span class="icon-chevron-right"></span>프로젝트 보고서</a></li>
  </ul>
          </nav>
          <div class="well sidebar-nav">
            <div id="poweredBy">
              <div class="clear"></div>
              <div class="clear"></div>
<a href="https://maven.apache.org/" class="builtBy" target="_blank"><img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" /></a>
            </div>
          </div>
        </header>
        <main id="bodyColumn" class="span10">
<section><a id="a.EC.8B.9C.EC.9E.91.ED.95.98.EA.B8.B0"></a>
<h1>&#xc2dc;&#xc791;&#xd558;&#xae30;</h1><section><a id="a.EC.84.A4.EC.B9.98"></a>
<h2>&#xc124;&#xce58;</h2>
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xae30; &#xc704;&#xd574; <a href="https://github.com/mybatis/mybatis-3/releases" class="externalLink">mybatis-x.x.x.jar</a> &#xd30c;&#xc77c;&#xc744; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4;&#xc5d0; &#xb450;&#xc5b4;&#xc57c; &#xd55c;&#xb2e4;.</p>
<p>&#xba54;&#xc774;&#xbe10;&#xc744; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;&#xba74; pom.xml&#xc5d0; &#xb2e4;&#xc74c;&#xc758; &#xc124;&#xc815;&#xc744; &#xcd94;&#xac00;&#xd558;&#xc790;.</p>

<pre><code class="language-xml">&lt;dependency&gt;
  &lt;groupId&gt;org.mybatis&lt;/groupId&gt;
  &lt;artifactId&gt;mybatis&lt;/artifactId&gt;
  &lt;version&gt;x.x.x&lt;/version&gt;
&lt;/dependency&gt;
</code></pre></section><section><a id="XML.EC.97.90.EC.84.9C_SqlSessionFactory_.EB.B9.8C.EB.93.9C.ED.95.98.EA.B8.B0"></a>
<h2>XML&#xc5d0;&#xc11c; SqlSessionFactory &#xbe4c;&#xb4dc;&#xd558;&#xae30;</h2>
<p>&#xbaa8;&#xb4e0; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc740; SqlSessionFactory &#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb97c; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;. SqlSessionFactory&#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb294; SqlSessionFactoryBuilder&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xc5ec; &#xb9cc;&#xb4e4;&#xc218; &#xc788;&#xb2e4;. SqlSessionFactoryBuilder&#xb294; XML&#xc124;&#xc815;&#xd30c;&#xc77c;&#xc5d0;&#xc11c; SqlSessionFactory&#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb97c; &#xbe4c;&#xb4dc;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p>
<p>XML&#xd30c;&#xc77c;&#xc5d0;&#xc11c; SqlSessionFactory&#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb97c; &#xbe4c;&#xb4dc;&#xd558;&#xb294; &#xac83;&#xc740; &#xb9e4;&#xc6b0; &#xac04;&#xb2e8;&#xd55c;&#xb2e4;. &#xc124;&#xc815;&#xc744; &#xc704;&#xd574; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4; &#xc790;&#xc6d0;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xac83;&#xc744; &#xcd94;&#xcc9c;&#xd558;&#xb098; &#xd30c;&#xc77c; &#xacbd;&#xb85c;&#xb098; <code>file://</code> URL&#xb85c;&#xbd80;&#xd130; &#xb9cc;&#xb4e4;&#xc5b4;&#xc9c4; InputStream&#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb97c; &#xc0ac;&#xc6a9;&#xd560; &#xc218;&#xb3c4; &#xc788;&#xb2e4;. &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4;&#xc640; &#xb2e4;&#xb978; &#xc704;&#xce58;&#xc5d0;&#xc11c; &#xc790;&#xc6d0;&#xc744; &#xb85c;&#xb4dc;&#xd558;&#xb294; &#xac83;&#xc73c;&#xb85c; &#xc880;&#xb354; &#xc27d;&#xac8c; &#xd574;&#xc8fc;&#xb294; Resources &#xb77c;&#xb294; &#xc720;&#xd2f8;&#xc131; &#xd074;&#xb798;&#xc2a4;&#xb97c; &#xac00;&#xc9c0;&#xace0; &#xc788;&#xb2e4;.</p>

<pre><code class="language-java">String resource = &quot;org/mybatis/example/mybatis-config.xml&quot;;
InputStream inputStream = Resources.getResourceAsStream(resource);
SqlSessionFactory sqlSessionFactory = new SqlSessionFactoryBuilder().build(inputStream);
</code></pre>
<p>XML&#xc124;&#xc815;&#xd30c;&#xc77c;&#xc5d0;&#xc11c; &#xc9c0;&#xc815;&#xd558;&#xb294; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc758; &#xd575;&#xc2ec;&#xc774; &#xb418;&#xb294; &#xc124;&#xc815;&#xc740; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xc81c;&#xc5b4;&#xd558;&#xae30; &#xc704;&#xd55c; TransactionManager&#xacfc; &#xd568;&#xaed8; &#xb370;&#xc774;&#xd130;&#xbca0;&#xc774;&#xc2a4; Connection&#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb97c; &#xac00;&#xc838;&#xc624;&#xae30; &#xc704;&#xd55c; DataSource &#xb97c; &#xd3ec;&#xd568;&#xd55c;&#xb2e4;. &#xc138;&#xbd80;&#xc801;&#xc778; &#xc124;&#xc815;&#xc740; &#xc870;&#xae08; &#xb4a4;&#xc5d0; &#xbcf4;&#xace0; &#xac04;&#xb2e8;&#xd55c; &#xc608;&#xc81c;&#xb97c; &#xba3c;&#xc800;&#xbcf4;&#xc790;.</p>

<pre><code class="language-xml">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;
&lt;!DOCTYPE configuration
  PUBLIC &quot;-//mybatis.org//DTD Config 3.0//EN&quot;
  &quot;https://mybatis.org/dtd/mybatis-3-config.dtd&quot;&gt;
&lt;configuration&gt;
  &lt;environments default=&quot;development&quot;&gt;
    &lt;environment id=&quot;development&quot;&gt;
      &lt;transactionManager type=&quot;JDBC&quot;/&gt;
      &lt;dataSource type=&quot;POOLED&quot;&gt;
        &lt;property name=&quot;driver&quot; value=&quot;${driver}&quot;/&gt;
        &lt;property name=&quot;url&quot; value=&quot;${url}&quot;/&gt;
        &lt;property name=&quot;username&quot; value=&quot;${username}&quot;/&gt;
        &lt;property name=&quot;password&quot; value=&quot;${password}&quot;/&gt;
      &lt;/dataSource&gt;
    &lt;/environment&gt;
  &lt;/environments&gt;
  &lt;mappers&gt;
    &lt;mapper resource=&quot;org/mybatis/example/BlogMapper.xml&quot;/&gt;
  &lt;/mappers&gt;
&lt;/configuration&gt;
</code></pre>
<p>&#xc880; &#xb354; &#xb9ce;&#xc740; XML &#xc124;&#xc815;&#xbc29;&#xbc95;&#xc774; &#xc788;&#xc9c0;&#xb9cc; &#xc704; &#xc608;&#xc81c;&#xc5d0;&#xc11c;&#xb294; &#xac00;&#xc7a5; &#xd575;&#xc2ec;&#xc801;&#xc778; &#xbd80;&#xbd84;&#xb9cc;&#xc744; &#xbcf4;&#xc5ec;&#xc8fc;&#xace0; &#xc788;&#xb2e4;. XML &#xac00;&#xc7a5; &#xc704;&#xbd80;&#xbd84;&#xc5d0;&#xc11c;&#xb294; XML &#xbb38;&#xc11c;&#xc758; &#xc720;&#xd6a8;&#xc131;&#xccb4;&#xd06c;&#xb97c; &#xc704;&#xd574; &#xd544;&#xc694;&#xd558;&#xb2e4;. environment&#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb294; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xad00;&#xb9ac;&#xc640; &#xcee4;&#xb125;&#xc158; &#xd480;&#xb9c1;&#xc744; &#xc704;&#xd55c; &#xd658;&#xacbd;&#xc801;&#xc778; &#xc124;&#xc815;&#xc744; &#xb098;&#xd0c0;&#xb0b8;&#xb2e4;. mappers&#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb294; SQL &#xcf54;&#xb4dc;&#xc640; &#xb9e4;&#xd551; &#xc815;&#xc758;&#xb97c; &#xac00;&#xc9c0;&#xb294; XML &#xd30c;&#xc77c;&#xc778; mapper &#xc758; &#xbaa9;&#xb85d;&#xc744; &#xc9c0;&#xc815;&#xd55c;&#xb2e4;.</p></section><section><a id="XML_.EC.9D.84_.EC.82.AC.EC.9A.A9.ED.95.98.EC.A7.80_.EC.95.8A.EA.B3.A0_SqlSessionFactory_.EB.B9.8C.EB.93.9C.ED.95.98.EA.B8.B0"></a>
<h2>XML &#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xc9c0; &#xc54a;&#xace0; SqlSessionFactory &#xbe4c;&#xb4dc;&#xd558;&#xae30;</h2>
<p>XML &#xbcf4;&#xb2e4; &#xc790;&#xbc14;&#xb97c; &#xc0ac;&#xc6a9;&#xd574;&#xc11c; &#xc9c1;&#xc811; &#xc124;&#xc815;&#xd558;&#xae38; &#xc6d0;&#xd55c;&#xb2e4;&#xba74; XML &#xd30c;&#xc77c;&#xacfc; &#xac19;&#xc740; &#xbaa8;&#xb4e0; &#xc124;&#xc815;&#xc744; &#xc81c;&#xacf5;&#xd558;&#xb294; Configuration &#xd074;&#xb798;&#xc2a4;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xba74; &#xb41c;&#xb2e4;.</p>

<pre><code class="language-java">DataSource dataSource = BlogDataSourceFactory.getBlogDataSource();
TransactionFactory transactionFactory = new JdbcTransactionFactory();
Environment environment = new Environment(&quot;development&quot;, transactionFactory, dataSource);
Configuration configuration = new Configuration(environment);
configuration.addMapper(BlogMapper.class);
SqlSessionFactory sqlSessionFactory = new SqlSessionFactoryBuilder().build(configuration);
</code></pre>
<p>&#xc774; &#xc124;&#xc815;&#xc5d0;&#xc11c; &#xcd94;&#xac00;&#xb85c; &#xd574;&#xc57c; &#xd560; &#xc77c;&#xc740; Mapper&#xd074;&#xb798;&#xc2a4;&#xb97c; &#xcd94;&#xac00;&#xd558;&#xb294; &#xac83;&#xc774;&#xb2e4;. Mapper&#xd074;&#xb798;&#xc2a4;&#xb294; SQL &#xb9e4;&#xd551; &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xc744; &#xac00;&#xc9c4; &#xc790;&#xbc14; &#xd074;&#xb798;&#xc2a4;&#xc774;&#xb2e4;. &#xc5b4;&#xca0c;&#xb4e0; &#xc790;&#xbc14; &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xc758; &#xba87;&#xac00;&#xc9c0; &#xc81c;&#xc57d;&#xacfc; &#xba87;&#xac00;&#xc9c0; &#xc124;&#xc815;&#xbc29;&#xbc95;&#xc758; &#xbcf5;&#xc7a1;&#xd568;&#xc5d0;&#xb3c4; &#xbd88;&#xad6c;&#xd558;&#xace0; XML &#xb9e4;&#xd551;&#xc740; &#xc138;&#xbd80;&#xc801;&#xc778; &#xb9e4;&#xd551;&#xc744; &#xc704;&#xd574; &#xc5b8;&#xc81c;&#xb4e0; &#xd544;&#xc694;&#xd558;&#xb2e4;. &#xc880;&#xb354; &#xc138;&#xbd80;&#xc801;&#xc778; &#xb0b4;&#xc6a9;&#xc740; &#xc870;&#xae08; &#xb4a4; &#xb2e4;&#xc2dc; &#xbcf4;&#xb3c4;&#xb85d; &#xd558;&#xc790;.</p></section><section><a id="SqlSessionFactory_.EC.97.90.EC.84.9C_SqlSession_.EB.A7.8C.EB.93.A4.EA.B8.B0"></a>
<h2>SqlSessionFactory &#xc5d0;&#xc11c; SqlSession &#xb9cc;&#xb4e4;&#xae30;</h2>
<p>SqlSessionFactory &#xc774;&#xb984;&#xc5d0;&#xc11c; &#xbcf4;&#xb4ef;&#xc774; SqlSession &#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb97c; &#xb9cc;&#xb4e4;&#xc218; &#xc788;&#xb2e4;. SqlSession &#xc740; &#xb370;&#xc774;&#xd130;&#xbca0;&#xc774;&#xc2a4;&#xc5d0; &#xb300;&#xd574; SQL&#xba85;&#xb839;&#xc5b4;&#xb97c; &#xc2e4;&#xd589;&#xd558;&#xae30; &#xc704;&#xd574; &#xd544;&#xc694;&#xd55c; &#xbaa8;&#xb4e0; &#xba54;&#xc18c;&#xb4dc;&#xb97c; &#xac00;&#xc9c0;&#xace0; &#xc788;&#xb2e4;. &#xadf8;&#xb798;&#xc11c; SqlSession &#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb97c; &#xd1b5;&#xd574; &#xc9c1;&#xc811; SQL &#xad6c;&#xbb38;&#xc744; &#xc2e4;&#xd589;&#xd560; &#xc218; &#xc788;&#xb2e4;. &#xc608;&#xb97c; &#xb4e4;&#xba74; :</p>

<pre><code class="language-java">try (SqlSession session = sqlSessionFactory.openSession()) {
  Blog blog = session.selectOne(&quot;org.mybatis.example.BlogMapper.selectBlog&quot;, 101);
}
</code></pre>
<p>&#xc774; &#xbc29;&#xbc95;&#xc774; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc758; &#xc774;&#xc804;&#xbc84;&#xc804;&#xc744; &#xc0ac;&#xc6a9;&#xd55c; &#xc0ac;&#xb78c;&#xc774;&#xb77c;&#xba74; &#xad49;&#xc7a5;&#xd788; &#xce5c;&#xc219;&#xd560; &#xac83;&#xc774;&#xb2e4;. &#xd558;&#xc9c0;&#xb9cc; &#xc880;&#xb354; &#xc88b;&#xc740; &#xbc29;&#xbc95;&#xc774; &#xc0dd;&#xacbc;&#xb2e4;. &#xc8fc;&#xc5b4;&#xc9c4; SQL &#xad6c;&#xbb38;&#xc758; &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xc640; &#xb9ac;&#xd134;&#xac12;&#xc744; &#xc124;&#xba85;&#xd558;&#xb294; &#xc778;&#xd130;&#xd398;&#xc774;&#xc2a4;(&#xc608;&#xb97c; &#xb4e4;&#xba74;, BlogMapper.class )&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xc5ec; &#xbb38;&#xc790;&#xc5f4; &#xcc98;&#xb9ac; &#xc624;&#xb958;&#xb098; &#xd0c0;&#xc785; &#xce90;&#xc2a4;&#xd305; &#xc624;&#xb958; &#xc5c6;&#xc774; &#xc880;&#xb354; &#xd0c0;&#xc785;&#xc5d0; &#xc548;&#xc804;&#xd558;&#xace0; &#xae54;&#xb054;&#xd558;&#xac8c; &#xc2e4;&#xd589;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p>
<p>&#xc608;&#xb97c;&#xb4e4;&#xba74;:</p>

<pre><code class="language-java">try (SqlSession session = sqlSessionFactory.openSession()) {
  BlogMapper mapper = session.getMapper(BlogMapper.class);
  Blog blog = mapper.selectBlog(101);
}
</code></pre>
<p>&#xadf8;&#xb7fc; &#xc790;&#xc138;&#xd788; &#xc0b4;&#xd3b4;&#xbcf4;&#xc790;.</p></section><section><a id="a.EB.A7.A4.ED.95.91.EB.90.9C_SQL_.EA.B5.AC.EB.AC.B8_.EC.82.B4.ED.8E.B4.EB.B3.B4.EA.B8.B0"></a>
<h2>&#xb9e4;&#xd551;&#xb41c; SQL &#xad6c;&#xbb38; &#xc0b4;&#xd3b4;&#xbcf4;&#xae30;</h2>
<p>&#xc774; &#xc2dc;&#xc810;&#xc5d0; SqlSession&#xc774;&#xb098; Mapper&#xd074;&#xb798;&#xc2a4;&#xac00; &#xc815;&#xd655;&#xd788; &#xc5b4;&#xb5bb;&#xac8c; &#xc2e4;&#xd589;&#xb418;&#xb294;&#xc9c0; &#xad81;&#xae08;&#xd560; &#xac83;&#xc774;&#xb2e4;. &#xb9e4;&#xd551;&#xb41c; SQL &#xad6c;&#xbb38;&#xc5d0; &#xb300;&#xd55c; &#xb0b4;&#xc6a9;&#xc774; &#xac00;&#xc7a5; &#xc911;&#xc694;&#xd558;&#xb2e4;. &#xadf8;&#xb798;&#xc11c; &#xc774; &#xbb38;&#xc11c; &#xc804;&#xbc18;&#xc5d0;&#xc11c; &#xac00;&#xc7a5; &#xc790;&#xc8fc; &#xb2e4;&#xb8e8;&#xc5b4;&#xc9c4;&#xb2e4;. &#xd558;&#xc9c0;&#xb9cc; &#xb2e4;&#xc74c;&#xc758; &#xb450;&#xac00;&#xc9c0; &#xc608;&#xc81c;&#xb97c; &#xd1b5;&#xd574; &#xc815;&#xd655;&#xd788; &#xc5b4;&#xb5bb;&#xac8c; &#xc791;&#xb3d9;&#xd558;&#xb294;&#xc9c0;&#xc5d0; &#xb300;&#xd574;&#xc11c;&#xb294; &#xcda9;&#xbd84;&#xd788; &#xc774;&#xd574;&#xd558;&#xac8c; &#xb420; &#xac83;&#xc774;&#xb2e4;.</p>
<p>&#xc704; &#xc608;&#xc81c;&#xcc98;&#xb7fc; &#xad6c;&#xbb38;&#xc740; XML&#xc774;&#xb098; &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xc744; &#xc0ac;&#xc6a9;&#xd574;&#xc11c; &#xc815;&#xc758;&#xd560; &#xc218; &#xc788;&#xb2e4;. &#xadf8;&#xb7fc; &#xba3c;&#xc800; XML &#xc744; &#xbcf4;&#xc790;. &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xac00; &#xc81c;&#xacf5;&#xd558;&#xb294; &#xb300;&#xbd80;&#xbd84;&#xc758; &#xae30;&#xb2a5;&#xc740; XML&#xc744; &#xd1b5;&#xd574; &#xb9e4;&#xd551; &#xae30;&#xbc95;&#xc744; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;. &#xc774;&#xc804;&#xc5d0; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb97c; &#xc0ac;&#xc6a9;&#xd588;&#xc5c8;&#xb2e4;&#xba74; &#xc27d;&#xac8c; &#xc774;&#xd574;&#xb418;&#xaca0;&#xc9c0;&#xb9cc; XML &#xb9e4;&#xd551; &#xbb38;&#xc11c;&#xc5d0; &#xc774;&#xc804;&#xbcf4;&#xb2e4; &#xb9ce;&#xc740; &#xae30;&#xb2a5;&#xc774; &#xcd94;&#xac00;&#xb418;&#xc5c8;&#xb2e4;. SqlSession&#xc744; &#xd638;&#xcd9c;&#xd558;&#xb294; XML &#xae30;&#xbc18;&#xc758; &#xb9e4;&#xd551; &#xad6c;&#xbb38;&#xc774;&#xb2e4;.</p>

<pre><code class="language-xml">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;
&lt;!DOCTYPE mapper
  PUBLIC &quot;-//mybatis.org//DTD Mapper 3.0//EN&quot;
  &quot;https://mybatis.org/dtd/mybatis-3-mapper.dtd&quot;&gt;
&lt;mapper namespace=&quot;org.mybatis.example.BlogMapper&quot;&gt;
  &lt;select id=&quot;selectBlog&quot; resultType=&quot;Blog&quot;&gt;
    select * from Blog where id = #{id}
  &lt;/select&gt;
&lt;/mapper&gt;
</code></pre>
<p>&#xac04;&#xb2e8;&#xd55c; &#xc608;&#xc81c;&#xce58;&#xace0;&#xb294; &#xc870;&#xae08; &#xbcf5;&#xc7a1;&#xd574; &#xbcf4;&#xc774;&#xc9c0;&#xb9cc; &#xc2e4;&#xc81c;&#xb85c;&#xb294; &#xad49;&#xc7a5;&#xd788; &#xac04;&#xb2e8;&#xd558;&#xb2e4;. &#xd55c; &#xac1c;&#xc758; &#xb9e4;&#xd37c; XML &#xd30c;&#xc77c;&#xc5d0;&#xb294; &#xb9ce;&#xc740; &#xc218;&#xc758; &#xb9e4;&#xd551; &#xad6c;&#xbb38;&#xc744; &#xc815;&#xc758;&#xd560; &#xc218; &#xc788;&#xb2e4;. XML &#xb3c4;&#xc785;&#xbd80;&#xc758; &#xd5e4;&#xb354;&#xc640; doctype &#xc744; &#xc81c;&#xc678;&#xd558;&#xba74; &#xb098;&#xba38;&#xc9c0;&#xb294; &#xc27d;&#xac8c; &#xc774;&#xd574;&#xb418;&#xb294; &#xad6c;&#xbb38;&#xc758; &#xd615;&#xd0dc;&#xc774;&#xb2e4;. &#xc5ec;&#xae30;&#xc120; org.mybatis.example.BlogMapper &#xb124;&#xc784;&#xc2a4;&#xd398;&#xc774;&#xc2a4;&#xc5d0;&#xc11c; selectBlog&#xb77c;&#xb294; &#xb9e4;&#xd551; &#xad6c;&#xbb38;&#xc744; &#xc815;&#xc758;&#xd588;&#xace0; &#xc774;&#xb294; &#xacb0;&#xacfc;&#xc801;&#xc73c;&#xb85c; org.mybatis.example.BlogMapper.selectBlog&#xd615;&#xd0dc;&#xb85c; &#xc2e4;&#xc81c; &#xba85;&#xc2dc;&#xb418;&#xac8c; &#xb41c;&#xb2e4;. &#xadf8;&#xb798;&#xc11c; &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; &#xc0ac;&#xc6a9;&#xd558;&#xac8c; &#xb418;&#xb294; &#xc148;&#xc774;&#xb2e4;.</p>

<pre><code class="language-java">Blog blog = (Blog) session.selectOne(&quot;org.mybatis.example.BlogMapper.selectBlog&quot;, 101);
</code></pre>
<p>&#xc774;&#xac74; &#xb9c8;&#xce58; &#xd328;&#xd0a4;&#xc9c0;&#xb97c; &#xd3ec;&#xd568;&#xd55c; &#xc804;&#xccb4; &#xacbd;&#xb85c;&#xc758; &#xd074;&#xb798;&#xc2a4;&#xb0b4; &#xba54;&#xc18c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd558;&#xb294; &#xac83;&#xacfc; &#xbe44;&#xc2b7;&#xd55c; &#xd615;&#xd0dc;&#xc774;&#xb2e4;. &#xc774; &#xc774;&#xb984;&#xc740; &#xb9e4;&#xd551;&#xb41c; select&#xad6c;&#xbb38;&#xc758; &#xc774;&#xb984;&#xacfc; &#xd30c;&#xb77c;&#xbbf8;&#xd130; &#xadf8;&#xb9ac;&#xace0; &#xb9ac;&#xd134;&#xd0c0;&#xc785;&#xc744; &#xac00;&#xc9c4; &#xb124;&#xc784;&#xc2a4;&#xd398;&#xc774;&#xc2a4;&#xacfc; &#xac19;&#xc740; &#xc774;&#xb984;&#xc758; Mapper &#xd074;&#xb798;&#xc2a4;&#xc640; &#xc9c1;&#xc811; &#xb9e4;&#xd551;&#xb420; &#xc218; &#xc788;&#xb2e4;. &#xc774;&#xac74; &#xc704;&#xc5d0;&#xc11c; &#xbcf8;&#xac83;&#xacfc; &#xac19;&#xc740; Mapper &#xc778;&#xd130;&#xd398;&#xc774;&#xc2a4;&#xc758; &#xba54;&#xc18c;&#xb4dc;&#xb97c; &#xac04;&#xb2e8;&#xd788; &#xd638;&#xcd9c;&#xd558;&#xb3c4;&#xb85d; &#xd5c8;&#xc6a9;&#xd55c;&#xb2e4;. &#xc704; &#xc608;&#xc81c;&#xc5d0; &#xb300;&#xc751;&#xb418;&#xb294; &#xd615;&#xd0dc;&#xb294; &#xc544;&#xb798;&#xc640; &#xac19;&#xb2e4;.</p>

<pre><code class="language-java">BlogMapper mapper = session.getMapper(BlogMapper.class);
Blog blog = mapper.selectBlog(101);
</code></pre>
<p>&#xb450;&#xbc88;&#xc9f8; &#xbc29;&#xbc95;&#xc740; &#xb9ce;&#xc740; &#xc7a5;&#xc810;&#xc744; &#xac00;&#xc9c4;&#xb2e4;. &#xba3c;&#xc800; &#xbb38;&#xc790;&#xc5f4;&#xc5d0; &#xc758;&#xc874;&#xd558;&#xc9c0; &#xc54a;&#xb294;&#xb2e4;&#xb294; &#xac83;&#xc774;&#xb2e4;. &#xc774;&#xb294; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc744; &#xc880;&#xb354; &#xc548;&#xc804;&#xd558;&#xac8c; &#xb9cc;&#xb4e0;&#xb2e4;. &#xb450;&#xbc88;&#xc9f8;&#xb294; &#xac1c;&#xbc1c;&#xc790;&#xac00; IDE &#xb97c; &#xc0ac;&#xc6a9;&#xd560; &#xb54c; &#xb9e4;&#xd551;&#xb41c; SQL &#xad6c;&#xbb38;&#xc744; &#xc0ac;&#xc6a9;&#xd560;&#xb54c;&#xc758; &#xc218;&#xace0;&#xb97c; &#xb35c;&#xc5b4;&#xc900;&#xb2e4;. &#xc138;&#xbc88;&#xc9f8;&#xb294; &#xb9ac;&#xd134;&#xd0c0;&#xc785;&#xc5d0; &#xb300;&#xd574; &#xd0c0;&#xc785; &#xce90;&#xc2a4;&#xd305;&#xc744; &#xd558;&#xc9c0; &#xc54a;&#xc544;&#xb3c4; &#xb41c;&#xb2e4;. &#xadf8;&#xb798;&#xc11c; BlogMapper &#xc778;&#xd130;&#xd398;&#xc774;&#xc2a4;&#xb294; &#xae54;&#xb054;&#xd558;&#xace0; &#xb9ac;&#xd134; &#xd0c0;&#xc785;&#xc5d0; &#xb300;&#xd574; &#xd0c0;&#xc785;&#xc5d0; &#xc548;&#xc804;&#xd558;&#xba70; &#xc774;&#xb294; &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xc5d0;&#xb3c4; &#xadf8;&#xb300;&#xb85c; &#xc801;&#xc6a9;&#xb41c;&#xb2e4;.</p><hr />
<p><span class="label important">&#xcc38;&#xace0;</span> <strong>&#xb124;&#xc784;&#xc2a4;&#xd398;&#xc774;&#xc2a4;(Namespaces)&#xc5d0; &#xb300;&#xd55c; &#xc124;&#xba85;</strong></p>
<p><strong>&#xb124;&#xc784;&#xc2a4;&#xd398;&#xc774;&#xc2a4;(Namespaces)</strong> &#xac00; &#xc774;&#xc804;&#xbc84;&#xc804;&#xc5d0;&#xc11c;&#xb294; &#xc0ac;&#xc2e4; &#xc120;&#xd0dd;&#xc0ac;&#xd56d;&#xc774;&#xc5c8;&#xb2e4;. &#xd558;&#xc9c0;&#xb9cc; &#xc774;&#xc81c;&#xb294; &#xd328;&#xd0a4;&#xc9c0;&#xacbd;&#xb85c;&#xb97c; &#xd3ec;&#xd568;&#xd55c; &#xc804;&#xccb4; &#xc774;&#xb984;&#xc744; &#xac00;&#xc9c4; &#xad6c;&#xbb38;&#xc744; &#xad6c;&#xbd84;&#xd558;&#xae30; &#xc704;&#xd574; &#xd544;&#xc218;&#xb85c; &#xc0ac;&#xc6a9;&#xd574;&#xc57c; &#xd55c;&#xb2e4;.</p>
<p>&#xb124;&#xc784;&#xc2a4;&#xd398;&#xc774;&#xc2a4;&#xc740; &#xc778;&#xd130;&#xd398;&#xc774;&#xc2a4; &#xbc14;&#xc778;&#xb529;&#xc744; &#xac00;&#xb2a5;&#xd558;&#xac8c; &#xd55c;&#xb2e4;. &#xb124;&#xc784;&#xc2a4;&#xd398;&#xc774;&#xc2a4;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xace0; &#xc790;&#xbc14; &#xd328;&#xd0a4;&#xc9c0;&#xc758; &#xb124;&#xc784;&#xc2a4;&#xd398;&#xc774;&#xc2a4;&#xc744; &#xb450;&#xba74; &#xcf54;&#xb4dc;&#xac00; &#xae54;&#xb054;&#xd574;&#xc9c0;&#xace0; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc758; &#xc0ac;&#xc6a9;&#xc131;&#xc774; &#xd06c;&#xac8c; &#xd5a5;&#xc0c1;&#xb420; &#xac83;&#xc774;&#xb2e4;.</p>
<p><strong>&#xc774;&#xb984; &#xbd84;&#xc11d;(Name Resolution):</strong> &#xd0c0;&#xc774;&#xd551;&#xc744; &#xc904;&#xc774;&#xae30; &#xc704;&#xd574; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xad6c;&#xbb38;&#xacfc; &#xacb0;&#xacfc;&#xb9e4;&#xd551;, &#xce90;&#xc2dc;&#xb4f1;&#xc758; &#xbaa8;&#xb4e0; &#xc124;&#xc815;&#xc5d8;&#xb9ac;&#xba3c;&#xd2b8;&#xb97c; &#xc704;&#xd55c; &#xc774;&#xb984; &#xbd84;&#xc11d; &#xaddc;&#xce59;&#xc744; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;.</p>
<ul>

<li>&#x201c;com.mypackage.MyMapper.selectAllThings&#x201d;&#xacfc; &#xac19;&#xc740; &#xd328;&#xd0a4;&#xc9c0;&#xb97c; &#xd3ec;&#xd568;&#xd55c; &#xc804;&#xccb4; &#xacbd;&#xb85c;&#xba85;(Fully qualified names)&#xc740; &#xac19;&#xc740; &#xd615;&#xd0dc;&#xc758; &#xacbd;&#xb85c;&#xac00; &#xc788;&#xb2e4;&#xba74; &#xadf8; &#xacbd;&#xb85c;&#xb0b4;&#xc5d0;&#xc11c; &#xc9c1;&#xc811; &#xcc3e;&#xb294;&#xb2e4;.</li>
<li>&#x201c;selectAllThings&#x201d;&#xacfc; &#xac19;&#xc740; &#xc9e7;&#xc740; &#xd615;&#xd0dc;&#xc758; &#xc774;&#xb984;&#xc740; &#xbaa8;&#xd638;&#xd558;&#xc9c0; &#xc54a;&#xc740; &#xc5d4;&#xd2b8;&#xb9ac;&#xb97c; &#xcc38;&#xace0;&#xd558;&#xae30; &#xc704;&#xd574; &#xc0ac;&#xc6a9;&#xb420; &#xc218; &#xc788;&#xb2e4;. &#xadf8;&#xb798;&#xc11c; &#xc9e7;&#xc740; &#xc774;&#xb984;&#xc740; &#xbaa8;&#xd638;&#xd574;&#xc11c; &#xc5d0;&#xb7ec;&#xb97c; &#xc790;&#xc8fc; &#xbcf4;&#xac8c; &#xb418;&#xb2c8; &#xb418;&#xb3c4;&#xb85d; &#xc774;&#xba74; &#xc804;&#xccb4; &#xacbd;&#xb85c;&#xb97c; &#xc0ac;&#xc6a9;&#xd574;&#xc57c; &#xd560; &#xac83;&#xc774;&#xb2e4;.</li>
</ul><hr />
<p>BlogMapper&#xc640; &#xac19;&#xc740; Mapper&#xd074;&#xb798;&#xc2a4;&#xc5d0;&#xb294; &#xba87;&#xac00;&#xc9c0; &#xd2b8;&#xb9ad;&#xc774; &#xc788;&#xb2e4;. &#xb9e4;&#xd551;&#xb41c; &#xad6c;&#xbb38;&#xc740; XML &#xc5d0; &#xc804;&#xd600; &#xb9e4;&#xd551;&#xb420; &#xd544;&#xc694;&#xac00; &#xc5c6;&#xb2e4;. &#xb300;&#xc2e0; &#xc790;&#xbc14; &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xc744; &#xc0ac;&#xc6a9;&#xd560; &#xc218; &#xc788;&#xb2e4;. &#xc608;&#xb97c;&#xb4e4;&#xc5b4; &#xc704; XML &#xc608;&#xc81c;&#xb294; &#xb2e4;&#xc74c;&#xacfc; &#xac19;&#xc740; &#xd615;&#xd0dc;&#xb85c; &#xb300;&#xccb4;&#xb420; &#xc218; &#xc788;&#xb2e4;.</p>

<pre><code class="language-java">package org.mybatis.example;
public interface BlogMapper {
  @Select(&quot;SELECT * FROM blog WHERE id = #{id}&quot;)
  Blog selectBlog(int id);
}
</code></pre>
<p>&#xac04;&#xb2e8;&#xd55c; &#xad6c;&#xbb38;&#xc5d0;&#xc11c;&#xb294; &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xc774; &#xc880;&#xb354; &#xae54;&#xb054;&#xd558;&#xb2e4;. &#xc5b4;&#xca0c;&#xb4e0; &#xc790;&#xbc14; &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xc740; &#xc880;&#xb354; &#xbcf5;&#xc7a1;&#xd55c; &#xad6c;&#xbb38;&#xc5d0;&#xc11c;&#xb294; &#xc81c;&#xd55c;&#xc801;&#xc774;&#xace0; &#xcf54;&#xb4dc;&#xb97c; &#xc5c9;&#xb9dd;&#xc73c;&#xb85c; &#xb9cc;&#xb4e4; &#xc218; &#xc788;&#xb2e4;. &#xadf8;&#xb7ec;&#xbbc0;&#xb85c; &#xbcf5;&#xc7a1;&#xd558;&#xac8c; &#xc0ac;&#xc6a9;&#xd558;&#xace0;&#xc790; &#xd55c;&#xb2e4;&#xba74; XML &#xb9e4;&#xd551; &#xad6c;&#xbb38;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xac83;&#xc774; &#xc880;&#xb354; &#xb098;&#xc744; &#xac83;&#xc774;&#xb2e4;.</p>
<p>&#xc5ec;&#xae30;&#xc11c; &#xb2f9;&#xc2e0;&#xacfc; &#xb2f9;&#xc2e0;&#xc758; &#xd504;&#xb85c;&#xc81d;&#xd2b8; &#xd300;&#xc740; &#xc5b4;&#xb5a4; &#xbc29;&#xbc95;&#xc774; &#xc88b;&#xc740;&#xc9c0; &#xacb0;&#xc815;&#xd574;&#xc57c; &#xd560; &#xac83;&#xc774;&#xb2e4;. &#xb9e4;&#xd551;&#xb41c; &#xad6c;&#xbb38;&#xc744; &#xc77c;&#xad00;&#xb41c; &#xbc29;&#xc2dd;&#xc73c;&#xb85c; &#xc815;&#xc758;&#xd558;&#xb294; &#xac83;&#xc774; &#xc911;&#xc694;&#xd558;&#xb2e4;. &#xc55e;&#xc11c; &#xc5b8;&#xae09;&#xd588;&#xc9c0;&#xb9cc; &#xbc18;&#xb4dc;&#xc2dc; &#xd55c;&#xac00;&#xc9c0;&#xb9cc; &#xace0;&#xc9d1;&#xd574;&#xc57c; &#xd558;&#xb294; &#xac74; &#xc544;&#xb2c8;&#xb2e4;. &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xc740; XML&#xb85c; &#xc27d;&#xac8c; &#xbcc0;&#xd658;&#xd560; &#xc218; &#xc788;&#xace0; &#xadf8; &#xbc18;&#xb300;&#xc758; &#xd615;&#xd0dc; &#xc5ed;&#xc2dc; &#xc27d;&#xac8c; &#xcc98;&#xb9ac;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p></section><section><a id="a.EC.8A.A4.EC.BD.94.ED.94.84.28Scope.29_.EC.99.80_.EC.83.9D.EB.AA.85.EC.A3.BC.EA.B8.B0.28Lifecycle.29"></a>
<h2>&#xc2a4;&#xcf54;&#xd504;(Scope) &#xc640; &#xc0dd;&#xba85;&#xc8fc;&#xae30;(Lifecycle)</h2>
<p>&#xc774;&#xc81c;&#xbd80;&#xd130; &#xb2e4;&#xb8f0; &#xc2a4;&#xcf54;&#xd504;&#xc640; &#xc0dd;&#xba85;&#xc8fc;&#xae30;&#xc5d0; &#xb300;&#xd574;&#xc11c; &#xc774;&#xd574;&#xd558;&#xb294; &#xac83;&#xc740; &#xb9e4;&#xc6b0; &#xc911;&#xc694;&#xd558;&#xb2e4;. &#xc2a4;&#xcf54;&#xd504;&#xc640; &#xc0dd;&#xba85;&#xc8fc;&#xae30;&#xb97c; &#xc798;&#xbabb; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xac83;&#xc740; &#xb2e4;&#xc591;&#xd55c; &#xb3d9;&#xc2dc;&#xc131; &#xbb38;&#xc81c;&#xb97c; &#xc57c;&#xae30;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p><hr />
<p><span class="label important">&#xcc38;&#xace0;</span> <strong>&#xac1d;&#xccb4; &#xc0dd;&#xba85;&#xc8fc;&#xae30;&#xc640; &#xc758;&#xc874;&#xc131; &#xc0bd;&#xc785; &#xd504;&#xb808;&#xc784;&#xc6cc;&#xd06c;</strong></p>
<p>&#xc758;&#xc874;&#xc131; &#xc0bd;&#xc785; &#xd504;&#xb808;&#xc784;&#xc6cc;&#xd06c;&#xb294; &#xc4f0;&#xb808;&#xb4dc;&#xc5d0; &#xc548;&#xc804;&#xd558;&#xb3c4;&#xb85d; &#xd574;&#xc900;&#xb2e4;. &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xc131;&#xc9c8;&#xc744; &#xac00;&#xc9c0;&#xb294; SqlSessions&#xacfc; &#xb9e4;&#xd37c;&#xb4e4; &#xadf8;&#xb9ac;&#xace0; &#xadf8;&#xac83;&#xb4e4;&#xc744; &#xc9c1;&#xc811; &#xbe48;&#xc5d0; &#xc0bd;&#xc785;&#xd558;&#xba74; &#xc0dd;&#xba85;&#xc8fc;&#xae30;&#xc5d0; &#xb300;&#xd574; &#xae30;&#xc5b5;&#xd558;&#xc9c0; &#xc54a;&#xc544;&#xb3c4; &#xb418;&#xac8c; &#xd574;&#xc900;&#xb2e4;. DI&#xd504;&#xb808;&#xc784;&#xc6cc;&#xd06c;&#xc640; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xae30; &#xc704;&#xd574; &#xc880;&#xb354; &#xb9ce;&#xc740; &#xc815;&#xbcf4;&#xb97c; &#xbcf4;&#xae30; &#xc704;&#xd574;&#xc11c;&#xb294; MyBatis-Spring&#xc774;&#xb098; MyBatis-Guice &#xd558;&#xc704; &#xd504;&#xb85c;&#xc81d;&#xd2b8;&#xb97c; &#xcc3e;&#xc544;&#xbcf4;&#xba74; &#xb41c;&#xb2e4;.</p><hr /><section>
        </main>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>©      2009–2024
<a href="https://www.mybatis.org/">MyBatis.org</a>
</p>
        </div>
      </div>
    </footer>
<script>
  if(anchors) {
    anchors.add();
  }
</script>
  </body>
</html>
