<!DOCTYPE html>


<!--
 | Generated by Apache Maven Doxia Site Renderer 2.0.0-M16 from src/site/ko/markdown/logging.md at 11 2월 2024
 | Rendered using Apache Maven Fluido Skin 2.0.0-M8
-->
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="generator" content="Apache Maven Doxia Site Renderer 2.0.0-M16" />
    <meta name="author" content="Clinton Begin, 이동국(한국어 번역)" />
    <title>mybatis – 마이바티스 3 | 로깅</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-2.0.0-M8.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
    <script src="./js/apache-maven-fluido-2.0.0-M8.min.js"></script>
  </head>
  <body>
    <div class="container-fluid container-fluid-top">
      <header>
        <div id="banner">
          <div class="pull-left"></div>
          <div class="pull-right"><div id="bannerRight"><h1><a href="https://blog.mybatis.org/" class="externalLink"><img class="imageLink" src="../../images/mybatis-logo.png" alt="MyBatis logo" /> MyBatis</a></h1></div></div>
          <div class="clear"><hr/></div>
        </div>

        <div id="breadcrumbs">
          <ul class="breadcrumb">
        <li id="publishDate">Last Published: 14 12월 2023<span class="divider">|</span>
</li>
          <li id="projectVersion">Version: 3.5.16-SNAPSHOT</li>
          </ul>
        </div>
      </header>
      <div class="row-fluid">
        <header id="leftColumn" class="span2">
          <nav class="well sidebar-nav">
  <ul class="nav nav-list">
   <li class="nav-header">Core</li>
    <li><a href="index.html">소개</a></li>
    <li><a href="getting-started.html">시작하기</a></li>
    <li><a href="configuration.html"><span class="icon-chevron-right"></span>매퍼 설정</a></li>
    <li><a href="sqlmap-xml.html"><span class="icon-chevron-right"></span>Mapper XML 파일</a></li>
    <li><a href="dynamic-sql.html">동적 SQL</a></li>
    <li><a href="java-api.html"><span class="icon-chevron-right"></span>자바 API</a></li>
    <li><a href="statement-builders.html">SQL Builder 클래스</a></li>
    <li class="active"><a>로깅</a></li>
   <li class="nav-header">프로젝트 문서화</li>
    <li><a href="project-info.html"><span class="icon-chevron-right"></span>프로젝트 정보</a></li>
    <li><a href="project-reports.html"><span class="icon-chevron-right"></span>프로젝트 보고서</a></li>
  </ul>
          </nav>
          <div class="well sidebar-nav">
            <div id="poweredBy">
              <div class="clear"></div>
              <div class="clear"></div>
              <div class="clear"></div>
<a href="https://maven.apache.org/" class="builtBy" target="_blank"><img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" /></a>
            </div>
          </div>
        </header>
        <main id="bodyColumn" class="span10">
<section><section>
<h2>Logging</h2>
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xb0b4;&#xbd80; &#xb85c;&#xadf8; &#xd329;&#xd1a0;&#xb9ac;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xc5ec; &#xb85c;&#xae45; &#xc815;&#xbcf4;&#xb97c; &#xc81c;&#xacf5;&#xd55c;&#xb2e4;. &#xb0b4;&#xbd80; &#xb85c;&#xadf8; &#xd329;&#xd1a0;&#xb9ac;&#xb294; &#xb85c;&#xae45; &#xc815;&#xbcf4;&#xb97c; &#xb2e4;&#xb978; &#xb85c;&#xadf8; &#xad6c;&#xd604;&#xccb4; &#xc911; &#xd558;&#xb098;&#xc5d0; &#xc804;&#xb2ec;&#xd55c;&#xb2e4;.</p>
<ul>

<li>SLF4J</li>
<li>Apache Commons Logging</li>
<li>Log4j 2</li>
<li>Log4j (deprecated since 3.5.9)</li>
<li>JDK logging</li>
</ul>
<p>&#xb85c;&#xae45; &#xc194;&#xb8e8;&#xc158;&#xc740; &#xb0b4;&#xbd80; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xb85c;&#xadf8; &#xd329;&#xd1a0;&#xb9ac;&#xc758; &#xb7f0;&#xd0c0;&#xc784; &#xccb4;&#xd06c;&#xb97c; &#xd1b5;&#xd574; &#xc120;&#xd0dd;&#xb41c;&#xb2e4;. &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xb85c;&#xadf8; &#xd329;&#xd1a0;&#xb9ac;&#xb294; &#xac00;&#xb2a5;&#xd558;&#xba74; &#xccab;&#xbc88;&#xc9f8; &#xad6c;&#xd604;&#xccb4;&#xb97c; &#xc0ac;&#xc6a9;&#xd560; &#xac83;&#xc774;&#xb2e4;(&#xc704; &#xb85c;&#xae45; &#xad6c;&#xd604;&#xccb4;&#xc758; &#xb098;&#xc5f4; &#xc21c;&#xc11c;&#xb294; &#xb0b4;&#xbd80;&#xc801;&#xc73c;&#xb85c; &#xc120;&#xd0dd;&#xd558;&#xb294; &#xc6b0;&#xc120;&#xc21c;&#xc704;&#xc774;&#xb2e4;). &#xb9cc;&#xc57d; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xac00; &#xc704; &#xad6c;&#xd604;&#xccb4;&#xc911; &#xd558;&#xb098;&#xb3c4; &#xcc3e;&#xc9c0; &#xbabb;&#xd55c;&#xb2e4;&#xba74; &#xb85c;&#xae45;&#xc744; &#xd558;&#xc9c0; &#xc54a;&#xc744; &#xac83;&#xc774;&#xb2e4;.</p>
<p>&#xb9ce;&#xc740; &#xd658;&#xacbd;&#xc740; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158; &#xc11c;&#xbc84;(&#xc88b;&#xc740; &#xc608;&#xb294; &#xd1b0;&#xcea3;&#xacfc; &#xc6f9;&#xc2a4;&#xd53c;&#xc5b4;)&#xc758; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4;&#xc758; &#xc77c;&#xbd80;&#xb85c; JCL &#xc744; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;. &#xc774;&#xb7ec;&#xd55c; &#xd658;&#xacbd;&#xc744; &#xc544;&#xb294; &#xac83;&#xc774; &#xc911;&#xc694;&#xd558;&#xb2e4;. &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xb85c;&#xae45; &#xad6c;&#xd604;&#xccb4;&#xb85c; JCL &#xc744; &#xc0ac;&#xc6a9;&#xd560; &#xac83;&#xc774;&#xb2e4;. &#xc6f9;&#xc2a4;&#xd53c;&#xc5b4;&#xc640; &#xac19;&#xc740; &#xd658;&#xacbd;&#xc5d0;&#xc11c; Log4J &#xc124;&#xc815;&#xc740; &#xbb34;&#xc2dc;&#xb420; &#xac83;&#xc774;&#xb2e4;. &#xc65c;&#xb0d0;&#xd558;&#xba74; &#xc6f9;&#xc2a4;&#xd53c;&#xc5b4;&#xb294; &#xc790;&#xccb4; JCL &#xad6c;&#xd604;&#xccb4;&#xb97c; &#xc81c;&#xacf5;&#xd558;&#xae30; &#xb54c;&#xbb38;&#xc774;&#xb2e4;. &#xc774;&#xb7ec;&#xd55c; &#xc0ac;&#xd56d;&#xc740; &#xbd88;&#xb9cc;&#xc2a4;&#xb7ec;&#xc6b8;&#xc218; &#xc788;&#xb2e4;. &#xc65c;&#xb0d0;&#xd558;&#xba74; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xb2f9;&#xc2e0;&#xc758; Log4J &#xc124;&#xc815;&#xc744; &#xbb34;&#xc2dc;&#xd558;&#xb294; &#xac83;&#xcc98;&#xb7fc; &#xbcf4;&#xc77c;&#xc218;&#xb3c4; &#xc788;&#xae30; &#xb54c;&#xbb38;&#xc774;&#xb2e4;. (&#xc0ac;&#xc2e4; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xb2f9;&#xc2e0;&#xc758; Log4J &#xc124;&#xc815;&#xc744; &#xbb34;&#xc2dc;&#xd55c;&#xb2e4;. &#xc65c;&#xb0d0;&#xd558;&#xba74; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; &#xc774;&#xb7ec;&#xd55c; &#xd658;&#xacbd;&#xc5d0;&#xc11c; JCL &#xc744; &#xc0ac;&#xc6a9;&#xd560; &#xac83;&#xc774;&#xae30; &#xb54c;&#xbb38;&#xc774;&#xb2e4;.) &#xb9cc;&#xc57d; &#xb2f9;&#xc2e0;&#xc758; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc774; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4;&#xc5d0; JCL &#xc744; &#xd3ec;&#xd568;&#xd55c; &#xd658;&#xacbd;&#xc5d0;&#xc11c; &#xb3cc;&#xc544;&#xac00;&#xc9c0;&#xb9cc; &#xb2e4;&#xb978; &#xb85c;&#xae45; &#xad6c;&#xd604;&#xccb4; &#xc911; &#xd558;&#xb098;&#xb97c; &#xb354; &#xc120;&#xd638;&#xd55c;&#xb2e4;&#xba74; &#xb2e4;&#xc74c;&#xc758; &#xba54;&#xc18c;&#xb4dc; &#xc911; &#xd558;&#xb098;&#xb97c; &#xd638;&#xcd9c;&#xd558;&#xc5ec; &#xb2e4;&#xb978; &#xb85c;&#xae45; &#xad6c;&#xd604;&#xccb4;&#xb97c; &#xc120;&#xd0dd; &#xd560; &#xc218; &#xc788;&#xb2e4;.</p>

<div class="verbatim">
<pre><code class="language-java">org.apache.ibatis.logging.LogFactory.useSlf4jLogging();
org.apache.ibatis.logging.LogFactory.useLog4JLogging();
org.apache.ibatis.logging.LogFactory.useLog4J2Logging();
org.apache.ibatis.logging.LogFactory.useJdkLogging();
org.apache.ibatis.logging.LogFactory.useCommonsLogging();
org.apache.ibatis.logging.LogFactory.useStdOutLogging();
</code></pre></div>
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xac00; &#xba54;&#xc18c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd558;&#xae30; &#xc804;&#xc5d0; &#xc704; &#xba54;&#xc18c;&#xb4dc; &#xc911; &#xd558;&#xb098;&#xb97c; &#xd638;&#xcd9c;&#xd574;&#xc57c; &#xd55c;&#xb2e4;. &#xc774; &#xba54;&#xc18c;&#xb4dc;&#xb4e4;&#xc740; &#xb7f0;&#xd0c0;&#xc784; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4;&#xc5d0; &#xad6c;&#xd604;&#xccb4;&#xac00; &#xc874;&#xc7ac;&#xd558;&#xba74; &#xadf8; &#xb85c;&#xadf8; &#xad6c;&#xd604;&#xccb4;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xac8c; &#xd55c;&#xb2e4;. &#xc608;&#xb97c;&#xb4e4;&#xc5b4; Log4J2 &#xb85c;&#xae45;&#xc744; &#xc120;&#xd0dd;&#xd588;&#xc9c0;&#xb9cc; &#xb7f0;&#xd0c0;&#xc784;&#xc5d0; Log4J2 &#xad6c;&#xd604;&#xccb4;&#xac00; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4;&#xc5d0; &#xc5c6;&#xb2e4;&#xba74; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; Log4J2 &#xad6c;&#xd604;&#xccb4;&#xc758; &#xc0ac;&#xc6a9;&#xc744; &#xbb34;&#xc2dc;&#xd558;&#xace0; &#xb85c;&#xae45; &#xad6c;&#xd604;&#xccb4;&#xb97c; &#xcc3e;&#xc544; &#xb2e4;&#xc2dc; &#xc0ac;&#xc6a9;&#xd560; &#xac83;&#xc774;&#xb2e4;.</p>
<p>SLF4J, Jakarta Commons &#xb85c;&#xae45;, Log4J &#xadf8;&#xb9ac;&#xace0; JDK &#xb85c;&#xae45; API &#xc5d0; &#xb300;&#xd55c; &#xc124;&#xba85;&#xc740; &#xc774; &#xbb38;&#xc11c;&#xc758; &#xbc94;&#xc704;&#xb97c; &#xbc97;&#xc5b4;&#xb09c;&#xb2e4;. &#xc774;&#xb7ec;&#xd55c; &#xb85c;&#xae45; &#xad00;&#xb828; &#xd504;&#xb808;&#xc784;&#xc6cc;&#xd06c;&#xc5d0; &#xb300;&#xd574; &#xc880;&#xb354; &#xc54c;&#xace0; &#xc2f6;&#xb2e4;&#xba74; &#xac1c;&#xbcc4; &#xc704;&#xce58;&#xc5d0;&#xc11c; &#xc880;&#xb354; &#xb9ce;&#xc740; &#xc815;&#xbcf4;&#xb97c; &#xc5bb;&#xc744; &#xc218; &#xc788;&#xc744; &#xac83;&#xc774;&#xb2e4;.</p>
<ul>

<li><a href="https://www.slf4j.org/" class="externalLink">SLF4J</a></li>
<li><a href="https://commons.apache.org/proper/commons-logging/" class="externalLink">Apache Commons Logging</a></li>
<li><a href="https://logging.apache.org/log4j/2.x/" class="externalLink">Apache Log4j 2.x</a></li>
<li><a href="https://docs.oracle.com/javase/8/docs/technotes/guides/logging/overview.html" class="externalLink">JDK Logging API</a></li>
</ul><section>
<h3>Logging Configuration</h3>
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xb85c;&#xae45; &#xad6c;&#xbb38;&#xc744; &#xbcf4;&#xae30; &#xc704;&#xd574;&#xc11c; &#xd328;&#xd0a4;&#xc9c0;, &#xb9e4;&#xd37c;&#xc758; &#xc804;&#xccb4; &#xacbd;&#xb85c;, &#xad6c;&#xbb38;&#xba85;&#xc758; &#xba85;&#xba85;&#xacf5;&#xac04;&#xc5d0; &#xb300;&#xd574; &#xd65c;&#xc131;&#xd654;&#xd574;&#xc8fc;&#xc5b4;&#xc57c; &#xd560;&#xac83;&#xc774;&#xb2e4;.</p>
<p>&#xb2e4;&#xc2dc; &#xc598;&#xae30;&#xd574;&#xc11c; &#xc0ac;&#xc6a9;&#xd560; &#xb85c;&#xae45; &#xad6c;&#xd604;&#xccb4;&#xc5d0; &#xb530;&#xb77c;&#xc57c; &#xd558;&#xace0; &#xc6b0;&#xb9ac;&#xb294; SLF4J(Logback)&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xbc29;&#xbc95;&#xc744; &#xbcf4;&#xc5ec;&#xc904; &#xac83;&#xc774;&#xb2e4;. &#xb85c;&#xae45; &#xc124;&#xc815;&#xc740; &#xb300;&#xbd80;&#xbd84; &#xd558;&#xb098; &#xc774;&#xc0c1;&#xc758; &#xc124;&#xc815;&#xd30c;&#xc77c;(&#xc608;&#xb97c;&#xb4e4;&#xba74;, <code>logback.xml</code>)&#xacfc; &#xba87;&#xac1c;&#xc758; &#xc0c8;&#xb85c;&#xc6b4; jar&#xd30c;&#xc77c;&#xc744; &#xb2e4;&#xb8ec;&#xb2e4;. &#xb2e4;&#xc74c;&#xc758; &#xc124;&#xc815;&#xc608;&#xc81c;&#xb294; SLF4J(Logback)&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xc5ec; &#xc124;&#xc815;&#xd558;&#xace0; 2&#xb2e8;&#xacc4;&#xb85c; &#xc124;&#xc815;&#xd55c;&#xb2e4;.</p><section>
<h4>&#xccab;&#xbc88;&#xc9f8; &#xb2e8;&#xacc4; : SLF4J + Logback JAR &#xd30c;&#xc77c; &#xcd94;&#xac00;&#xd558;&#xae30;</h4>
<p>SLF4J(Logback)&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xae30; &#xb54c;&#xbb38;&#xc5d0; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc5d0; JAR &#xd30c;&#xc77c;&#xc774; &#xc788;&#xc5b4;&#xc57c; &#xd55c;&#xb2e4;. Log4J &#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xae30; &#xc704;&#xd574; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc758; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4;&#xc5d0; JAR &#xd30c;&#xc77c;&#xc744; &#xcd94;&#xac00;&#xd560; &#xd544;&#xc694;&#xac00; &#xc788;&#xb2e4;. &#xc704; URL &#xc5d0;&#xc11c; SLF4J(Logback) &#xb97c; &#xb2e4;&#xc6b4;&#xb85c;&#xb4dc; &#xd560; &#xc218; &#xc788;&#xb2e4;.</p>
<p>&#xc6f9;&#xc774;&#xb098; &#xae30;&#xc5c5;&#xc6a9; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc5d0;&#xc11c;&#xb294; <code>WEB-INF/lib</code> &#xb514;&#xb809;&#xd130;&#xb9ac;&#xc5d0; <code>logback-classic.jar</code> ,<code>logback-core.jar</code> and <code>slf4j-api.jar</code> &#xd30c;&#xc77c;&#xc744; &#xcd94;&#xac00;&#xd560; &#xc218; &#xc788;&#xb2e4;. &#xb2e8;&#xb3c5;&#xc73c;&#xb85c; &#xc2e4;&#xd589;&#xb418;&#xb294; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc5d0;&#xc11c;&#xb294; JVM&#xc758; <code>-classpath</code> &#xc2dc;&#xc791; &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xc5d0;&#xc11c; &#xac04;&#xb2e8;&#xd788; &#xcd94;&#xac00;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p>
<p>If you use the maven, you can download jar files by adding following settings on your <code>pom.xml</code>.</p>

<div class="verbatim">
<pre><code class="language-xml">&lt;dependency&gt;
  &lt;groupId&gt;ch.qos.logback&lt;/groupId&gt;
  &lt;artifactId&gt;logback-classic&lt;/artifactId&gt;
  &lt;version&gt;1.x.x&lt;/version&gt;
&lt;/dependency&gt;
</code></pre></div></section><section>
<h4>&#xb450;&#xbc88;&#xc9f8; &#xb2e8;&#xacc4; : Logback &#xc124;&#xc815;&#xd558;&#xae30;</h4>
<p>Logback &#xb97c; &#xc124;&#xc815;&#xd558;&#xb294; &#xac83;&#xc740; &#xac04;&#xb2e8;&#xd558;&#xb2e4;. &#xb2e4;&#xc74c;&#xc758; &#xb9e4;&#xd37c;&#xb97c; &#xc704;&#xd55c; &#xb85c;&#xae45;&#xc744; &#xd65c;&#xc131;&#xd654;&#xd558;&#xb824;&#xace0; &#xd55c;&#xb2e4;&#xace0; &#xd574;&#xbcf4;&#xc790;.</p>

<div class="verbatim">
<pre><code class="language-java">package org.mybatis.example;
public interface BlogMapper {
  @Select(&quot;SELECT * FROM blog WHERE id = #{id}&quot;)
  Blog selectBlog(int id);
}
</code></pre></div>
<p>&#xc544;&#xb798;&#xcc98;&#xb7fc; <code>logback.xml</code>&#xd30c;&#xc77c;&#xc744; &#xb9cc;&#xb4e4;&#xc5b4;&#xc11c; &#xd074;&#xb798;&#xc2a4;&#xd328;&#xc2a4;&#xc5d0; &#xb450;&#xc790;.</p>

<div class="verbatim">
<pre><code class="language-xml">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;!DOCTYPE configuration&gt;
&lt;configuration&gt;

  &lt;appender name=&quot;stdout&quot; class=&quot;ch.qos.logback.core.ConsoleAppender&quot;&gt;
    &lt;encoder&gt;
      &lt;pattern&gt;%5level [%thread] - %msg%n&lt;/pattern&gt;
    &lt;/encoder&gt;
  &lt;/appender&gt;

  &lt;logger name=&quot;org.mybatis.example.BlogMapper&quot;&gt;
    &lt;level value=&quot;trace&quot;/&gt;
  &lt;/logger&gt;
  &lt;root level=&quot;error&quot;&gt;
    &lt;appender-ref ref=&quot;stdout&quot;/&gt;
  &lt;/root&gt;

&lt;/configuration&gt;
</code></pre></div>
<p>&#xc704; &#xd30c;&#xc77c;&#xc740; <code>org.mybatis.example.BlogMapper</code>&#xc758; &#xc0c1;&#xc138;&#xd55c; &#xb85c;&#xadf8;&#xc640; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc758; &#xc5d0;&#xb7ec;&#xb4e4;&#xc744; &#xcd9c;&#xb825;&#xd560; &#xac83;&#xc774;&#xb2e4;.</p>
<p>finer&#xb808;&#xbca8;&#xb85c; &#xb85c;&#xae45;&#xc744; &#xd558;&#xace0;&#xc790; &#xd55c;&#xb2e4;&#xba74; &#xc804;&#xccb4; &#xb9e4;&#xd37c; &#xd30c;&#xc77c;&#xb300;&#xc2e0; &#xd2b9;&#xc815; &#xad6c;&#xbb38;&#xb9cc;&#xc744; &#xb85c;&#xae45;&#xd560; &#xc218; &#xc788;&#xb2e4;. &#xb2e4;&#xc74c; &#xc904;&#xc740; <code>selectBlog</code>&#xad6c;&#xbb38;&#xc758; &#xb85c;&#xadf8;&#xb97c; &#xcd9c;&#xb825;&#xd558;&#xb3c4;&#xb85d; &#xd55c;&#xb2e4;.</p>

<div class="verbatim">
<pre><code class="language-xml">&lt;logger name=&quot;org.mybatis.example.BlogMapper.selectBlog&quot;&gt;
  &lt;level value=&quot;trace&quot;/&gt;
&lt;/logger&gt;
</code></pre></div>
<p>&#xbc18;&#xb300;&#xb85c; &#xd2b9;&#xc815; &#xb9e4;&#xd37c;&#xb4e4;&#xc5d0; &#xb300;&#xd574; &#xb85c;&#xae45;&#xc744; &#xc6d0;&#xd560; &#xc218; &#xc788;&#xb2e4;. &#xc774; &#xacbd;&#xc6b0; &#xb9e4;&#xd37c;&#xc758; &#xac00;&#xc7a5; &#xc0c1;&#xc704; &#xd328;&#xd0a4;&#xc9c0;&#xc5d0; &#xb85c;&#xac70;&#xb97c; &#xcd94;&#xac00;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p>

<div class="verbatim">
<pre><code class="language-xml">&lt;logger name=&quot;org.mybatis.example&quot;&gt;
  &lt;level value=&quot;trace&quot;/&gt;
&lt;/logger&gt;
</code></pre></div>
<p>&#xd070; &#xacb0;&#xacfc;&#xb97c; &#xb9ac;&#xd134;&#xd560; &#xc218; &#xc788;&#xb294; &#xcffc;&#xb9ac;&#xac00; &#xc788;&#xb2e4;. &#xc774; &#xacbd;&#xc6b0; &#xacb0;&#xacfc;&#xac00; &#xc544;&#xb2cc; SQL&#xad6c;&#xbb38;&#xb9cc;&#xc744; &#xbcf4;&#xace0;&#xc790; &#xd560; &#xc218; &#xc788;&#xb2e4;. &#xc774;&#xb7ec;&#xd55c; &#xbaa9;&#xc801;&#xc73c;&#xb85c; SQL&#xad6c;&#xbb38;&#xc740; DEBUG&#xb808;&#xbca8;(JDK&#xb85c;&#xae45;&#xc5d0;&#xc11c;&#xb294; FINE)&#xb85c; &#xc9c0;&#xc815;&#xd558;&#xace0; &#xacb0;&#xacfc;&#xc5d0; &#xb300;&#xd574;&#xc11c;&#xb294; TRACE&#xb808;&#xbca8;(JDK&#xb85c;&#xae45;&#xc5d0;&#xc11c;&#xb294; FINER)&#xb85c; &#xc9c0;&#xc815;&#xd55c;&#xb2e4;. &#xacb0;&#xacfc;&#xac00; &#xc544;&#xb2cc; &#xad6c;&#xbb38;&#xb9cc; &#xbcf4;&#xace0;&#xc790; &#xd558;&#xb294; &#xacbd;&#xc6b0;&#xc5d0;&#xb294; DEBUG&#xb85c; &#xb808;&#xbca8;&#xc744; &#xc124;&#xc815;&#xd558;&#xc790;.</p>

<div class="verbatim">
<pre><code class="language-xml">&lt;logger name=&quot;org.mybatis.example&quot;&gt;
  &lt;level value=&quot;debug&quot;/&gt;
&lt;/logger&gt;
</code></pre></div>
<p>&#xb2e4;&#xc74c;&#xcc98;&#xb7fc; &#xb9e4;&#xd37c; &#xc778;&#xd130;&#xd398;&#xc774;&#xc2a4;&#xac00; &#xc544;&#xb2cc; &#xb9e4;&#xd37c; XML&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xb2e4;&#xba74; &#xc5b4;&#xb5bb;&#xac8c; &#xd574;&#xc57c; &#xd560;&#xae4c;?</p>

<div class="verbatim">
<pre><code class="language-xml">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;
&lt;!DOCTYPE mapper
  PUBLIC &quot;-//mybatis.org//DTD Mapper 3.0//EN&quot;
  &quot;https://mybatis.org/dtd/mybatis-3-mapper.dtd&quot;&gt;
&lt;mapper namespace=&quot;org.mybatis.example.BlogMapper&quot;&gt;
  &lt;select id=&quot;selectBlog&quot; resultType=&quot;Blog&quot;&gt;
    select * from Blog where id = #{id}
  &lt;/select&gt;
&lt;/mapper&gt;
</code></pre></div>
<p>&#xc774;&#xb7f0; &#xacbd;&#xc6b0;&#xc5d0;&#xb294; &#xc544;&#xb798;&#xcc98;&#xb7fc; &#xba85;&#xba85;&#xacf5;&#xac04;&#xc744; &#xcd94;&#xac00;&#xd574;&#xc11c; XML&#xd30c;&#xc77c; &#xc804;&#xccb4;&#xb97c; &#xb85c;&#xae45;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p>

<div class="verbatim">
<pre><code class="language-xml">&lt;logger name=&quot;org.mybatis.example.BlogMapper&quot;&gt;
  &lt;level value=&quot;trace&quot;/&gt;
&lt;/logger&gt;
</code></pre></div>
<p>&#xb610;&#xb294; &#xd2b9;&#xc815; &#xad6c;&#xbb38;&#xb9cc;&#xc744; &#xb85c;&#xae45;&#xd558;&#xae30; &#xc704;&#xd574;&#xc11c;&#xb294;</p>

<div class="verbatim">
<pre><code class="language-xml">&lt;logger name=&quot;org.mybatis.example.BlogMapper.selectBlog&quot;&gt;
  &lt;level value=&quot;trace&quot;/&gt;
&lt;/logger&gt;
</code></pre></div>
<p>&#xc55e;&#xc11c; &#xc5b8;&#xae09;&#xd55c;&#xac83;&#xcc98;&#xb7fc; &#xb9e4;&#xd37c; &#xc778;&#xd130;&#xd398;&#xc774;&#xc2a4;&#xc640; XML&#xb9e4;&#xd37c; &#xd30c;&#xc77c;&#xac04;&#xc758; &#xcc28;&#xc774;&#xb294; &#xc5c6;&#xb2e4;.</p>
<p><code>logback.xml</code> &#xd30c;&#xc77c;&#xc758; &#xb098;&#xba38;&#xc9c0;&#xb294; &#xc5b4;&#xd39c;&#xb354;(appender)&#xb97c; &#xc124;&#xc815;&#xd558;&#xae30; &#xc704;&#xd574; &#xc0ac;&#xc6a9;&#xd588;&#xb2e4;. &#xc5b4;&#xd39c;&#xb354;&#xb294; &#xc774; &#xbb38;&#xc11c;&#xc758; &#xbc94;&#xc704;&#xb97c; &#xb118;&#xc5b4;&#xc120;&#xb2e4;. <a href="https://logback.qos.ch/" class="externalLink">Logback</a> &#xc6f9;&#xc0ac;&#xc774;&#xd2b8;&#xc5d0;&#xc11c; &#xc880;&#xb354; &#xb9ce;&#xc740; &#xc815;&#xbcf4;&#xb97c; &#xc5bb;&#xc744; &#xc218; &#xc788;&#xb2e4;. &#xc124;&#xc815;&#xd30c;&#xc77c;&#xac04;&#xc758; &#xcc28;&#xc774;&#xb294; &#xc2e4;&#xd589;&#xc744; &#xd574;&#xbcf4;&#xba74; &#xac04;&#xb2e8;&#xd788; &#xd655;&#xc778;&#xd560; &#xc218; &#xc788;&#xb2e4;.</p></section><section>
<h4>Configuration example for Log4j 2</h4>

<div class="verbatim">
<pre><code class="language-xml">&lt;!-- pom.xml --&gt;
&lt;dependency&gt;
  &lt;groupId&gt;org.apache.logging.log4j&lt;/groupId&gt;
  &lt;artifactId&gt;log4j-core&lt;/artifactId&gt;
  &lt;version&gt;2.x.x&lt;/version&gt;
&lt;/dependency&gt;
</code></pre></div>

<div class="verbatim">
<pre><code class="language-xml">&lt;!-- log4j2.xml --&gt;
&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;Configuration xmlns=&quot;http://logging.apache.org/log4j/2.0/config&quot;&gt;

  &lt;Appenders&gt;
    &lt;Console name=&quot;stdout&quot; target=&quot;SYSTEM_OUT&quot;&gt;
      &lt;PatternLayout pattern=&quot;%5level [%t] - %msg%n&quot;/&gt;
    &lt;/Console&gt;
  &lt;/Appenders&gt;

  &lt;Loggers&gt;
    &lt;Logger name=&quot;org.mybatis.example.BlogMapper&quot; level=&quot;trace&quot;/&gt;
    &lt;Root level=&quot;error&quot; &gt;
      &lt;AppenderRef ref=&quot;stdout&quot;/&gt;
    &lt;/Root&gt;
  &lt;/Loggers&gt;

&lt;/Configuration&gt;
</code></pre></div></section><section>
<h4>Configuration example for Log4j</h4>

<div class="verbatim">
<pre><code class="language-xml">&lt;!-- pom.xml --&gt;
&lt;dependency&gt;
  &lt;groupId&gt;log4j&lt;/groupId&gt;
  &lt;artifactId&gt;log4j&lt;/artifactId&gt;
  &lt;version&gt;1.2.17&lt;/version&gt;
&lt;/dependency&gt;
</code></pre></div>

<div class="verbatim">
<pre><code class="language-properties"># log4j.properties
log4j.rootLogger=ERROR, stdout

log4j.logger.org.mybatis.example.BlogMapper=TRACE

log4j.appender.stdout=org.apache.log4j.ConsoleAppender
log4j.appender.stdout.layout=org.apache.log4j.PatternLayout
log4j.appender.stdout.layout.ConversionPattern=%5p [%t] - %m%n
</code></pre></div></section><section>
<h4>Configuration example for JDK logging</h4>

<div class="verbatim">
<pre><code class="language-properties"># logging.properties
handlers=java.util.logging.ConsoleHandler
.level=SEVERE

org.mybatis.example.BlogMapper=FINER

java.util.logging.ConsoleHandler.level=ALL
java.util.logging.ConsoleHandler.formatter=java.util.logging.SimpleFormatter
java.util.logging.SimpleFormatter.format=%1$tT.%1$tL %4$s %3$s - %5$s%6$s%n
</code></pre></div></section></section></section></section>
        </main>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>©      2009–2024
<a href="https://www.mybatis.org/">MyBatis.org</a>
</p>
        </div>
      </div>
    </footer>
<script>
  if(anchors) {
    anchors.add();
  }
</script>
  </body>
</html>
