<!DOCTYPE html>
<!--
 | Generated by Apache Maven Doxia at 2013. 2. 15
 | Rendered using Apache Maven Fluido Skin 1.3.0
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ko" lang="ko">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="author" content="The MyBatis Team" />
    <meta name="Date-Revision-yyyymmdd" content="20130215" />
    <meta http-equiv="Content-Language" content="ko" />
    <title>MyBatis - 
    MyBatis 3 | 정책 빌더</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-1.3.0.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />

      
    <script type="text/javascript" src="./js/apache-maven-fluido-1.3.0.min.js"></script>

    
            </head>
        <body class="topBarDisabled">
          
        
    
        <div class="container-fluid">
          <div id="banner">
        <div class="pull-left">
                                                  <a href="index.html" id="bannerLeft" title="MyBatis logo">
                                                                                                <img src="../../images/logo.png"  alt="MyBatis logo"/>
                </a>
                      </div>
        <div class="pull-right">  </div>
        <div class="clear"><hr/></div>
      </div>

      <div id="breadcrumbs">
        <ul class="breadcrumb">
                
                    
                  <li id="publishDate">Last Published: 15 2월 2013</li>
                  <li class="divider">|</li> <li id="projectVersion">Version: 3.2.0-SNAPSHOT</li>
                      
                
                    
      
                            </ul>
      </div>

            
      <div class="row-fluid">
        <div id="leftColumn" class="span3">
          <div class="well sidebar-nav">
                
                    
                <ul class="nav nav-list">
                    <li class="nav-header">Core</li>
                                
      <li>
    
                          <a href="index.html" title="소개">
          <i class="none"></i>
        소개</a>
            </li>
                  
      <li>
    
                          <a href="getting-started.html" title="시작하기">
          <i class="none"></i>
        시작하기</a>
            </li>
                                                                                                                                                                                                                    
      <li>
    
                          <a href="configuration.html" title="매퍼 설정">
          <i class="icon-chevron-right"></i>
        매퍼 설정</a>
                  </li>
                                                                                                                                                              
      <li>
    
                          <a href="sqlmap-xml.html" title="Mapper XML 파일">
          <i class="icon-chevron-right"></i>
        Mapper XML 파일</a>
                  </li>
                  
      <li>
    
                          <a href="dynamic-sql.html" title="동적 SQL">
          <i class="none"></i>
        동적 SQL</a>
            </li>
                                                                                      
      <li>
    
                          <a href="java-api.html" title="자바 API">
          <i class="icon-chevron-right"></i>
        자바 API</a>
                  </li>
                                                                                          
      <li class="active">
    
            <a href="#"><i class="icon-chevron-down"></i>구문 빌더</a>
                  <ul class="nav nav-list">
                      
      <li>
    
                          <a href="statement-builders.html#SelectBuilder" title="SelectBuilder">
          <i class="none"></i>
        SelectBuilder</a>
            </li>
                      
      <li>
    
                          <a href="statement-builders.html#SqlBuilder" title="SqlBuilder">
          <i class="none"></i>
        SqlBuilder</a>
            </li>
              </ul>
        </li>
                  
      <li>
    
                          <a href="logging.html" title="로깅">
          <i class="none"></i>
        로깅</a>
            </li>
                              <li class="nav-header">프로젝트 문서화</li>
                                                                                                                                                                                                                                                                                        
      <li>
    
                          <a href="project-info.html" title="프로젝트 정보">
          <i class="icon-chevron-right"></i>
        프로젝트 정보</a>
                  </li>
                                                                                                                                                                                                                                                        
      <li>
    
                          <a href="project-reports.html" title="프로젝트 보고서">
          <i class="icon-chevron-right"></i>
        프로젝트 보고서</a>
                  </li>
            </ul>
                
                    
                
          <hr class="divider" />

           <div id="poweredBy">
                            <div class="clear"></div>
                            <div class="clear"></div>
                            <div class="clear"></div>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                  </div>
          </div>
        </div>
        
                
        <div id="bodyColumn"  class="span9" >
                                  
            <!-- Copyright 2010-2012 The MyBatis Team

  Licensed under the Apache License, Version 2.0 (the "License");
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License. --><!-- version: $Id$ -->

  
  <div class="section"><h2>&#xc815;&#xcc45; &#xbe4c;&#xb354;<a name="a_"></a></h2>
  <div class="section"><h3>SelectBuilder<a name="SelectBuilder"></a></h3>
  <p>&#xc790;&#xbc14; &#xac1c;&#xbc1c;&#xc790;&#xc5d0;&#xac8c; &#xac00;&#xc7a5; &#xb054;&#xcc0d;&#xd55c; &#xc77c;&#xc911; &#xd558;&#xb098;&#xb294; &#xc790;&#xbc14; &#xcf54;&#xb4dc;&#xc5d0;&#xc11c; &#xb0b4;&#xc7a5; SQL &#xc744; &#xcc98;&#xb9ac;&#xd558;&#xb294; &#xac83;&#xc774;&#xb2e4;. SQL &#xc740; &#xd56d;&#xc0c1; &#xb3d9;&#xc801;&#xc73c;&#xb85c; &#xc0dd;&#xc131;&#xb418;&#xae30;
&#xb54c;&#xbb38;&#xc5d0; &#xadf8;&#xb807;&#xb2e4;. &#xbc18;&#xba74;&#xc5d0; &#xd30c;&#xc77c;&#xc774;&#xb098; &#xc800;&#xc7a5; &#xd504;&#xb85c;&#xc2dc;&#xc800;&#xb97c; &#xc678;&#xbd80;&#xc5d0; &#xb458;&#xc218;&#xb3c4; &#xc788;&#xb2e4;. &#xc774;&#xbbf8; &#xadf8;&#xb807;&#xac8c; &#xd558;&#xace0; &#xc788;&#xb2e4;&#xba74;, MyBatis &#xb294; XML &#xb9e4;&#xd551;&#xc5d0;&#xc11c;
&#xb3d9;&#xc801;&#xc73c;&#xb85c; SQL &#xc744; &#xc0dd;&#xc131;&#xd558;&#xae30; &#xc704;&#xd55c; &#xac15;&#xb825;&#xd55c; &#xb300;&#xb2f5;&#xc774; &#xb420; &#xac83;&#xc774;&#xb2e4;. &#xc5b4;&#xca0c;&#xb4e0; &#xb54c;&#xb54c;&#xb85c; &#xc790;&#xbc14;&#xcf54;&#xb4dc;&#xc5d0;&#xc11c; SQL &#xad6c;&#xbb38;&#xc744; &#xbb38;&#xc790;&#xc5f4;&#xc744; &#xb9cc;&#xb4e4;&#xc5b4;&#xc57c; &#xd560;
&#xd544;&#xc694;&#xac00; &#xc885;&#xc885; &#xc788;&#xb2e4;. &#xc774; &#xacbd;&#xc6b0;, MyBatis &#xb294; &#xc880;&#xb354; &#xc27d;&#xac8c; &#xb9cc;&#xb4e4;&#xb3c4;&#xb85d; &#xd574;&#xc900;&#xb2e4;. &#xc774; &#xae30;&#xb2a5;&#xc740; + &#xae30;&#xd638;, &#xb530;&#xc634;&#xd45c;, &#xac1c;&#xd589;&#xbb38;&#xc790; &#xadf8;&#xb9ac;&#xace0; &#xcf64;&#xb9c8;&#xc640;
AND &#xb4f1;&#xc758; &#xd3ec;&#xb9f7;&#xd305;&#xc5d0; &#xad00;&#xb828;&#xb41c; &#xc791;&#xc5c5;&#xc744; &#xc904;&#xc5ec;&#xc900;&#xb2e4;. &#xc790;&#xbc14; &#xcf54;&#xb4dc;&#xc5d0;&#xc11c; SQL &#xcf54;&#xb4dc;&#xb97c; &#xb3d9;&#xc801;&#xc73c;&#xb85c; &#xc0dd;&#xc131;&#xd558;&#xb294; &#xac83;&#xc740; &#xc815;&#xb9d0; &#xb054;&#xcc0d;&#xd558;&#xb2e4;.</p>
  <p>MyBatis 3 &#xc740; &#xc774; &#xbb38;&#xc81c;&#xb294; &#xb2e4;&#xb8e8;&#xae30; &#xc704;&#xd574; &#xb2e4;&#xb978; &#xcee8;&#xc149;&#xc744; &#xc18c;&#xac1c;&#xd55c;&#xb2e4;. &#xb2e8;&#xacc4;&#xbcc4;&#xb85c; SQL &#xad6c;&#xbb38;&#xc744; &#xb9cc;&#xb4e4;&#xb3c4;&#xb85d; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd558;&#xb294; &#xd074;&#xb798;&#xc2a4;&#xc758;
&#xc778;&#xc2a4;&#xd134;&#xc2a4;&#xb97c; &#xc0dd;&#xc131; &#xd560; &#xc218; &#xc788;&#xb2e4;. &#xd558;&#xc9c0;&#xb9cc; &#xadf8; &#xd6c4; SQL &#xc740; SQL &#xc774;&#xb77c;&#xae30; &#xbcf4;&#xb2e4;&#xb294; &#xc790;&#xbc14;&#xc5d0; &#xac00;&#xae4c;&#xc6b4; &#xd615;&#xd0dc;&#xb85c; &#xb05d;&#xb098;&#xac8c; &#xb41c;&#xb2e4;. &#xb300;&#xc2e0; &#xc870;&#xae08; &#xb2e4;&#xb978;
&#xac83;&#xc744; &#xc2dc;&#xb3c4;&#xd560; &#xac83;&#xc774;&#xb2e4;.</p>
  <p><b>SelectBuilder &#xc758; &#xbe44;&#xbc00;</b></p>
  <p>SelectBuilder &#xd074;&#xb798;&#xc2a4;&#xb294; &#xb9c8;&#xbc95;&#xc2a4;&#xb7fd;&#xc9c0;&#xb294; &#xc54a;&#xb2e4;. &#xc5b4;&#xb5bb;&#xac8c; &#xc791;&#xb3d9;&#xd558;&#xb294;&#xc9c0; &#xbaa8;&#xb978;&#xb2e4;&#xba74; &#xc88b;&#xc740; &#xc120;&#xd0dd;&#xc774;&#xb77c;&#xace0; &#xbcf4;&#xae30;&#xc5d0;&#xb3c4; &#xc5b4;&#xb835;&#xb2e4;. &#xadf8;&#xb798;&#xc11c; &#xbc14;&#xb85c;
&#xc0b4;&#xd3b4;&#xbcf4;&#xc790;. SelectBuilder &#xb294; &#xae54;&#xb054;&#xd55c; &#xbb38;&#xbc95;&#xc774; &#xac00;&#xb2a5;&#xd558;&#xb3c4;&#xb85d; Static Import &#xc640; ThreadLocal &#xbcc0;&#xc218;&#xc758; &#xc870;&#xd569;&#xc744; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;. &#xc0dd;&#xc131;&#xd558;&#xb294;
&#xba54;&#xc11c;&#xb4dc;&#xb294; &#xb2e4;&#xc74c;&#xacfc; &#xac19;&#xb2e4;.</p>
<div class="source"><pre class="prettyprint">public String selectBlogsSql() {
  BEGIN(); // Clears ThreadLocal variable
  SELECT(&quot;*&quot;);
  FROM(&quot;BLOG&quot;);
  return SQL();
}</pre></div>  
    <p>&#xc815;&#xc801;&#xc73c;&#xb85c; &#xbe4c;&#xb4dc;&#xd558;&#xb294; &#xb9e4;&#xc6b0; &#xac04;&#xb2e8;&#xd55c; &#xc608;&#xc81c;&#xc774;&#xb2e4;. &#xadf8;&#xb798;&#xc11c; &#xc880;&#xb354; &#xbcf5;&#xc7a1;&#xd55c; &#xc608;&#xc81c;&#xb97c; &#xbcf4;&#xc790;.</p>
<div class="source"><pre class="prettyprint">private String selectPersonSql() {
  BEGIN(); // Clears ThreadLocal variable
  SELECT(&quot;P.ID, P.USERNAME, P.PASSWORD, P.FULL_NAME&quot;);
  SELECT(&quot;P.LAST_NAME, P.CREATED_ON, P.UPDATED_ON&quot;);
  FROM(&quot;PERSON P&quot;);
  FROM(&quot;ACCOUNT A&quot;);
  INNER_JOIN(&quot;DEPARTMENT D on D.ID = P.DEPARTMENT_ID&quot;);
  INNER_JOIN(&quot;COMPANY C on D.COMPANY_ID = C.ID&quot;);
  WHERE(&quot;P.ID = A.ID&quot;);
  WHERE(&quot;P.FIRST_NAME like ?&quot;);
  OR();
  WHERE(&quot;P.LAST_NAME like ?&quot;);
  GROUP_BY(&quot;P.ID&quot;);
  HAVING(&quot;P.LAST_NAME like ?&quot;);
  OR();
  HAVING(&quot;P.FIRST_NAME like ?&quot;);
  ORDER_BY(&quot;P.ID&quot;);
  ORDER_BY(&quot;P.FULL_NAME&quot;);
  return SQL();
}</pre></div>  
    <p>&#xc704; SQL &#xc774; &#xbe4c;&#xb4dc;&#xb418;&#xba74; &#xb2e4;&#xc74c;&#xc758; &#xbb38;&#xc790;&#xc5f4;&#xacfc; &#xac70;&#xc758; &#xac19;&#xc744; &#xac83;&#xc774;&#xb2e4;. &#xc608;&#xb97c; &#xb4e4;&#xba74;</p>
<div class="source"><pre class="prettyprint">&quot;SELECT P.ID, P.USERNAME, P.PASSWORD, P.FULL_NAME, &quot;
&quot;P.LAST_NAME,P.CREATED_ON, P.UPDATED_ON &quot; +
&quot;FROM PERSON P, ACCOUNT A &quot; +
&quot;INNER JOIN DEPARTMENT D on D.ID = P.DEPARTMENT_ID &quot; +
&quot;INNER JOIN COMPANY C on D.COMPANY_ID = C.ID &quot; +
&quot;WHERE (P.ID = A.ID AND P.FIRST_NAME like ?) &quot; +
&quot;OR (P.LAST_NAME like ?) &quot; +
&quot;GROUP BY P.ID &quot; +
&quot;HAVING (P.LAST_NAME like ?) &quot; +
&quot;OR (P.FIRST_NAME like ?) &quot; +
&quot;ORDER BY P.ID, P.FULL_NAME&quot;;</pre></div>  
    <p>&#xc774;&#xb7ec;&#xd55c; &#xbb38;&#xbc95;&#xc744; &#xc120;&#xd638;&#xd55c;&#xb2e4;&#xba74;, &#xc774; &#xae30;&#xb2a5;&#xc744; &#xc0ac;&#xc6a9;&#xd574;&#xb3c4; &#xc88b;&#xb2e4;. &#xc544;&#xb9c8;&#xb3c4; &#xb2e4;&#xc18c; &#xc5d0;&#xb7ec;&#xb97c; &#xc57c;&#xae30;&#xd560; &#xc218;&#xb3c4; &#xc788;&#xb2e4;. &#xac01; &#xb77c;&#xc778;&#xb9c8;&#xb2e4; &#xb05d;&#xc5d0; &#xacf5;&#xbc31;&#xc744;
&#xcd94;&#xac00;&#xd558;&#xb294; &#xac83;&#xc744; &#xc78a;&#xc9c0; &#xb9d0;&#xc544;&#xc57c; &#xd55c;&#xb2e4;. &#xc9c0;&#xae08;&#xbd80;&#xd130; &#xc774; &#xbb38;&#xbc95;&#xc744; &#xc120;&#xd638;&#xd55c;&#xb2e4;&#xba74;, &#xb2e4;&#xc74c; &#xc608;&#xc81c;&#xb294; &#xc790;&#xbc14; &#xbb38;&#xc790;&#xc5f4; &#xcc98;&#xb9ac;&#xbcf4;&#xb2e4; &#xc880;&#xb354; &#xac04;&#xb2e8;&#xd560; &#xac83;&#xc774;&#xb2e4;.</p>
<div class="source"><pre class="prettyprint">private String selectPersonLike(Person p){
  BEGIN(); // Clears ThreadLocal variable
  SELECT(&quot;P.ID, P.USERNAME, P.PASSWORD, P.FIRST_NAME, P.LAST_NAME&quot;);
  FROM(&quot;PERSON P&quot;);
  if (p.id != null) {
  WHERE(&quot;P.ID like #{id}&quot;);
  }
  if (p.firstName != null) {
  WHERE(&quot;P.FIRST_NAME like #{firstName}&quot;);
  }
  if (p.lastName != null) {
  WHERE(&quot;P.LAST_NAME like #{lastName}&quot;);
  }
  ORDER_BY(&quot;P.LAST_NAME&quot;);
  return SQL();
}</pre></div>  
    <p>&#xc774; &#xc608;&#xc81c;&#xc5d0;&#xc11c; &#xb2e4;&#xc18c; &#xd2b9;&#xbcc4;&#xd55c;&#xac74; &#xbb34;&#xc5c7;&#xc778;&#xac00;? &#xc790; &#xc880;&#xb354; &#xc790;&#xc138;&#xd788; &#xbcf4;&#xc790;. &#x201c;AND&#x201d; &#xd0a4;&#xc6cc;&#xb4dc;&#xac00; &#xc911;&#xbcf5;&#xb418;&#xb294; &#xac83;&#xc5d0; &#xb300;&#xd574;&#xc11c;&#xb294; &#xadf8;&#xb2e4;&#xc9c0; &#xac71;&#xc815;&#xd558;&#xc9c0;
&#xc54a;&#xc544;&#xb3c4; &#xb41c;&#xb2e4;. &#x201c;WHERE&#x201d; &#xc640; &#x201c;AND&#x201d; &#xac04;&#xc758; &#xc120;&#xd0dd;&#xd558;&#xb294; &#xac83;&#xb3c4; &#xadf8;&#xb807;&#xb2e4;. &#xc608;&#xb97c; &#xb4e4;&#xc5b4; &#xc704; &#xad6c;&#xbb38;&#xc740; PERSON &#xc758; &#xbaa8;&#xb4e0; &#xb808;&#xcf54;&#xb4dc;&#xb97c; &#xb9ac;&#xd134;&#xd558;&#xb294;
&#xcffc;&#xb9ac;&#xb97c; &#xc0dd;&#xc131;&#xd560; &#xac83;&#xc774;&#xb2e4;. &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb85c; ID &#xb610;&#xb294; firstName, lastName &#xb4f1; 3 &#xac1c;&#xc758; &#xc870;&#xd569;&#xc744; &#xac00;&#xc9c4;&#xb2e4;. SelectBuilder &#xb294; &#x201c;WHEN&#x201d; &#xac00;
&#xc5b4;&#xb514;&#xc11c; &#xd544;&#xc694;&#xd55c;&#xc9c0; &#x201c;AND&#x201d;&#xac00; &#xc5b4;&#xb514;&#xc11c; &#xc0ac;&#xc6a9;&#xb418;&#xb294;&#xc9c0; &#xc774;&#xd574;&#xd558;&#xb294;&#xb370; &#xc8fc;&#xc758;&#xd574;&#xc57c; &#xd55c;&#xb2e4;. &#xbb34;&#xc5c7;&#xbcf4;&#xb2e4;&#xb3c4; &#xc774;&#xb7ec;&#xd55c; &#xba54;&#xc11c;&#xb4dc;&#xc758; &#xd638;&#xcd9c; &#xc21c;&#xc11c;&#xc5d0; &#xc601;&#xd5a5;&#xc744;
&#xbc1b;&#xc9c0; &#xc54a;&#xb294;&#xb2e4;.(&#xb2e8; OR() &#xba54;&#xc11c;&#xb4dc;&#xb294; &#xc608;&#xc678;)</p>
    <p>&#xc544;&#xb9c8;&#xb3c4; &#xb450;&#xac1c;&#xc758; &#xba54;&#xc11c;&#xb4dc;&#xac00; &#xba3c;&#xc800; &#xbcf4;&#xc77c; &#xac83;&#xc774;&#xb2e4;. &#xb450;&#xac1c;&#xc758; &#xba54;&#xc11c;&#xb4dc;&#xb294; BEGIN() &#xacfc; SQL()&#xc774;&#xb2e4;. &#xba3c;&#xc800; SelectBuilder &#xc758; &#xbaa8;&#xb4e0; &#xba54;&#xc11c;&#xb4dc;&#xb294;
BEGIN()&#xc744; &#xd638;&#xcd9c;&#xd574;&#xc11c; &#xc2dc;&#xc791;&#xd558;&#xace0; SQL()&#xc744; &#xd638;&#xcd9c;&#xd574;&#xc11c; &#xb05d;&#xb09c;&#xb2e4;. &#xbb3c;&#xb860; &#xb85c;&#xc9c1; &#xc911;&#xac04;&#xc5d0; &#xc0dd;&#xc131;&#xb420; SQL &#xc744; &#xcd94;&#xcd9c;&#xd558;&#xb294; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd560; &#xc218;&#xb3c4;
&#xc788;&#xc73c;&#xb098; SQL &#xc744; &#xc0dd;&#xc131;&#xd558;&#xb294; &#xb300;&#xbd80;&#xbd84;&#xc758; &#xc0c1;&#xd669;&#xc5d0;&#xc11c;&#xb294; BEGIN()&#xc73c;&#xb85c; &#xc2dc;&#xc791;&#xd558;&#xace0; SQL()&#xb85c; &#xb05d;&#xb09c;&#xb2e4;. BEGIN() &#xba54;&#xc11c;&#xb4dc;&#xb294; ThreadLocal
&#xbcc0;&#xc218;&#xb97c; &#xcd08;&#xae30;&#xd654;&#xd558;&#xace0; SQL()&#xba54;&#xc11c;&#xb4dc;&#xb294; BEGIN() &#xc774;&#xd6c4; &#xd638;&#xcd9c;&#xc5d0; &#xb530;&#xb77c; SQL &#xad6c;&#xbb38;&#xc744; &#xb9cc;&#xb4e0;&#xb2e4;. BEGIN()&#xc740; RESET()&#xacfc; &#xb3d9;&#xc758;&#xc5b4;&#xc774;&#xb2e4;.</p>
    <p>&#xc704; &#xc608;&#xc81c;&#xcc98;&#xb7fc; SelectBuilder &#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xae30; &#xc704;&#xd574;, static import &#xd560; &#xd544;&#xc694;&#xac00; &#xc788;&#xb2e4;.</p>
<div class="source"><pre class="prettyprint">import static org.apache.ibatis.jdbc.SelectBuilder.*;</pre></div>
    <p>&#xd55c;&#xbc88; import &#xd558;&#xace0;&#xb098;&#xba74;, SelectBuilder &#xba54;&#xc11c;&#xb4dc; &#xbaa8;&#xb450; &#xc0ac;&#xc6a9;&#xd560; &#xc218; &#xc788;&#xb2e4;. &#xc2e4;&#xc81c; &#xc0ac;&#xc6a9;&#xac00;&#xb2a5;&#xd55c; &#xbaa8;&#xb4e0; &#xba54;&#xc11c;&#xb4dc;&#xb4e4;&#xc774;&#xb2e4;.</p>
    <table border="0" class="table table-striped">
    <thead>
    <tr class="a"><th><p>&#xbc29;&#xbc95;</p></th><th><p>&#xc124;&#xba85;</p></th></tr></thead>
    <tbody>
  <tr class="b">
    <td>
      <tt>BEGIN()</tt> / <tt>RESET()</tt>
    </td>
    <td>&#xc774; &#xba54;&#xc11c;&#xb4dc;&#xb4e4;&#xc740; SelectBuilder &#xd074;&#xb798;&#xc2a4;&#xc758; ThreadLocal &#xc0c1;&#xd0dc;&#xb97c; &#xcd08;&#xae30;&#xd654;&#xd558;&#xace0; &#xc0c8;&#xb85c;&#xc6b4; &#xad6c;&#xbb38;&#xc744;
&#xcd94;&#xac00;&#xd558;&#xae30; &#xc704;&#xd574; &#xc900;&#xbe44;&#xd55c;&#xb2e4;. BEGIN() &#xba54;&#xc11c;&#xb4dc;&#xb294; &#xc0c8;&#xb85c;&#xc6b4; &#xad6c;&#xbb38;&#xc744; &#xcd94;&#xac00;&#xd560;&#xb54c; &#xd638;&#xcd9c;&#xd558;&#xb294; &#xac83;&#xc774; &#xac00;&#xc7a5;
&#xc88b;&#xb2e4;. RESET() &#xba54;&#xc11c;&#xb4dc;&#xb294; &#xc5b4;&#xb5a0;&#xd55c; &#xc774;&#xc720;&#xb85c; &#xc778;&#xd574; &#xc2e4;&#xd589;&#xc911;&#xac04;&#xc5d0; &#xad6c;&#xbb38;&#xc744; &#xcd08;&#xae30;&#xd654;&#xd560;&#xb54c; &#xd638;&#xcd9c;&#xd558;&#xba74;
&#xb41c;&#xb2e4;.
</td>
  </tr>
  <tr class="a">
    <td>
      <tt>SELECT(String)</tt>
    </td>
    <td>SELECT &#xc808;&#xc744; &#xc2dc;&#xc791;&#xd558;&#xac70;&#xb098; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. &#xd55c;&#xbc88; &#xc774;&#xc0c1; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xace0;,&#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb294; SELECT &#xc808;&#xc5d0;
&#xcd94;&#xac00;&#xb420; &#xac83;&#xc774;&#xb2e4;. &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb4e4;&#xc740; &#xce7c;&#xb7fc;&#xacfc; &#xbcc4;&#xce6d;&#xc758; &#xbaa9;&#xb85d;&#xc774;&#xace0; &#xac01;&#xac01;&#xc758; &#xac12;&#xc740; &#xcf64;&#xb9c8;&#xb85c; &#xad6c;&#xbd84;&#xb41c;&#xb2e4;.</td>
  </tr>
  <tr class="b">
    <td>
      <tt>SELECT_DISTINCT(String)</tt>
    </td>
    <td>SELECT &#xc808;&#xc744; &#xc2dc;&#xc791;&#xd558;&#xac70;&#xb098; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. &#xc0dd;&#xc131;&#xb41c; &#xcffc;&#xb9ac;&#xc5d0; &#x201c;DISTINCT&#x201d;&#xd0a4;&#xc6cc;&#xb4dc; &#xb9cc;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;.
&#xd55c;&#xbc88; &#xc774;&#xc0c1; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xace0;, &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb4e4;&#xc740; SELECT &#xc808;&#xc5d0; &#xcd94;&#xac00;&#xb420; &#xac83;&#xc774;&#xb2e4;. &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb4e4;&#xc740;
&#xce7c;&#xb7fc;&#xacfc; &#xbcc4;&#xce6d;&#xc758; &#xbaa9;&#xb85d;&#xc774;&#xace0; &#xac01;&#xac01;&#xc758; &#xac12;&#xc740; &#xcf64;&#xb9c8;&#xb85c; &#xad6c;&#xbd84;&#xb41c;&#xb2e4;.</td>
  </tr>
  <tr class="a">
    <td>
      <tt>FROM(String)</tt>
    </td>
    <td>FROM &#xc808;&#xc744; &#xc2dc;&#xc791;&#xd558;&#xac70;&#xb098; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. &#xd55c;&#xbc88; &#xc774;&#xc0c1; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xace0;, &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb294; FROM &#xc808;&#xc5d0;
&#xcd94;&#xac00;&#xb420; &#xac83;&#xc774;&#xb2e4;. &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb294; &#xd14c;&#xc774;&#xbe14; &#xba85;&#xacfc; &#xbcc4;&#xce6d;&#xc774;&#xb2e4;.</td>
  </tr>
  <tr class="b">
    <td>
      <ul>
        <li><tt>JOIN(String)</tt></li>
        <li><tt>INNER_JOIN(String)</tt></li>
        <li><tt>LEFT_OUTER_JOIN(String)</tt></li>
        <li><tt>RIGHT_OUTER_JOIN(String)</tt></li>
      </ul>
    </td>
    <td>&#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd560;&#xb54c; &#xc801;&#xc808;&#xd55c; &#xd0c0;&#xc785;&#xc73c;&#xb85c; JOIN &#xc808;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb294; &#xce7c;&#xb7fc;&#xacfc; &#xc870;&#xc778;&#xd558;&#xace0;&#xc790;
&#xd558;&#xb294; &#xc870;&#xac74;&#xc73c;&#xb85c; &#xad6c;&#xc131;&#xb41c; &#xd45c;&#xc900; &#xc870;&#xc778;&#xc744; &#xd3ec;&#xd568;&#xd560; &#xc218; &#xc788;&#xb2e4;.</td>
  </tr>
  <tr class="a">
    <td>
      <tt>WHERE(String)</tt>
    </td>
    <td>WHERE &#xc808;&#xc758; &#xc870;&#xac74;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. AND &#xb97c; &#xc790;&#xb3d9;&#xc73c;&#xb85c; &#xcd94;&#xac00;&#xd558;&#xace0; &#xc5ec;&#xb7ec;&#xbc88; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xb2e4;.
&#xc5ec;&#xb7ec;&#xcc28;&#xb840; AND &#xb85c; &#xc0c8;&#xb85c;&#xc6b4; &#xc870;&#xac74;&#xc744; &#xb9cc;&#xb4e0;&#xb2e4;. OR &#xb85c; &#xbd84;&#xae30;&#xd558;&#xace0;&#xc790; &#xd55c;&#xb2e4;&#xba74; OR()&#xba54;&#xc11c;&#xb4dc;&#xb97c;
&#xc0ac;&#xc6a9;&#xd558;&#xba74; &#xb41c;&#xb2e4;.</td>
  </tr>
  <tr class="b">
    <td>
      <tt>OR()</tt>
    </td>
    <td>WHERE &#xc808;&#xc758; &#xc870;&#xac74;&#xc744; OR &#xb85c; &#xbd84;&#xb9ac;&#xd55c;&#xb2e4;. &#xd55c;&#xbc88; &#xc774;&#xc0c1; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xc73c;&#xb098; &#xc798;&#xbabb; &#xd638;&#xcd9c;&#xd558;&#xba74;
SQL &#xc5d0; &#xc5d0;&#xb7ec;&#xac00; &#xbc1c;&#xc0dd;&#xd560; &#xc218; &#xc788;&#xb2e4;.
</td>
  </tr>
  <tr class="a">
    <td>
      <tt>AND()</tt>
    </td>
    <td>WHERE &#xc808;&#xc758; &#xc870;&#xac74;&#xc744; AND &#xb85c; &#xbd84;&#xb9ac;&#xd55c;&#xb2e4;. &#xd55c;&#xbc88; &#xc774;&#xc0c1; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xc73c;&#xb098; &#xc798;&#xbabb; &#xd638;&#xcd9c;&#xd558;&#xba74;
SQL &#xc5d0; &#xc5d0;&#xb7ec;&#xac00; &#xbc1c;&#xc0dd;&#xd560; &#xc218; &#xc788;&#xb2e4;. WHERE &#xacfc; HAVING &#xbaa8;&#xb450; &#xc870;&#xac74;&#xc5d0; AND &#xb97c; &#xc790;&#xb3d9;&#xc73c;&#xb85c;
&#xbd99;&#xc5ec;&#xc900;&#xb2e4;. &#xd754;&#xd788; &#xc0ac;&#xc6a9;&#xb418;&#xc9c0;&#xb294; &#xc54a;&#xc744; &#xac83;&#xc774;&#xba70;,&#xbc18;&#xb4dc;&#xc2dc; &#xd544;&#xc694;&#xd55c; &#xacbd;&#xc6b0;&#xc5d0; &#xcd94;&#xac00;&#xb85c; &#xc0ac;&#xc6a9;&#xd558;&#xba74; &#xb41c;&#xb2e4;..</td>
  </tr>
  <tr class="b">
    <td>
      <tt>GROUP_BY(String)</tt>
    </td>
    <td>GROUP BY &#xc808;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. &#xcf64;&#xb9c8;&#xb97c; &#xc790;&#xb3d9;&#xc73c;&#xb85c; &#xcd94;&#xac00;&#xd558;&#xace0; &#xc5ec;&#xb7ec;&#xcc28;&#xb840; &#xd638;&#xcd9c;&#xb420;&#xc218; &#xc788;&#xb2e4;. &#xb9e4;&#xbc88;
&#xcf64;&#xb9c8;&#xb97c; &#xcd94;&#xac00;&#xd574;&#xc11c; &#xc0c8;&#xb85c;&#xc6b4; &#xc870;&#xac74;&#xc744; &#xb9cc;&#xb4e0;&#xb2e4;.</td>
  </tr>
  <tr class="a">
    <td>
      <tt>HAVING(String)</tt>
    </td>
    <td>HAVING &#xc808;&#xc758; &#xc870;&#xac74;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. AND &#xb97c; &#xc790;&#xb3d9;&#xc73c;&#xb85c; &#xcd94;&#xac00;&#xd558;&#xace0; &#xc5ec;&#xb7ec;&#xcc28;&#xb840; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xb2e4;.
&#xb9e4;&#xbc88; AND &#xb97c; &#xcd94;&#xac00;&#xd574;&#xc11c; &#xc0c8;&#xb85c;&#xc6b4; &#xc870;&#xac74;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. OR &#xb85c; &#xbd84;&#xae30;&#xd558;&#xace0;&#xc790; &#xd55c;&#xb2e4;&#xba74;
OR()&#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xba74; &#xb41c;&#xb2e4;.</td>
  </tr>
  <tr class="b">
    <td>
      <tt>ORDER_BY(String)</tt>
    </td>
    <td>ORDER BY &#xc808;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;. &#xcf64;&#xb9c8;&#xb97c; &#xc790;&#xb3d9;&#xc73c;&#xb85c; &#xcd94;&#xac00;&#xd558;&#xace0; &#xc5ec;&#xb7ec;&#xcc28;&#xb840; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xb2e4;. &#xb9e4;&#xbc88;
&#xcf64;&#xb9c8;&#xb97c; &#xcd94;&#xac00;&#xd574;&#xc11c; &#xc0c8;&#xb85c;&#xc6b4; &#xc870;&#xac74;&#xc744; &#xb9cc;&#xb4e0;&#xb2e4;.</td>
  </tr>
  <tr class="a">
    <td>
      <tt>SQL()</tt>
    </td>
    <td>&#xc0dd;&#xc131;&#xb418;&#xb294; SQL &#xc744; &#xb9ac;&#xd134;&#xd558;&#xace0; SelectBuilder &#xc0c1;&#xd0dc;&#xb97c; &#xb9ac;&#xc14b;(BEGIN()&#xc774;&#xb098; RESET()&#xac00; &#xd638;&#xcd9c;&#xb41c;
&#xac83;&#xcc98;&#xb7fc;)&#xd55c;&#xb2e4;. &#xac8c;&#xb2e4;&#xac00; &#xc774; &#xba54;&#xc11c;&#xb4dc;&#xb294; &#xd55c;&#xbc88;&#xb9cc; &#xd638;&#xcd9c;&#xb420; &#xc218; &#xc788;&#xb2e4;.</td>
  </tr>
    </tbody></table>
    </div>

    <div class="section"><h3>SqlBuilder<a name="SqlBuilder"></a></h3>
    <p>SelectBuilder &#xc640; &#xc720;&#xc0ac;&#xd558;&#xac8c;, MyBatis &#xb294; &#xc77c;&#xbc18;&#xc801;&#xc778; SqlBuilder &#xb97c; &#xac00;&#xc9c0;&#xace0; &#xc788;&#xb2e4;. SelectBuilder &#xac00; &#xac00;&#xc9c4; &#xbaa8;&#xb4e0; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd3ec;&#xd568;&#xd560;
&#xbfd0; &#xc544;&#xb2c8;&#xb77c;, insert, update &#xadf8;&#xb9ac;&#xace0; delete &#xb97c; &#xb9cc;&#xb4dc;&#xb294; &#xba54;&#xc11c;&#xb4dc;&#xb3c4; &#xac00;&#xc9c0;&#xace0; &#xc788;&#xb2e4;. &#xc774; &#xd074;&#xb798;&#xc2a4;&#xb294; SelectProvider , DeleteProvider,
InsertProvider, &#xb610;&#xb294; UpdateProvider &#xc5d0;&#xc11c; SQL &#xbb38;&#xc790;&#xc5f4;&#xc744; &#xb9cc;&#xb4e4; &#xb54c; &#xc720;&#xc6a9;&#xd558;&#xb2e4;.
&#xc704; &#xc608;&#xc81c;&#xc5d0;&#xc11c; SqlBuilder &#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xae30; &#xc704;&#xd574;, &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; static &#xc73c;&#xb85c; import &#xd560; &#xd544;&#xc694;&#xac00;</p>
    <p>&#xc704; &#xc608;&#xc81c;&#xc5d0;&#xc11c; SqlBuilder &#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xae30; &#xc704;&#xd574;, &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; static &#xc73c;&#xb85c; import &#xd560; &#xd544;&#xc694;&#xac00; &#xc788;&#xb2e4;.</p>
    <div class="source"><pre class="prettyprint">import static org.apache.ibatis.jdbc.SqlBuilder.*;</pre></div>
    <p>SqlBuilder &#xb294; SelectBuilder &#xc758; &#xbaa8;&#xb4e0; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xac00;&#xc9c0;&#xace0; &#xc788;&#xc73c;&#xba70; &#xba87;&#xac00;&#xc9c0; &#xcd94;&#xac00;&#xb85c; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xb354; &#xac00;&#xc9c0;&#xace0; &#xc788;&#xb2e4;.</p>
      <table border="0" class="table table-striped">
      <thead>
      <tr class="a"><th>&#xbc29;&#xbc95;</th><th>&#xc124;&#xba85;</th></tr>
      </thead>
      <tbody>
      <tr class="b">
  <td>
    <tt>DELETE_FROM(String)</tt>
  </td>
  <td>delete &#xad6c;&#xbb38;&#xc744; &#xc2dc;&#xc791;&#xd558;&#xace0; &#xc2e4;&#xc81c; &#xc0ad;&#xc81c;&#xd558;&#xace0;&#xc790; &#xd558;&#xb294; &#xd14c;&#xc774;&#xbe14;&#xc744; &#xba85;&#xc2dc;&#xd55c;&#xb2e4;. &#xb300;&#xac1c;&#xb294; WHERE
&#xad6c;&#xbb38;&#xc774; &#xb4a4;&#xc5d0; &#xbd99;&#xb294;&#xb2e4;.</td>
</tr>
  <tr class="a">
    <td>
      <tt>INSERT_INTO(String)</tt>
    </td>
    <td>insert &#xad6c;&#xbb38;&#xc744; &#xc2dc;&#xc791;&#xd558;&#xace0; &#xc2e4;&#xc81c; &#xc785;&#xb825;&#xd558;&#xace0;&#xc790; &#xd558;&#xb294; &#xd14c;&#xc774;&#xbe14;&#xc744; &#xba85;&#xc2dc;&#xd55c;&#xb2e4;. &#xb300;&#xac1c;&#xb294; &#xd558;&#xb098; &#xc774;&#xc0c1;&#xc758;
VALUES() &#xd638;&#xcd9c;&#xc744; &#xb4a4;&#xb530;&#xb978;&#xb2e4;.</td>
  </tr>
  <tr class="b">
    <td>
      <tt>SET(String)</tt>
    </td>
    <td>update &#xad6c;&#xbb38;&#xc5d0;&#xc11c; &#x201c;set&#x201d; &#xc5d0; &#xad00;&#xb828;&#xb41c; &#xbaa9;&#xb85d;&#xc744; &#xcd94;&#xac00;&#xd55c;&#xb2e4;.</td>
  </tr>
  <tr class="a">
    <td>
      <tt>UPDATE(String)</tt>
    </td>
    <td>update &#xad6c;&#xbb38;&#xc744; &#xc2dc;&#xc791;&#xd558;&#xace0; &#xc2e4;&#xc81c; &#xc218;&#xc815;&#xd558;&#xace0;&#xc790; &#xd558;&#xb294; &#xd14c;&#xc774;&#xbe14;&#xc744; &#xba85;&#xc2dc;&#xd55c;&#xb2e4;. &#xd558;&#xb098; &#xc774;&#xc0c1;&#xc758; SET()
&#xd638;&#xcd9c;&#xc774; &#xb6f0;&#xb530;&#xb974;&#xace0; &#xb300;&#xac1c;&#xb294; WHERE() &#xd638;&#xcd9c;&#xb3c4; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;.</td>
  </tr>
  <tr class="b">
    <td>
      <tt>VALUES(String, String)</tt>
    </td>
    <td>insert &#xad6c;&#xbb38;&#xc5d0; &#xcd94;&#xac00;&#xb41c;&#xb2e4;. &#xccab;&#xbc88;&#xc9f8; &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb294; &#xce7c;&#xb7fc;(column(s))&#xc774;&#xace0; &#xb450;&#xbc88;&#xc9f8; &#xd30c;&#xb77c;&#xbbf8;&#xd130;&#xb294;
&#xac12;(value(s))&#xc774;&#xb2e4;.</td>
  </tr>
      </tbody>
    </table>

    <p>&#xc774;&#xac74; &#xba87;&#xac00;&#xc9c0; &#xc608;&#xc81c;&#xc774;&#xb2e4;.</p>

<div class="source"><pre class="prettyprint">public String deletePersonSql() {
  BEGIN(); // Clears ThreadLocal variable
  DELETE_FROM(&quot;PERSON&quot;);
  WHERE(&quot;ID = ${id}&quot;);
  return SQL();
}

public String insertPersonSql() {
  BEGIN(); // Clears ThreadLocal variable
  INSERT_INTO(&quot;PERSON&quot;);
  VALUES(&quot;ID, FIRST_NAME&quot;, &quot;${id}, ${firstName}&quot;);
  VALUES(&quot;LAST_NAME&quot;, &quot;${lastName}&quot;);
  return SQL();
}

public String updatePersonSql() {
  BEGIN(); // Clears ThreadLocal variable
  UPDATE(&quot;PERSON&quot;);
  SET(&quot;FIRST_NAME = ${firstName}&quot;);
  WHERE(&quot;ID = ${id}&quot;);
  return SQL();
}</pre></div>  
  </div>
  </div>
  


                  </div>
            </div>
          </div>

    <hr/>

    <footer>
            <div class="container-fluid">
              <div class="row span12">Copyright &copy;                    2010-2013
                        <a href="http://www.mybatis.org/">MyBatis.org</a>.
            All Rights Reserved.      
                    
      </div>

        
        
                </div>
    </footer>
  </body>
</html>
