<!DOCTYPE html>


<!--
 | Generated by Apache Maven Doxia Site Renderer 2.0.0-M19 from src/site/ja/markdown/getting-started.md at 27 11月 2024
 | Rendered using Apache Maven Fluido Skin 2.0.0-M9
-->
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="generator" content="Apache Maven Doxia Site Renderer 2.0.0-M19" />
    <meta name="author" content="Clinton Begin, Iwao AVE!" />
    <title>MyBatis 3 | スタートガイド – mybatis</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-2.0.0-M9.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
    <script src="./js/apache-maven-fluido-2.0.0-M9.min.js"></script>
  </head>
  <body>
    <div class="container-fluid container-fluid-top">
      <header>
        <div id="banner">
          <div class="pull-left"></div>
          <div class="pull-right"><div id="bannerRight"><h1><a href="https://blog.mybatis.org/" class="externalLink"><img class="imageLink" src="../../images/mybatis-logo.png" alt="MyBatis logo" /> MyBatis</a></h1></div></div>
          <div class="clear"><hr/></div>
        </div>

        <div id="breadcrumbs">
          <ul class="breadcrumb">
        <li id="publishDate">最終更新: 26 11月 2024<span class="divider">|</span>
</li>
          <li id="projectVersion">バージョン: 3.5.17</li>
          </ul>
        </div>
      </header>
      <div class="row-fluid">
        <header id="leftColumn" class="span2">
          <nav class="well sidebar-nav">
  <ul class="nav nav-list">
   <li class="nav-header">Core</li>
    <li><a href="index.html">イントロダクション</a></li>
    <li class="active"><a>スタートガイド</a></li>
    <li><a href="configuration.html"><span class="icon-chevron-right"></span>設定</a></li>
    <li><a href="sqlmap-xml.html"><span class="icon-chevron-right"></span>Mapper XML ファイル</a></li>
    <li><a href="dynamic-sql.html">動的 SQL</a></li>
    <li><a href="java-api.html"><span class="icon-chevron-right"></span>Java API</a></li>
    <li><a href="statement-builders.html"><span class="icon-chevron-right"></span>ステートメントビルダー</a></li>
    <li><a href="logging.html">ロギング</a></li>
   <li class="nav-header">プロジェクト文書</li>
    <li><a href="project-info.html"><span class="icon-chevron-right"></span>プロジェクト情報</a></li>
    <li><a href="project-reports.html"><span class="icon-chevron-right"></span>プロジェクトレポート</a></li>
  </ul>
          </nav>
          <div class="well sidebar-nav">
            <div id="poweredBy">
              <div class="clear"></div>
              <div class="clear"></div>
<a href="https://maven.apache.org/" class="builtBy" target="_blank"><img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" /></a>
            </div>
          </div>
        </header>
        <main id="bodyColumn" class="span10">
<section><a id="a.E3.82.B9.E3.82.BF.E3.83.BC.E3.83.88.E3.82.AC.E3.82.A4.E3.83.89"></a>
<h1>&#x30b9;&#x30bf;&#x30fc;&#x30c8;&#x30ac;&#x30a4;&#x30c9;</h1><section><a id="Installation"></a>
<h2>Installation</h2>
<p>MyBatis &#x3092;&#x4f7f;&#x3046;&#x305f;&#x3081;&#x306b;&#x306f;&#x3001;&#x30c0;&#x30a6;&#x30f3;&#x30ed;&#x30fc;&#x30c9;&#x3057;&#x305f; <a href="https://github.com/mybatis/mybatis-3/releases" class="externalLink">mybatis-x.x.x.jar</a> &#x3092;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x306b;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;</p>
<p>Maven &#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x306f; pom.xml &#x306b;&#x4e0b;&#x8a18;&#x306e;&#x4f9d;&#x5b58;&#x6027;&#x3092;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x3060;&#x3051;&#x3067; OK &#x3067;&#x3059;&#x3002;</p>

<pre><code class="language-xml">&lt;dependency&gt;
  &lt;groupId&gt;org.mybatis&lt;/groupId&gt;
  &lt;artifactId&gt;mybatis&lt;/artifactId&gt;
  &lt;version&gt;x.x.x&lt;/version&gt;
&lt;/dependency&gt;
</code></pre></section><section><a id="XML_.E5.BD.A2.E5.BC.8F.E3.81.AE.E8.A8.AD.E5.AE.9A.E3.83.95.E3.82.A1.E3.82.A4.E3.83.AB.E3.82.92.E4.BD.BF.E3.81.A3.E3.81.A6_SqlSessionFactory_.E3.82.92.E7.94.9F.E6.88.90.E3.81.99.E3.82.8B"></a>
<h2>XML &#x5f62;&#x5f0f;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x4f7f;&#x3063;&#x3066; SqlSessionFactory &#x3092;&#x751f;&#x6210;&#x3059;&#x308b;</h2>
<p>MyBatis &#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306f;&#x3001;SqlSessionFactory &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x4e2d;&#x5fc3;&#x306b;&#x69cb;&#x6210;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;<br />
SqlSessionFactory &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x306f;&#x3001;SqlSessionFactoryBuilder &#x3092;&#x4f7f;&#x3063;&#x3066;&#x53d6;&#x5f97;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002; SqlSessionFactoryBuilder &#x304c; SqlSessionFactory &#x3092;&#x751f;&#x6210;&#x3059;&#x308b;&#x969b;&#x306e;&#x8a2d;&#x5b9a;&#x306f;&#x3001;XML &#x5f62;&#x5f0f;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x304b;&#x3001;&#x72ec;&#x81ea;&#x306b;&#x7528;&#x610f;&#x3057;&#x305f; Configuration &#x30af;&#x30e9;&#x30b9;&#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x6e21;&#x3059;&#x3053;&#x3068;&#x3067;&#x884c;&#x3044;&#x307e;&#x3059;&#x3002;</p>
<p>XML &#x5f62;&#x5f0f;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x4f7f;&#x3063;&#x3066; SqlSessionFactory &#x3092;&#x751f;&#x6210;&#x3059;&#x308b;&#x306e;&#x306f;&#x3068;&#x3066;&#x3082;&#x7c21;&#x5358;&#x3067;&#x3059;&#x3002;<br />
&#x3053;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306f;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x306b;&#x7f6e;&#x304f;&#x3053;&#x3068;&#x304c;&#x63a8;&#x5968;&#x3055;&#x308c;&#x307e;&#x3059;&#x304c;&#x3001;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x30d1;&#x30b9;&#x3084; <code>file://</code> &#x5f62;&#x5f0f;&#x306e; URL &#x6587;&#x5b57;&#x5217;&#x304b;&#x3089;&#x751f;&#x6210;&#x3057;&#x305f; InputStream &#x3092;&#x4f7f;&#x3063;&#x3066;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x4ee5;&#x5916;&#x306e;&#x5834;&#x6240;&#x306b;&#x914d;&#x7f6e;&#x3055;&#x308c;&#x305f;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002; MyBatis &#x4ed8;&#x5c5e;&#x306e; Resources &#x3068;&#x3044;&#x3046;&#x30e6;&#x30fc;&#x30c6;&#x30a3;&#x30ea;&#x30c6;&#x30a3;&#x30af;&#x30e9;&#x30b9;&#x306b;&#x306f;&#x3001;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x3084;&#x3001;&#x305d;&#x308c;&#x4ee5;&#x5916;&#x306e;&#x5834;&#x6240;&#x304b;&#x3089;&#x30ea;&#x30bd;&#x30fc;&#x30b9;&#x3092;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x305f;&#x3081;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x591a;&#x6570;&#x7528;&#x610f;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>

<pre><code class="language-java">String resource = &quot;org/mybatis/example/mybatis-config.xml&quot;;
InputStream inputStream = Resources.getResourceAsStream(resource);
SqlSessionFactory sqlSessionFactory = new SqlSessionFactoryBuilder().build(inputStream);
</code></pre>
<p>XML &#x5f62;&#x5f0f;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306b;&#x306f;&#x3001;MyBatis &#x30b7;&#x30b9;&#x30c6;&#x30e0;&#x306e;&#x57fa;&#x672c;&#x8a2d;&#x5b9a;&#x304c;&#x542b;&#x307e;&#x308c;&#x307e;&#x3059;&#x3002; &#x4f8b;&#x3048;&#x3070;&#x3001;&#x30c7;&#x30fc;&#x30bf;&#x30d9;&#x30fc;&#x30b9;&#x304b;&#x3089; Connection &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b; DataSource &#x3084;&#x3001;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x5236;&#x5fa1;&#x65b9;&#x6cd5;&#x3092;&#x6c7a;&#x5b9a;&#x3059;&#x308b; TransactionManager &#x306a;&#x3069;&#x3067;&#x3059;&#x3002;<br />
XML &#x5f62;&#x5f0f;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306e;&#x8a73;&#x7d30;&#x306b;&#x3064;&#x3044;&#x3066;&#x306f;&#x5f8c;&#x307b;&#x3069;&#x6539;&#x3081;&#x3066;&#x8aac;&#x660e;&#x3057;&#x307e;&#x3059;&#x304c;&#x3001;&#x3053;&#x3053;&#x3067;&#x306f;&#x7c21;&#x5358;&#x306a;&#x30b5;&#x30f3;&#x30d7;&#x30eb;&#x3092;&#x6319;&#x3052;&#x3066;&#x304a;&#x304d;&#x307e;&#x3059;&#x3002;</p>

<pre><code class="language-xml">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;
&lt;!DOCTYPE configuration
  PUBLIC &quot;-//mybatis.org//DTD Config 3.0//EN&quot;
  &quot;https://mybatis.org/dtd/mybatis-3-config.dtd&quot;&gt;
&lt;configuration&gt;
  &lt;environments default=&quot;development&quot;&gt;
    &lt;environment id=&quot;development&quot;&gt;
      &lt;transactionManager type=&quot;JDBC&quot;/&gt;
      &lt;dataSource type=&quot;POOLED&quot;&gt;
        &lt;property name=&quot;driver&quot; value=&quot;${driver}&quot;/&gt;
        &lt;property name=&quot;url&quot; value=&quot;${url}&quot;/&gt;
        &lt;property name=&quot;username&quot; value=&quot;${username}&quot;/&gt;
        &lt;property name=&quot;password&quot; value=&quot;${password}&quot;/&gt;
      &lt;/dataSource&gt;
    &lt;/environment&gt;
  &lt;/environments&gt;
  &lt;mappers&gt;
    &lt;mapper resource=&quot;org/mybatis/example/BlogMapper.xml&quot;/&gt;
  &lt;/mappers&gt;
&lt;/configuration&gt;
</code></pre>
<p>XML &#x5f62;&#x5f0f;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306b;&#x3064;&#x3044;&#x3066;&#x8aac;&#x660e;&#x3059;&#x3079;&#x304d;&#x3053;&#x3068;&#x306f;&#x4ed6;&#x306b;&#x3082;&#x305f;&#x304f;&#x3055;&#x3093;&#x3042;&#x308a;&#x307e;&#x3059;&#x304c;&#x3001;&#x6700;&#x3082;&#x91cd;&#x8981;&#x306a;&#x8a2d;&#x5b9a;&#x306f;&#x4e0a;&#x8a18;&#x306e;&#x30b5;&#x30f3;&#x30d7;&#x30eb;&#x306b;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;<br />
&#x307e;&#x305a;&#x3001;XML &#x30c9;&#x30ad;&#x30e5;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x30d0;&#x30ea;&#x30c7;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x884c;&#x3046;&#x305f;&#x3081;&#x306b;&#x5fc5;&#x8981;&#x3068;&#x306a;&#x308b; XML &#x30d8;&#x30c3;&#x30c0;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;<br />
environment &#x8981;&#x7d20;&#x306b;&#x306f;&#x3001;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x7ba1;&#x7406;&#x3084;&#x30b3;&#x30cd;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x30d7;&#x30fc;&#x30ea;&#x30f3;&#x30b0;&#x3068;&#x3044;&#x3063;&#x305f;&#x74b0;&#x5883;&#x4f9d;&#x5b58;&#x306e;&#x8a2d;&#x5b9a;&#x304c;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;<br />
mappers &#x8981;&#x7d20;&#x306b;&#x306f; Mapper &#x306e;&#x30ea;&#x30b9;&#x30c8;&#x304c;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;Mapper &#x3068;&#x306f;&#x3001;SQL &#x6587;&#x3068;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x306e;&#x5b9a;&#x7fa9;&#x3092;&#x542b;&#x3080; XML &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3067;&#x3059;&#x3002;</p></section><section><a id="XML_.E3.82.92.E4.BD.BF.E3.82.8F.E3.81.9A.E3.81.AB_SqlSessionFactory_.E3.82.92.E7.94.9F.E6.88.90.E3.81.99.E3.82.8B"></a>
<h2>XML &#x3092;&#x4f7f;&#x308f;&#x305a;&#x306b; SqlSessionFactory &#x3092;&#x751f;&#x6210;&#x3059;&#x308b;</h2>
<p>XML &#x3092;&#x4f7f;&#x308f;&#x305a; Java &#x306e;&#x30b3;&#x30fc;&#x30c9;&#x3067;&#x8a2d;&#x5b9a;&#x3092;&#x884c;&#x3044;&#x305f;&#x3044;&#x65b9;&#x306e;&#x305f;&#x3081;&#x306b;&#x3001;Configuraiton &#x30af;&#x30e9;&#x30b9;&#x304c;&#x63d0;&#x4f9b;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;<br />
XML &#x5f62;&#x5f0f;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3067;&#x6307;&#x5b9a;&#x3067;&#x304d;&#x308b;&#x30aa;&#x30d7;&#x30b7;&#x30e7;&#x30f3;&#x306f;&#x3001;&#x3053;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x3067;&#x3082;&#x5168;&#x3066;&#x8a2d;&#x5b9a;&#x53ef;&#x80fd;&#x3067;&#x3059;&#x3002;</p>

<pre><code class="language-java">DataSource dataSource = BlogDataSourceFactory.getBlogDataSource();
TransactionFactory transactionFactory = new JdbcTransactionFactory();
Environment environment = new Environment(&quot;development&quot;, transactionFactory, dataSource);
Configuration configuration = new Configuration(environment);
configuration.addMapper(BlogMapper.class);
SqlSessionFactory sqlSessionFactory = new SqlSessionFactoryBuilder().build(configuration);
</code></pre>
<p>&#x4eca;&#x56de;&#x306f;&#x3001;Configuration &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x306b; Mapper &#x30af;&#x30e9;&#x30b9;&#x3092;&#x8ffd;&#x52a0;&#x3057;&#x3066;&#x3044;&#x308b;&#x3053;&#x3068;&#x306b;&#x6c17;&#x3065;&#x3044;&#x305f;&#x3067;&#x3057;&#x3087;&#x3046;&#x304b;&#x3002;<br />
Mapper &#x30af;&#x30e9;&#x30b9;&#x306b;&#x306f;&#x3001;XML &#x3092;&#x4f7f;&#x308f;&#x305a;&#x306b; SQL &#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3092;&#x5b9a;&#x7fa9;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002; &#x305f;&#x3060;&#x3057;&#x3001;Java &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x5236;&#x7d04;&#x3068; MyBatis &#x306e;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x6a5f;&#x80fd;&#x306e;&#x8907;&#x96d1;&#x3055;&#x306e;&#x305f;&#x3081;&#x3001;&#x9ad8;&#x5ea6;&#x306a;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3092;&#x5b9a;&#x7fa9;&#x3059;&#x308b;&#x969b;&#x306b; XML &#x5f62;&#x5f0f;&#x306e; Mapper &#x304c;&#x5fc5;&#x8981;&#x3068;&#x306a;&#x308b;&#x5834;&#x5408;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#xff08;&#x30cd;&#x30b9;&#x30c8;&#x3055;&#x308c;&#x305f;&#x7d50;&#x5408;&#x30af;&#x30a8;&#x30ea;&#x306e;&#x7d50;&#x679c;&#x3092;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3059;&#x308b;&#x5834;&#x5408;&#x306a;&#x3069;&#xff09;&#x3002;<br />
&#x3053;&#x306e;&#x305f;&#x3081;&#x3001;MyBatis &#x306f;&#x5bfe;&#x306b;&#x306a;&#x308b; XML &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x63a2;&#x3057;&#x3066;&#x81ea;&#x52d5;&#x7684;&#x306b;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x3088;&#x3046;&#x306b;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3059;&#xff08;&#x3053;&#x306e;&#x4f8b;&#x3067;&#x306f;&#x3001;BlogMapper.class &#x306e;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x3068;&#x540d;&#x524d;&#x3092;&#x5143;&#x306b; BlogMapper.xml &#x3068;&#x3044;&#x3046; XML &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x304c;&#x8aad;&#x307f;&#x8fbc;&#x307e;&#x308c;&#x307e;&#x3059;&#xff09;&#x3002; &#x3053;&#x306e;&#x52d5;&#x4f5c;&#x306b;&#x3064;&#x3044;&#x3066;&#x306f;&#x3001;&#x5f8c;&#x307b;&#x3069;&#x8a73;&#x3057;&#x304f;&#x8aac;&#x660e;&#x3057;&#x307e;&#x3059;&#x3002;</p></section><section><a id="SqlSessionFactory_.E3.81.8B.E3.82.89_SqlSession_.E3.82.92.E5.8F.96.E5.BE.97.E3.81.99.E3.82.8B"></a>
<h2>SqlSessionFactory &#x304b;&#x3089; SqlSession &#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;</h2>
<p>&#x540d;&#x524d;&#x3092;&#x898b;&#x308c;&#x3070;&#x5206;&#x304b;&#x308b;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x304c;&#x3001;&#x751f;&#x6210;&#x3057;&#x305f; SqlSessionFactory &#x304b;&#x3089; SqlSession &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;<br />
SqlSession &#x306b;&#x306f;&#x3001;&#x4e00;&#x9023;&#x306e; SQL &#x30b3;&#x30de;&#x30f3;&#x30c9;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x5168;&#x3066;&#x7528;&#x610f;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002; SqlSession &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x306b;&#x5bfe;&#x3057;&#x3066;&#x3001;&#x30de;&#x30c3;&#x30d7;&#x3055;&#x308c;&#x305f; SQL &#x6587;&#x3092;&#x76f4;&#x63a5;&#x6307;&#x5b9a;&#x3057;&#x3066;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;<br />
&#x4f8b;&#x3048;&#x3070;&#x4e0b;&#x8a18;&#x306e;&#x3088;&#x3046;&#x306a;&#x30b3;&#x30fc;&#x30c9;&#x306b;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;</p>

<pre><code class="language-java">try (SqlSession session = sqlSessionFactory.openSession()) {
  Blog blog = (Blog) session.selectOne(&quot;org.mybatis.example.BlogMapper.selectBlog&quot;, 101);
}
</code></pre>
<p>&#x3053;&#x306e;&#x65b9;&#x6cd5;&#x306f;&#x671f;&#x5f85;&#x901a;&#x308a;&#x306b;&#x52d5;&#x4f5c;&#x3057;&#x307e;&#x3059;&#x3057;&#x3001;&#x65e7;&#x30d0;&#x30fc;&#x30b8;&#x30e7;&#x30f3;&#x306e; MyBatis &#x306b;&#x6163;&#x308c;&#x3066;&#x3044;&#x308b;&#x65b9;&#x306b;&#x306f;&#x5206;&#x304b;&#x308a;&#x3084;&#x3059;&#x3044;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x304c;&#x3001; &#x73fe;&#x5728;&#x306e;&#x30d0;&#x30fc;&#x30b8;&#x30e7;&#x30f3;&#x3067;&#x306f;&#x3082;&#x3063;&#x3068;&#x7f8e;&#x3057;&#x3044;&#x65b9;&#x6cd5;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002; &#x5b9f;&#x884c;&#x3059;&#x308b; SQL &#x6587;&#x306b;&#x30de;&#x30c3;&#x30c1;&#x3059;&#x308b;&#x3088;&#x3046;&#x306b;&#x5f15;&#x6570;&#x3068;&#x623b;&#x308a;&#x5024;&#x304c;&#x304d;&#x3061;&#x3093;&#x3068;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x305f;&#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3092;&#x4f7f;&#x3048;&#x3070;&#x3001;&#x30df;&#x30b9;&#x3057;&#x304c;&#x3061;&#x306a;&#x6587;&#x5b57;&#x5217;&#x3084;&#x30ad;&#x30e3;&#x30b9;&#x30c8;&#x306a;&#x3057;&#x3067;&#x3001;&#x3088;&#x308a;&#x7f8e;&#x3057;&#x304f;&#x3001;&#x578b;&#x306b;&#x5b89;&#x5168;&#x306a;&#x30b3;&#x30fc;&#x30c9;&#x3092;&#x4f7f;&#x3063;&#x3066; SQL &#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>
<p>&#x4f8b;&#xff1a;</p>

<pre><code class="language-java">try (SqlSession session = sqlSessionFactory.openSession()) {
  BlogMapper mapper = session.getMapper(BlogMapper.class);
  Blog blog = mapper.selectBlog(101);
}
</code></pre>
<p>&#x3067;&#x306f;&#x3001;&#x5b9f;&#x969b;&#x306b;&#x3069;&#x306e;&#x3088;&#x3046;&#x306a;&#x51e6;&#x7406;&#x304c;&#x884c;&#x308f;&#x308c;&#x3066;&#x3044;&#x308b;&#x306e;&#x304b;&#x3092;&#x898b;&#x3066;&#x884c;&#x304d;&#x307e;&#x3057;&#x3087;&#x3046;&#x3002;</p></section><section><a id="Mapped_SQL_Statements_.E3.81.AB.E3.81.A4.E3.81.84.E3.81.A6"></a>
<h2>Mapped SQL Statements &#x306b;&#x3064;&#x3044;&#x3066;</h2>
<p>SqlSession &#x3084; Mapper &#x30af;&#x30e9;&#x30b9;&#x306b;&#x3088;&#x3063;&#x3066;&#x4f55;&#x304c;&#x884c;&#x308f;&#x308c;&#x3066;&#x3044;&#x308b;&#x306e;&#x304b;&#x3001;&#x305d;&#x308d;&#x305d;&#x308d;&#x6c17;&#x306b;&#x306a;&#x308a;&#x51fa;&#x3057;&#x305f;&#x9803;&#x3067;&#x306f;&#x306a;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x304b;&#x3002; Mapped SQL Statements &#x306f;&#x975e;&#x5e38;&#x306b;&#x5927;&#x304d;&#x306a;&#x8a71;&#x984c;&#x3067;&#x3001;&#x3053;&#x306e;&#x30c9;&#x30ad;&#x30e5;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5927;&#x90e8;&#x5206;&#x3092;&#x5360;&#x3081;&#x308b;&#x3053;&#x3068;&#x306b;&#x306a;&#x308b;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x304c;&#x3001; &#x3053;&#x3053;&#x3067;&#x306f;&#x3044;&#x304f;&#x3064;&#x304b;&#x4f8b;&#x3092;&#x6319;&#x3052;&#x3066;&#x3001;&#x5b9f;&#x969b;&#x306b;&#x3069;&#x306e;&#x3088;&#x3046;&#x306a;&#x51e6;&#x7406;&#x304c;&#x884c;&#x308f;&#x308c;&#x3066;&#x3044;&#x308b;&#x306e;&#x304b;&#x3092;&#x7c21;&#x5358;&#x306b;&#x8aac;&#x660e;&#x3057;&#x3066;&#x307f;&#x305f;&#x3044;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x3002;</p>
<p>&#x4e0a;&#x3067;&#x6319;&#x3052;&#x305f;&#xff12;&#x3064;&#x306e;&#x30b5;&#x30f3;&#x30d7;&#x30eb;&#x306b;&#x5bfe;&#x5fdc;&#x3059;&#x308b; SQL Statement &#x306f;&#x3001;XML&#x3001;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x3069;&#x3061;&#x3089;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x3082;&#x5b9a;&#x7fa9;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;<br />
&#x306f;&#x3058;&#x3081;&#x306b; XML &#x306b;&#x3064;&#x3044;&#x3066;&#x898b;&#x3066;&#x884c;&#x304d;&#x307e;&#x3057;&#x3087;&#x3046;&#x3002; &#x4f55;&#x5e74;&#x306b;&#x3082;&#x6e21;&#x3063;&#x3066; MyBatis &#x306e;&#x4eba;&#x6c17;&#x3092;&#x7bc9;&#x3044;&#x3066;&#x304d;&#x305f; XML &#x30d9;&#x30fc;&#x30b9;&#x306e;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x8a00;&#x8a9e;&#x3092;&#x4f7f;&#x3048;&#x3070;&#x3001;MyBatis &#x306e;&#x5168;&#x6a5f;&#x80fd;&#x3092;&#x628a;&#x63e1;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002; &#x3053;&#x306e;&#x30c9;&#x30ad;&#x30e5;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5f8c;&#x306e;&#x65b9;&#x3067;&#x51fa;&#x3066;&#x304d;&#x307e;&#x3059;&#x304c;&#x3001;&#x65e7;&#x30d0;&#x30fc;&#x30b8;&#x30e7;&#x30f3;&#x306e; MyBatis &#x3092;&#x4f7f;&#x3063;&#x305f;&#x3053;&#x3068;&#x304c;&#x3042;&#x308b;&#x65b9;&#x306a;&#x3089;&#x3001;&#x30b3;&#x30f3;&#x30bb;&#x30d7;&#x30c8;&#x306f;&#x540c;&#x3058;&#x3067;&#x3059;&#x304c;&#x3001;&#x591a;&#x304f;&#x306e;&#x6539;&#x826f;&#x304c;&#x52a0;&#x3048;&#x3089;&#x308c;&#x3066;&#x3044;&#x308b;&#x3053;&#x3068;&#x304c;&#x5206;&#x304b;&#x308b;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x3002; &#x4ee5;&#x4e0b;&#x306f;&#x3001;&#x5148;&#x307b;&#x3069;&#x306e;&#x4f8b;&#x3067; SqlSession &#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3057;&#x305f;&#x3068;&#x304d;&#x306b;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x308b;&#x3053;&#x3068;&#x3092;&#x60f3;&#x5b9a;&#x3057;&#x305f; XML &#x30d9;&#x30fc;&#x30b9;&#x306e; Mapped Statement &#x3067;&#x3059;&#x3002;</p>

<pre><code class="language-xml">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;
&lt;!DOCTYPE mapper
  PUBLIC &quot;-//mybatis.org//DTD Mapper 3.0//EN&quot;
  &quot;https://mybatis.org/dtd/mybatis-3-mapper.dtd&quot;&gt;
&lt;mapper namespace=&quot;org.mybatis.example.BlogMapper&quot;&gt;
  &lt;select id=&quot;selectBlog&quot; resultType=&quot;Blog&quot;&gt;
    select * from Blog where id = #{id}
  &lt;/select&gt;
&lt;/mapper&gt;
</code></pre>
<p>&#x4f8b;&#x304c;&#x7c21;&#x5358;&#x306a;&#x306e;&#x3067;&#x7121;&#x99c4;&#x306b;&#x8a18;&#x8ff0;&#x91cf;&#x304c;&#x591a;&#x3044;&#x3088;&#x3046;&#x306b;&#x898b;&#x3048;&#x308b;&#x304b;&#x3082;&#x77e5;&#x308c;&#x307e;&#x305b;&#x3093;&#x304c;&#x3001;&#x672c;&#x8cea;&#x7684;&#x306b;&#x306f;&#x305d;&#x308c;&#x307b;&#x3069;&#x3067;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002;<br />
&#x3072;&#x3068;&#x3064;&#x306e; Mapper XML &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306b;&#x8907;&#x6570;&#x306e; Mapped Statement &#x3092;&#x5b9a;&#x7fa9;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x308b;&#x306e;&#x3067;&#x3001;XML &#x30d8;&#x30c3;&#x30c0;&#x3084; doctype &#x5ba3;&#x8a00;&#x306f;&#x4e00;&#x5ea6;&#x66f8;&#x304f;&#x3060;&#x3051;&#x3067;&#x3059;&#x3002;<br />
&#x6b8b;&#x308a;&#x306e;&#x90e8;&#x5206;&#x306f;&#x307b;&#x307c;&#x81ea;&#x660e;&#x3067;&#x3059;&#x304c;&#x3001;&#x300c;org.mybatis.example.BlogMapper&#x300d;&#x3068;&#x3044;&#x3046;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x306e;&#x4e2d;&#x306b;&#x300c;selectBlog&#x300d;&#x3068;&#x3044;&#x3046;&#x540d;&#x524d;&#x306e; Mapped Statement &#x3092;&#x5b9a;&#x7fa9;&#x3057;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;<br />
&#x4e0a;&#x306e;&#x30b5;&#x30f3;&#x30d7;&#x30eb;&#x3068;&#x540c;&#x3058;&#x3067;&#x3059;&#x304c;&#x3001;&#x3053;&#x306e; Mapped Statement &#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x306b;&#x306f;&#x3001;&#x4ee5;&#x4e0b;&#x306e;&#x3088;&#x3046;&#x306b;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x300c;org.mybatis.example.BlogMapper.selectBlog&#x300d;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x3066; SqlSession &#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3057;&#x307e;&#x3059;&#x3002;</p>

<pre><code class="language-java">Blog blog = session.selectOne(&quot;org.mybatis.example.BlogMapper.selectBlog&quot;, 101);
</code></pre>
<p>&#x3053;&#x306e;&#x4f8b;&#x304c;&#x3001;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3067;&#x6307;&#x5b9a;&#x3057;&#x305f; Java &#x30af;&#x30e9;&#x30b9;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3059;&#x306e;&#x3068;&#x4f3c;&#x3066;&#x3044;&#x308b;&#x3053;&#x3068;&#x306b;&#x6c17;&#x3065;&#x3044;&#x305f;&#x3067;&#x3057;&#x3087;&#x3046;&#x304b;&#x3002; &#x3053;&#x308c;&#x306b;&#x306f;&#x7406;&#x7531;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002; &#x3053;&#x306e;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x306f;&#x3001;Mapped Statement &#x306e;&#x540d;&#x524d;&#x3001;&#x5f15;&#x6570;&#x3001;&#x623b;&#x308a;&#x5024;&#x306b;&#x30de;&#x30c3;&#x30c1;&#x3059;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x6301;&#x3063;&#x305f;&#x3001;&#x540c;&#x540d;&#x306e; Mapper &#x30af;&#x30e9;&#x30b9;&#x306b;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002; &#x4e0a;&#x3067;&#x898b;&#x305f;&#x3088;&#x3046;&#x306a; Mapper &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3078;&#x306e;&#x7c21;&#x5358;&#x306a;&#x547c;&#x3073;&#x51fa;&#x3057;&#x304c;&#x3067;&#x304d;&#x308b;&#x306e;&#x306f;&#x3053;&#x306e;&#x4ed5;&#x7d44;&#x307f;&#x306e;&#x304a;&#x304b;&#x3052;&#x3067;&#x3059;&#x3002; &#x518d;&#x63b2;&#x3057;&#x3066;&#x304a;&#x304d;&#x307e;&#x3059;&#x3002;</p>

<pre><code class="language-java">BlogMapper mapper = session.getMapper(BlogMapper.class);
Blog blog = mapper.selectBlog(101);
</code></pre>
<p>&#xff12;&#x756a;&#x76ee;&#x306e;&#x65b9;&#x6cd5;&#x306b;&#x306f;&#x591a;&#x304f;&#x306e;&#x5229;&#x70b9;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;<br />
&#x307e;&#x305a;&#x3001;&#x6587;&#x5b57;&#x5217;&#x30ea;&#x30c6;&#x30e9;&#x30eb;&#x306b;&#x983c;&#x3089;&#x305a;&#x306b;&#x6e08;&#x3080;&#x306e;&#x3067;&#x3001;&#x305a;&#x3063;&#x3068;&#x5b89;&#x5168;&#x3067;&#x3059;&#x3002;&#x307e;&#x305f;&#x3001;Mapped SQL Statement &#x3092;&#x9078;&#x3076;&#x3068;&#x304d;&#x306b; IDE &#x306e;&#x30b3;&#x30fc;&#x30c9;&#x88dc;&#x5b8c;&#x6a5f;&#x80fd;&#x3092;&#x4f7f;&#x3046;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p><hr />
<p><span class="label important">NOTE</span> <strong>&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x306b;&#x3064;&#x3044;&#x3066;</strong></p>
<p><strong>&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#xff1a;</strong> &#x904e;&#x53bb;&#x306e;&#x30d0;&#x30fc;&#x30b8;&#x30e7;&#x30f3;&#x306e; MyBatis &#x3067;&#x306f;&#x3001;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x306f;&#x30aa;&#x30d7;&#x30b7;&#x30e7;&#x30f3;&#x3067;&#x3057;&#x305f;&#x304c;&#x3001;&#x3053;&#x308c;&#x306f;&#x6df7;&#x4e71;&#x3084;&#x8aa4;&#x7528;&#x306e;&#x539f;&#x56e0;&#x3068;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3057;&#x305f;&#x3002;<br />
&#x73fe;&#x5728;&#x306e;&#x30d0;&#x30fc;&#x30b8;&#x30e7;&#x30f3;&#x3067;&#x306f;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x306f;&#x5fc5;&#x9808;&#x3067;&#x3042;&#x308a;&#x3001;&#x5358;&#x306b;&#x9577;&#x3044;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3092;&#x4f7f;&#x3063;&#x3066; Statement &#x3092;&#x6574;&#x7406;&#x3059;&#x308b;&#x4ee5;&#x4e0a;&#x306b;&#x91cd;&#x8981;&#x306a;&#x5f79;&#x5272;&#x3092;&#x679c;&#x305f;&#x3057;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
<p>&#x4e0a;&#x3067;&#x898b;&#x305f;&#x3088;&#x3046;&#x306b;&#x3001;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x306f;&#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x30d0;&#x30a4;&#x30f3;&#x30c7;&#x30a3;&#x30f3;&#x30b0;&#x3092;&#x884c;&#x3046;&#x305f;&#x3081;&#x306b;&#x4f7f;&#x308f;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002; &#x305f;&#x3068;&#x3048;&#x4eca;&#x306f;&#x5fc5;&#x8981;&#x306a;&#x3044;&#x3068;&#x601d;&#x3063;&#x3066;&#x3082;&#x3001;&#x5c06;&#x6765;&#x6c17;&#x304c;&#x5909;&#x308f;&#x3063;&#x305f;&#x3068;&#x304d;&#x306e;&#x305f;&#x3081;&#x306b;&#x63a8;&#x5968;&#x3055;&#x308c;&#x308b;&#x624b;&#x9806;&#x901a;&#x308a;&#x306b;&#x8a2d;&#x5b9a;&#x3057;&#x3066;&#x304a;&#x304f;&#x3079;&#x304d;&#x3067;&#x3059;&#x3002; &#x9577;&#x3044;&#x76ee;&#x3067;&#x898b;&#x308c;&#x3070;&#x3001;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x3066;&#x6b63;&#x3057;&#x3044; Java &#x30d1;&#x30c3;&#x30b1;&#x30fc;&#x30b8;&#x306b;&#x914d;&#x7f6e;&#x3057;&#x3066;&#x304a;&#x304f;&#x3053;&#x3068;&#x3067;&#x30af;&#x30ea;&#x30fc;&#x30f3;&#x306a;&#x30b3;&#x30fc;&#x30c9;&#x3092;&#x66f8;&#x304f;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x3001;MyBatis &#x306e;&#x4f7f;&#x3044;&#x52dd;&#x624b;&#x3082;&#x5411;&#x4e0a;&#x3059;&#x308b;&#x306f;&#x305a;&#x3067;&#x3059;&#x3002;</p>
<p><strong>&#x540d;&#x524d;&#x89e3;&#x6c7a;&#xff1a;</strong> &#x30bf;&#x30a4;&#x30d4;&#x30f3;&#x30b0;&#x91cf;&#x3092;&#x6e1b;&#x3089;&#x3059;&#x305f;&#x3081;&#x3001;MyBatis &#x306f;&#x6b21;&#x306e;&#x3088;&#x3046;&#x306a;&#x30eb;&#x30fc;&#x30eb;&#x306b;&#x5247;&#x3063;&#x3066;&#x8a2d;&#x5b9a;&#x8981;&#x7d20;&#xff08;Statement, Result Map, Cache &#x306a;&#x3069;&#xff09;&#x306e;&#x540d;&#x524d;&#x89e3;&#x6c7a;&#x3092;&#x884c;&#x3044;&#x307e;&#x3059;&#x3002;</p>
<ul>

<li>&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#xff08;&#x4f8b;&#x3048;&#x3070;&#x300c;com.mypackage.MyMapper.selectAllThings&#x300d;&#xff09;&#x3067;&#x6307;&#x5b9a;&#x3057;&#x305f;&#x5834;&#x5408;&#x306f;&#x3001;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3067;&#x8981;&#x7d20;&#x3092;&#x63a2;&#x3057;&#x3001;&#x3082;&#x3057;&#x898b;&#x3064;&#x304b;&#x308c;&#x3070;&#x305d;&#x306e;&#x8981;&#x7d20;&#x3092;&#x53c2;&#x7167;&#x3057;&#x307e;&#x3059;&#x3002;</li>
<li>&#x77ed;&#x7e2e;&#x540d;&#xff08;&#x4f8b;&#x3048;&#x3070;&#x300c;selectAllThings&#x300d;&#xff09;&#x3067;&#x6307;&#x5b9a;&#x3057;&#x305f;&#x5834;&#x5408;&#x306f;&#x3001;&#x77ed;&#x7e2e;&#x540d;&#x90e8;&#x5206;&#x304c;&#x4e00;&#x81f4;&#x3059;&#x308b;&#x8981;&#x7d20;&#x3092;&#x53c2;&#x7167;&#x3057;&#x307e;&#x3059;&#x3002; &#x305f;&#x3060;&#x3057;&#x3001;&#x540c;&#x3058;&#x77ed;&#x7e2e;&#x540d;&#x3092;&#x6301;&#x3063;&#x305f;&#x8981;&#x7d20;&#x304c;&#xff12;&#x3064;&#x4ee5;&#x4e0a;&#x5b58;&#x5728;&#x3059;&#x308b;&#x5834;&#x5408;&#xff08;&#x4f8b;&#x3048;&#x3070;&#x300c;com.foo.selectAllThings&#x300d;&#x3068;&#x300c;com.bar.selectAllThings&#x300d;&#xff09;&#x306f;&#x3001; &#x6307;&#x5b9a;&#x3057;&#x305f;&#x77ed;&#x7e2e;&#x540d;&#x304c;&#x66d6;&#x6627;&#x306a;&#x306e;&#x3067;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3067;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308b;&#x3001;&#x3068;&#x3044;&#x3046;&#x30a8;&#x30e9;&#x30fc;&#x304c;&#x767a;&#x751f;&#x3057;&#x307e;&#x3059;&#x3002;</li>
</ul><hr />
<p>BloggerMapper &#x306e;&#x3088;&#x3046;&#x306a; Mapper &#x30af;&#x30e9;&#x30b9;&#x306a;&#x3089;&#x3001;&#x5b9f;&#x306f; XML &#x3092;&#x4f7f;&#x3046;&#x5fc5;&#x8981;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002; &#x4ee3;&#x308f;&#x308a;&#x306b;&#x3001;Java &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x4e0b;&#x8a18;&#x306e;&#x3088;&#x3046;&#x306b; Mapped Statement &#x3092;&#x8a18;&#x8ff0;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>

<pre><code class="language-java">package org.mybatis.example;
public interface BlogMapper {
  @Select(&quot;SELECT * FROM blog WHERE id = #{id}&quot;)
  Blog selectBlog(int id);
}
</code></pre>
<p>&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3046;&#x3068;&#x5358;&#x7d14;&#x306a; SQL &#x6587;&#x3092;&#x30b9;&#x30c3;&#x30ad;&#x30ea;&#x66f8;&#x304f;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x304c;&#x3001;&#x8907;&#x96d1;&#x306a; SQL &#x6587;&#x3092;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x66f8;&#x3053;&#x3046;&#x3068;&#x3059;&#x308b;&#x3068;&#x53ef;&#x8aad;&#x6027;&#x304c;&#x843d;&#x3061;&#x307e;&#x3059;&#x3057;&#x3001;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x56fa;&#x6709;&#x306e;&#x5236;&#x9650;&#x3082;&#x3042;&#x308a;&#x307e;&#x3059;&#x306e;&#x3067;&#x3001;&#x8907;&#x96d1;&#x306a; Mapped Statement &#x3092;&#x6271;&#x308f;&#x306a;&#x304f;&#x3066;&#x306f;&#x306a;&#x3089;&#x306a;&#x3044;&#x5834;&#x5408;&#x306b;&#x306f; XML &#x3092;&#x4f7f;&#x3046;&#x3053;&#x3068;&#x3092;&#x304a;&#x52e7;&#x3081;&#x3057;&#x307e;&#x3059;&#x3002;</p>
<p>XML &#x3068;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x3069;&#x3061;&#x3089;&#x3092;&#x4f7f;&#x3046;&#x3079;&#x304d;&#x304b;&#x3001;&#x305d;&#x3057;&#x3066;&#x3069;&#x306e;&#x3088;&#x3046;&#x306b;&#x4e00;&#x8cab;&#x6027;&#x3092;&#x6301;&#x305f;&#x305b;&#x308b;&#x304b;&#x306f;&#x3001;&#x3042;&#x306a;&#x305f;&#x3068;&#x3042;&#x306a;&#x305f;&#x306e;&#x30d7;&#x30ed;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x30c1;&#x30fc;&#x30e0;&#x6b21;&#x7b2c;&#x3067;&#x3059;&#x3002; &#x305f;&#x3060;&#x3001;&#x5e38;&#x306b;&#x3069;&#x3061;&#x3089;&#x304b;&#x4e00;&#x65b9;&#x3092;&#x4f7f;&#x308f;&#x306a;&#x304f;&#x3066;&#x306f;&#x306a;&#x3089;&#x306a;&#x3044;&#x3001;&#x3068;&#x3044;&#x3046;&#x8a33;&#x3067;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002; &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x30d9;&#x30fc;&#x30b9;&#x306e; Mapped Statement &#x3092; XML &#x306b;&#x66f8;&#x304d;&#x63db;&#x3048;&#x308b;&#x3053;&#x3068;&#x306f;&#x7c21;&#x5358;&#x306a;&#x3053;&#x3068;&#x3067;&#x3059;&#x3057;&#x3001;&#x9006;&#x3082;&#x307e;&#x305f;&#x3057;&#x304b;&#x308a;&#x3067;&#x3059;&#x3002;</p></section><section><a id="a.E3.82.B9.E3.82.B3.E3.83.BC.E3.83.97.E3.81.A8.E3.83.A9.E3.82.A4.E3.83.95.E3.82.B5.E3.82.A4.E3.82.AF.E3.83.AB"></a>
<h2>&#x30b9;&#x30b3;&#x30fc;&#x30d7;&#x3068;&#x30e9;&#x30a4;&#x30d5;&#x30b5;&#x30a4;&#x30af;&#x30eb;</h2>
<p>&#x3053;&#x308c;&#x307e;&#x3067;&#x306b;&#x8aac;&#x660e;&#x3057;&#x305f;&#x69d8;&#x3005;&#x306a;&#x30af;&#x30e9;&#x30b9;&#x306b;&#x9069;&#x3057;&#x305f;&#x30b9;&#x30b3;&#x30fc;&#x30d7;&#x3084;&#x3001;&#x305d;&#x306e;&#x30e9;&#x30a4;&#x30d5;&#x30b5;&#x30a4;&#x30af;&#x30eb;&#x306b;&#x3064;&#x3044;&#x3066;&#x7406;&#x89e3;&#x3057;&#x3066;&#x304a;&#x304f;&#x3053;&#x3068;&#x306f;&#x5927;&#x5909;&#x91cd;&#x8981;&#x3067;&#x3059;&#x3002; &#x8aa4;&#x3063;&#x3066;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x3068;&#x3001;&#x6df1;&#x523b;&#x306a;&#x6574;&#x5408;&#x6027;&#x306e;&#x554f;&#x984c;&#x306e;&#x539f;&#x56e0;&#x3068;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;</p><hr />
<p><span class="label important">NOTE</span> <strong>&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x30e9;&#x30a4;&#x30d5;&#x30b5;&#x30a4;&#x30af;&#x30eb;&#x3068;&#x4f9d;&#x5b58;&#x6027;&#x6ce8;&#x5165;&#xff08;Dependency Injection&#xff09;&#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;</strong></p>
<p>Dependency Injection &#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;&#x3092;&#x4f7f;&#x3046;&#x3068;&#x3001;&#x30b9;&#x30ec;&#x30c3;&#x30c9;&#x30bb;&#x30fc;&#x30d5;&#x3067;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x7ba1;&#x7406;&#x3055;&#x308c;&#x305f; SqlSession &#x3084; Mapper &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x4f5c;&#x6210;&#x3057;&#x3001;&#x3042;&#x306a;&#x305f;&#x306e; Bean &#x306b;&#x30a4;&#x30f3;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x3059;&#x308b;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002; &#x3053;&#x3046;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;&#x3001;SqlSession &#x3084; Mapper &#x306e;&#x30e9;&#x30a4;&#x30d5;&#x30b5;&#x30a4;&#x30af;&#x30eb;&#x306b;&#x3064;&#x3044;&#x3066;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x30ed;&#x30b8;&#x30c3;&#x30af;&#x3068;&#x5206;&#x96e2;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002; MyBatis &#x3068; DI &#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;&#x306e;&#x7d44;&#x307f;&#x5408;&#x308f;&#x305b;&#x306b;&#x3064;&#x3044;&#x3066;&#x306f;&#x3001;&#x30b5;&#x30d6;&#x30d7;&#x30ed;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x3067;&#x3042;&#x308b; MyBatis-Spring &#x307e;&#x305f;&#x306f; MyBatis-Guice &#x3092;&#x53c2;&#x7167;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;</p><hr /><section>
        </main>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>©      2009–2024
<a href="https://www.mybatis.org/">MyBatis.org</a>
</p>
        </div>
      </div>
    </footer>
<script>
  if(anchors) {
    anchors.add();
  }
</script>
  </body>
</html>
