<!DOCTYPE html>


<!--
 | Generated by Apache Maven Doxia Site Renderer 2.0.0-M19 from src/site/ja/xdoc/java-api.xml at 27 11月 2024
 | Rendered using Apache Maven Fluido Skin 2.0.0-M9
-->
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="generator" content="Apache Maven Doxia Site Renderer 2.0.0-M19" />
    <meta name="author" content="Clinton Begin" />
    <meta name="author" content="Iwao AVE!" />
    <title>MyBatis 3 | Java API – mybatis</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-2.0.0-M9.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
    <script src="./js/apache-maven-fluido-2.0.0-M9.min.js"></script>
  </head>
  <body>
    <div class="container-fluid container-fluid-top">
      <header>
        <div id="banner">
          <div class="pull-left"></div>
          <div class="pull-right"><div id="bannerRight"><h1><a href="https://blog.mybatis.org/" class="externalLink"><img class="imageLink" src="../../images/mybatis-logo.png" alt="MyBatis logo" /> MyBatis</a></h1></div></div>
          <div class="clear"><hr/></div>
        </div>

        <div id="breadcrumbs">
          <ul class="breadcrumb">
        <li id="publishDate">最終更新: 26 11月 2024<span class="divider">|</span>
</li>
          <li id="projectVersion">バージョン: 3.5.17</li>
          </ul>
        </div>
      </header>
      <div class="row-fluid">
        <header id="leftColumn" class="span2">
          <nav class="well sidebar-nav">
  <ul class="nav nav-list">
   <li class="nav-header">Core</li>
    <li><a href="index.html">イントロダクション</a></li>
    <li><a href="getting-started.html">スタートガイド</a></li>
    <li><a href="configuration.html"><span class="icon-chevron-right"></span>設定</a></li>
    <li><a href="sqlmap-xml.html"><span class="icon-chevron-right"></span>Mapper XML ファイル</a></li>
    <li><a href="dynamic-sql.html">動的 SQL</a></li>
    <li class="active"><a><span class="icon-chevron-down"></span>Java API</a>
     <ul class="nav nav-list">
      <li><a href="java-api.html#directoryStructure">ディレクトリ構造</a></li>
      <li><a href="java-api.html#sqlSessions">SqlSessions</a></li>
     </ul></li>
    <li><a href="statement-builders.html"><span class="icon-chevron-right"></span>ステートメントビルダー</a></li>
    <li><a href="logging.html">ロギング</a></li>
   <li class="nav-header">プロジェクト文書</li>
    <li><a href="project-info.html"><span class="icon-chevron-right"></span>プロジェクト情報</a></li>
    <li><a href="project-reports.html"><span class="icon-chevron-right"></span>プロジェクトレポート</a></li>
  </ul>
          </nav>
          <div class="well sidebar-nav">
            <div id="poweredBy">
              <div class="clear"></div>
              <div class="clear"></div>
<a href="https://maven.apache.org/" class="builtBy" target="_blank"><img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" /></a>
            </div>
          </div>
        </header>
        <main id="bodyColumn" class="span10">


  
  <a id="javaApi"></a><section id="javaApi"><a id="Java_API"></a>
<h1>Java API</h1>
  
<p>&#x524d;&#x7ae0;&#x307e;&#x3067;&#x3067;&#x3001;&#x8a2d;&#x5b9a;&#x65b9;&#x6cd5;&#x3068; SQL &#x30de;&#x30c3;&#x30d7;&#x306e;&#x66f8;&#x304d;&#x65b9;&#x306f;&#x5b66;&#x3073;&#x307e;&#x3057;&#x305f;&#x3002;MyBatis Java API &#x306f;&#x3001;&#x4eca;&#x307e;&#x3067;&#x306e;&#x52aa;&#x529b;&#x304c;&#x5b9f;&#x3092;&#x7d50;&#x3076;&#x3068;&#x3053;&#x308d;&#x3067;&#x3059;&#x3002;&#x3053;&#x306e;&#x7ae0;&#x3092;&#x8aad;&#x3081;&#x3070;&#x3001;JDBC &#x3068;&#x6bd4;&#x3079;&#x308b;&#x3068;&#x3001;MyBatis &#x306b;&#x3088;&#x3063;&#x3066;&#x30b3;&#x30fc;&#x30c9;&#x304c;&#x5927;&#x5e45;&#x306b;&#x5358;&#x7d14;&#x5316;&#x3055;&#x308c;&#x3001;&#x30af;&#x30ea;&#x30fc;&#x30f3;&#x3067;&#x7406;&#x89e3;&#x3057;&#x3084;&#x3059;&#x304f;&#x30e1;&#x30f3;&#x30c6;&#x30ca;&#x30f3;&#x30b9;&#x3082;&#x5bb9;&#x6613;&#x306a;&#x72b6;&#x614b;&#x3092;&#x4fdd;&#x3064;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x308b;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x304c;&#x5206;&#x304b;&#x308b;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x3002;</p>

  <a id="directoryStructure"></a><section id="directoryStructure"><a id="a.E3.83.87.E3.82.A3.E3.83.AC.E3.82.AF.E3.83.88.E3.83.AA.E6.A7.8B.E9.80.A0"></a>
<h2>&#x30c7;&#x30a3;&#x30ec;&#x30af;&#x30c8;&#x30ea;&#x69cb;&#x9020;</h2>
  
<p>Java API &#x306e;&#x8aac;&#x660e;&#x306b;&#x5165;&#x308b;&#x524d;&#x306b;&#x3001;&#x30c7;&#x30a3;&#x30ec;&#x30af;&#x30c8;&#x30ea;&#x69cb;&#x9020;&#x306b;&#x95a2;&#x3059;&#x308b;&#x30d9;&#x30b9;&#x30c8;&#x30d7;&#x30e9;&#x30af;&#x30c6;&#x30a3;&#x30b9;&#x3092;&#x7406;&#x89e3;&#x3057;&#x3066;&#x304a;&#x304f;&#x3053;&#x3068;&#x304c;&#x91cd;&#x8981;&#x3067;&#x3059;&#x3002;MyBatis &#x306f;&#x67d4;&#x8edf;&#x3067;&#x3001;&#x57fa;&#x672c;&#x7684;&#x306b;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306f;&#x597d;&#x304d;&#x306a;&#x5834;&#x6240;&#x306b;&#x914d;&#x7f6e;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x304c;&#x3001;&#x591a;&#x304f;&#x306e;&#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;&#x3068;&#x540c;&#x69d8;&#x306b;&#x63a8;&#x5968;&#x3055;&#x308c;&#x308b;&#x69cb;&#x6210;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;</p>
  
<p>&#x5178;&#x578b;&#x7684;&#x306a;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30c7;&#x30a3;&#x30ec;&#x30af;&#x30c8;&#x30ea;&#x69cb;&#x9020;&#x3092;&#x898b;&#x3066;&#x307f;&#x307e;&#x3057;&#x3087;&#x3046;&#x3002;</p>
  
<pre>/my_application
  /bin
  /devlib
  <strong>/lib                <code>&lt;-- MyBatis *.jar &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306f;&#x3053;&#x3053;&#x306b;&#x914d;&#x7f6e;&#x3057;&#x307e;&#x3059;&#x3002;</code></strong>
  /src
    /org/myapp/
      /action
      <strong>/data           <code>&lt;-- MyBatis &#x95a2;&#x9023;&#x306e;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#xff08;Mapper &#x30af;&#x30e9;&#x30b9;&#x3001;XML &#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3001;XML &#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#xff09;&#x306f;&#x3053;&#x3053;&#x306b;&#x914d;&#x7f6e;&#x3057;&#x307e;&#x3059;&#x3002;</code></strong>
        /mybatis-config.xml
        /BlogMapper.java
        /BlogMapper.xml
      /model
      /service
      /view
    <strong>/properties       <code>&lt;-- &#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3067;&#x8aad;&#x307f;&#x8fbc;&#x3080; properties &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306f;&#x3053;&#x3053;&#x306b;&#x914d;&#x7f6e;&#x3057;&#x307e;&#x3059;&#x3002;</code></strong>
  /test
    /org/myapp/
      /action
      /data
      /model
      /service
      /view
    /properties
  /web
    /WEB-INF
      /web.xml</pre>
  
<p>&#x3053;&#x308c;&#x306f;&#x63a8;&#x5968;&#x3055;&#x308c;&#x308b;&#x30c7;&#x30a3;&#x30ec;&#x30af;&#x30c8;&#x30ea;&#x69cb;&#x9020;&#x3067;&#x3042;&#x3063;&#x3066;&#x5fc5;&#x9808;&#x3067;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x304c;&#x3001;&#x4e00;&#x822c;&#x7684;&#x306a;&#x30c7;&#x30a3;&#x30ec;&#x30af;&#x30c8;&#x30ea;&#x69cb;&#x9020;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x304a;&#x3051;&#x3070;&#x4ed6;&#x306e;&#x958b;&#x767a;&#x8005;&#x304b;&#x3089;&#x306f;&#x611f;&#x8b1d;&#x3055;&#x308c;&#x308b;&#x306f;&#x305a;&#x3067;&#x3059;&#x3002;</p>
  
<p>&#x5c1a;&#x3001;&#x3053;&#x306e;&#x7ae0;&#x306e;&#x30b5;&#x30f3;&#x30d7;&#x30eb;&#x3067;&#x306f;&#x3001;&#x4e0a;&#x8a18;&#x306e;&#x30c7;&#x30a3;&#x30ec;&#x30af;&#x30c8;&#x30ea;&#x69cb;&#x9020;&#x3092;&#x524d;&#x63d0;&#x306b;&#x3057;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  </section>

  <a id="sqlSessions"></a><section id="sqlSessions"><a id="SqlSessions"></a>
<h2>SqlSessions</h2>
  
<p>MyBatis &#x306e;&#x6700;&#x3082;&#x826f;&#x304f;&#x4f7f;&#x3046; Java &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x306f; SqlSession &#x3067;&#x3059;&#x3002;&#x30b3;&#x30de;&#x30f3;&#x30c9;&#x306e;&#x5b9f;&#x884c;&#x3001;Mapper &#x306e;&#x53d6;&#x5f97;&#x3001;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x7ba1;&#x7406;&#x306f;&#x3053;&#x306e;&#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3092;&#x901a;&#x3057;&#x3066;&#x884c;&#x3046;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;SqlSession &#x306b;&#x3064;&#x3044;&#x3066;&#x306f;&#x3001;&#x5f8c;&#x3067;&#x8a73;&#x3057;&#x304f;&#x8aac;&#x660e;&#x3057;&#x307e;&#x3059;&#x304c;&#x3001;&#x305d;&#x306e;&#x524d;&#x306b; SqlSession &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;&#x65b9;&#x6cd5;&#x306b;&#x3064;&#x3044;&#x3066;&#x5b66;&#x3070;&#x306a;&#x304f;&#x3066;&#x306f;&#x306a;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002;SqlSession &#x306f; SqlSessionFactory &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x306b;&#x3088;&#x3063;&#x3066;&#x4f5c;&#x6210;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;SqlSessionFactory &#x306b;&#x306f;&#x3001;&#x69d8;&#x3005;&#x306a;&#x65b9;&#x6cd5;&#x3067; SqlSession &#x3092;&#x4f5c;&#x6210;&#x3059;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;SqlSessionFactory &#x81ea;&#x8eab;&#x306f; SqlSessionFactoryBuilder &#x306b;&#x3088;&#x3063;&#x3066;&#x4f5c;&#x3089;&#x308c;&#x307e;&#x3059;&#x304c;&#x3001;&#x4f5c;&#x6210;&#x3055;&#x308c;&#x308b; SqlSessionFactory &#x306f; XML&#x3001;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3001;&#x30cf;&#x30fc;&#x30c9;&#x30b3;&#x30fc;&#x30c9;&#x3055;&#x308c;&#x305f; Java &#x30b3;&#x30f3;&#x30d5;&#x30a3;&#x30b0;&#x30ec;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x3044;&#x305a;&#x308c;&#x304b;&#x306e;&#x65b9;&#x6cd5;&#x3067;&#x8a2d;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>
  
<p><span class="label important">NOTE</span> MyBatis &#x3092; Spring &#x3084; Guice &#x3068;&#x3044;&#x3063;&#x305f;&#x4f9d;&#x5b58;&#x6027;&#x6ce8;&#x5165;&#xff08;DI = Dependency Injection&#xff09;&#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;&#x3068;&#x7d44;&#x307f;&#x5408;&#x308f;&#x305b;&#x3066;&#x4f7f;&#x3046;&#x5834;&#x5408;&#x3001;SqlSession &#x306f; DI &#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;&#x306b;&#x3088;&#x3063;&#x3066;&#x4f5c;&#x6210;&#x30fb;&#x6ce8;&#x5165;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;SqlSessionFactoryBuilder &#x3084; SqlSessionFactory &#x3092;&#x4f7f;&#x3046;&#x5fc5;&#x8981;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x306e;&#x3067;&#x3001;SqlSession &#x306e;&#x7ae0;&#x307e;&#x3067;&#x98db;&#x3070;&#x3057;&#x3066;&#x69cb;&#x3044;&#x307e;&#x305b;&#x3093;&#x3002;DI&#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;&#x3068;&#x306e;&#x7d44;&#x307f;&#x5408;&#x308f;&#x305b;&#x306b;&#x3064;&#x3044;&#x3066;&#x306f; MyBatis-Spring &#x304a;&#x3088;&#x3073; MyBatis-Guice &#x306e;&#x30de;&#x30cb;&#x30e5;&#x30a2;&#x30eb;&#x3092;&#x53c2;&#x7167;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;</p>
  <section><a id="SqlSessionFactoryBuilder"></a><section><a id="SqlSessionFactoryBuilder"></a>
<h4>SqlSessionFactoryBuilder</h4>
  
<p>SqlSessionFactoryBuilder &#x306b;&#x306f;&#xff15;&#x3064;&#x306e; build() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x3042;&#x308a;&#x3001;&#x305d;&#x308c;&#x305e;&#x308c;&#x7570;&#x306a;&#x308b;&#x30bd;&#x30fc;&#x30b9;&#x304b;&#x3089; SqlSessionFactory &#x3092;&#x30d3;&#x30eb;&#x30c9;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x306b;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>SqlSessionFactory build(InputStream inputStream)
SqlSessionFactory build(InputStream inputStream, String environment)
SqlSessionFactory build(InputStream inputStream, Properties properties)
SqlSessionFactory build(InputStream inputStream, String env, Properties props)
SqlSessionFactory build(Configuration config)</code></pre>

  
<p>
&#x826f;&#x304f;&#x4f7f;&#x3046;&#x306e;&#x306f;&#x3001;InputStream &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x5f15;&#x6570;&#x306b;&#x53d6;&#x3063;&#x3066; XML &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#xff08;&#x5177;&#x4f53;&#x7684;&#x306b;&#x306f; mybatis-config.xml &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#xff09;&#x3092;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x6700;&#x521d;&#x306e;&#xff14;&#x3064;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3067;&#x3059;&#x3002;&#x30aa;&#x30d7;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x5f15;&#x6570;&#x306f; environment &#x3068; properties &#x3067;&#x3059;&#x3002;environment &#x306f;&#x3001;&#x30c7;&#x30fc;&#x30bf;&#x30bd;&#x30fc;&#x30b9;&#x3084;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x30de;&#x30cd;&#x30fc;&#x30b8;&#x30e3;&#x30fc;&#x3082;&#x542b;&#x3081;&#x3066;&#x3001;&#x3069;&#x306e; environment &#x3092;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x304b;&#x3092;&#x6c7a;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;&#x4f8b;&#xff1a;</p>

  
<pre class="prettyprint"><code>&lt;environments default=&quot;development&quot;&gt;
  &lt;environment id=&quot;development&quot;&gt;
    &lt;transactionManager type=&quot;JDBC&quot;&gt;
        ...
    &lt;dataSource type=&quot;POOLED&quot;&gt;
        ...
  &lt;/environment&gt;
  &lt;environment id=&quot;production&quot;&gt;
    &lt;transactionManager type=&quot;MANAGED&quot;&gt;
        ...
    &lt;dataSource type=&quot;JNDI&quot;&gt;
        ...
  &lt;/environment&gt;
&lt;/environments&gt;</code></pre>
  
<p>&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066; environment &#x3092;&#x53d6;&#x308b; build &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3057;&#x305f;&#x5834;&#x5408;&#x3001;MyBatis &#x306f;&#x305d;&#x306e; environment &#x306e;&#x8a2d;&#x5b9a;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x30d3;&#x30eb;&#x30c9;&#x3092;&#x5b9f;&#x884c;&#x3057;&#x307e;&#x3059;&#x3002;&#x672a;&#x5b9a;&#x7fa9;&#x306e; environment &#x3092;&#x6307;&#x5b9a;&#x3057;&#x305f;&#x5834;&#x5408;&#x306f;&#x30a8;&#x30e9;&#x30fc;&#x304c;&#x767a;&#x751f;&#x3057;&#x307e;&#x3059;&#x3002;&#x5f15;&#x6570;&#x306b; environment &#x3092;&#x53d6;&#x3089;&#x306a;&#x3044; build &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3057;&#x305f;&#x5834;&#x5408;&#x306f;&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x306e; environment &#x304c;&#x4f7f;&#x7528;&#x3055;&#x308c;&#x307e;&#x3059;&#xff08;&#x4e0a;&#x8a18;&#x306e;&#x4f8b;&#x3067;&#x306f; default=&quot;development&quot; &#x3068;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#xff09;&#x3002;</p>
  
<p>&#x5f15;&#x6570;&#x306b; properties &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x53d6;&#x308b; build &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x5b9f;&#x884c;&#x3057;&#x305f;&#x5834;&#x5408;&#x3001;&#x3053;&#x308c;&#x3089;&#x306e;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x306f;&#x8a2d;&#x5b9a;&#x5185;&#x3067;&#x30a2;&#x30af;&#x30bb;&#x30b9;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x306b;&#x8aad;&#x307f;&#x8fbc;&#x307e;&#x308c;&#x307e;&#x3059;&#x3002;&#x8a2d;&#x5b9a;&#x5185;&#x3067;&#x306f; ${propName} &#x306e;&#x3088;&#x3046;&#x306b;&#x8a18;&#x8ff0;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x3092;&#x53c2;&#x7167;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>
  
<p>&#x3053;&#x306e;&#x30c9;&#x30ad;&#x30e5;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x524d;&#x306e;&#x65b9;&#x3067;&#x8aac;&#x660e;&#x3057;&#x307e;&#x3057;&#x305f;&#x304c;&#x3001;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x306f; mybatis-config.xml &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x304b;&#x3089;&#x3082;&#x53c2;&#x7167;&#x3055;&#x308c;&#x308b;&#x53ef;&#x80fd;&#x6027;&#x304c;&#x3042;&#x308b;&#x306e;&#x3067;&#x3001;&#x512a;&#x5148;&#x9806;&#x4f4d;&#x306b;&#x3064;&#x3044;&#x3066;&#x7406;&#x89e3;&#x3057;&#x3066;&#x304a;&#x304f;&#x3053;&#x3068;&#x304c;&#x91cd;&#x8981;&#x3067;&#x3059;&#x3002;&#x518d;&#x63b2;&#x3057;&#x3066;&#x304a;&#x304d;&#x307e;&#x3059;&#x3002;</p>

  <hr />
  
<p>&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x304c;&#x8907;&#x6570;&#x306e;&#x7b87;&#x6240;&#x3067;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x305f;&#x5834;&#x5408;&#x3001;MyBatis &#x306f;&#x6b21;&#x306e;&#x9806;&#x5e8f;&#x3067;&#x8aad;&#x307f;&#x8fbc;&#x307f;&#x307e;&#x3059;&#x3002;</p>
  
<ul>
    
<li>&#x307e;&#x305a;&#x6700;&#x521d;&#x306b; properties &#x8981;&#x7d20;&#x306e;&#x30dc;&#x30c7;&#x30a3;&#x3067;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x304c;&#x8aad;&#x307f;&#x8fbc;&#x307e;&#x308c;&#x307e;&#x3059;&#x3002;</li>
    
<li>&#x6b21;&#x306b;&#x3001;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x30ea;&#x30bd;&#x30fc;&#x30b9;&#x3084; properties &#x8981;&#x7d20;&#x306e; url &#x5c5e;&#x6027;&#x3067;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f; Properties &#x304c;&#x8aad;&#x307f;&#x8fbc;&#x307e;&#x308c;&#x307e;&#x3059;&#x3002;&#x5148;&#x306b;&#x8a2d;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x305f;&#x5024;&#x304c;&#x3042;&#x308c;&#x3070;&#x4e0a;&#x66f8;&#x304d;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</li>
  
<li>&#x305d;&#x3057;&#x3066;&#x6700;&#x5f8c;&#x306b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066;&#x6e21;&#x3055;&#x308c;&#x305f;&#x5024;&#x304c;&#x8aad;&#x307f;&#x8fbc;&#x307e;&#x308c;&#x307e;&#x3059;&#x3002;&#x3053;&#x3053;&#x3067;&#x3082; properties &#x8981;&#x7d20;&#x306e;&#x30dc;&#x30c7;&#x30a3;&#x3067;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x5024;&#x3084; resource/url &#x5c5e;&#x6027;&#x3067;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x304b;&#x3089;&#x540c;&#x3058;&#x30ad;&#x30fc;&#x3092;&#x6301;&#x3064;&#x5024;&#x304c;&#x8aad;&#x307f;&#x8fbc;&#x307e;&#x308c;&#x3066;&#x3044;&#x305f;&#x5834;&#x5408;&#x306b;&#x306f;&#x4e0a;&#x66f8;&#x304d;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</li>
  </ul>
  
<p>&#x5f93;&#x3063;&#x3066;&#x3001;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066;&#x6e21;&#x3055;&#x308c;&#x305f;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x304c;&#x6700;&#x3082;&#x512a;&#x5148;&#x5ea6;&#x304c;&#x9ad8;&#x304f;&#x3001;&#x6b21;&#x306b; resource/url &#x5c5e;&#x6027;&#x3001;&#x6700;&#x3082;&#x512a;&#x5148;&#x5ea6;&#x304c;&#x4f4e;&#x3044;&#x306e;&#x306f; properties &#x8981;&#x7d20;&#x306e;&#x30dc;&#x30c7;&#x30a3;&#x3067;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x5024;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x306b;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;</p>
  <hr />

  
<p>&#x307e;&#x3068;&#x3081;&#x308b;&#x3068;&#x3001;&#x6700;&#x521d;&#x306e;&#xff14;&#x3064;&#x306e; build &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x3060;&#x3044;&#x305f;&#x3044;&#x540c;&#x3058;&#x3067;&#x3001;&#x5fc5;&#x8981;&#x306b;&#x5fdc;&#x3058;&#x3066; environment &#x3068; properties &#x3092;&#x30aa;&#x30fc;&#x30d0;&#x30fc;&#x30e9;&#x30a4;&#x30c9;&#x3067;&#x304d;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x9078;&#x629e;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;mybatis-config.xml &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x304b;&#x3089; SqlSessionFactory &#x3092;&#x30d3;&#x30eb;&#x30c9;&#x3059;&#x308b;&#x4f8b;&#x3092;&#x6319;&#x3052;&#x3066;&#x304a;&#x304d;&#x307e;&#x3059;&#x3002;</p>

  
<pre class="prettyprint"><code>String <strong>resource</strong> = &quot;org/mybatis/builder/mybatis-config.xml&quot;;
InputStream <strong>inputStream</strong> = Resources.getResourceAsStream(resource);
SqlSessionFactoryBuilder <strong>builder</strong> = new SqlSessionFactoryBuilder();
SqlSessionFactory <strong>factory</strong> = builder.build(inputStream);</code></pre>

  
<p>&#x3053;&#x3053;&#x3067;&#x306f; org.apache.ibatis.io &#x30d1;&#x30c3;&#x30b1;&#x30fc;&#x30b8;&#x306b;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x308b; Resources &#x30e6;&#x30fc;&#x30c6;&#x30a3;&#x30ea;&#x30c6;&#x30a3;&#x30af;&#x30e9;&#x30b9;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x306f;&#x540d;&#x524d;&#x304b;&#x3089;&#x3082;&#x5206;&#x304b;&#x308b;&#x3088;&#x3046;&#x306b;&#x3001;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x3084;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x30b7;&#x30b9;&#x30c6;&#x30e0;&#x3042;&#x308b;&#x3044;&#x306f;&#x30a6;&#x30a7;&#x30d6;&#x4e0a;&#x306e; URL &#x304b;&#x3089;&#x30ea;&#x30bd;&#x30fc;&#x30b9;&#x3092;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x305f;&#x3081;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x63d0;&#x4f9b;&#x3057;&#x307e;&#x3059;&#x3002;&#x5206;&#x304b;&#x308a;&#x3084;&#x3059;&#x3044;&#x5b9f;&#x88c5;&#x306a;&#x306e;&#x3067;&#x3001;&#x30bd;&#x30fc;&#x30b9;&#x3092;&#x8aad;&#x3081;&#x3070;&#x3069;&#x306e;&#x3088;&#x3046;&#x306a;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x7528;&#x610f;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x304b;&#x5206;&#x304b;&#x308b;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x304c;&#x3001;&#x30b7;&#x30b0;&#x30cd;&#x30c1;&#x30e3;&#x3060;&#x3051;&#x30ea;&#x30b9;&#x30c8;&#x30a2;&#x30c3;&#x30d7;&#x3057;&#x3066;&#x304a;&#x304d;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>URL getResourceURL(String resource)
URL getResourceURL(ClassLoader loader, String resource)
InputStream getResourceAsStream(String resource)
InputStream getResourceAsStream(ClassLoader loader, String resource)
Properties getResourceAsProperties(String resource)
Properties getResourceAsProperties(ClassLoader loader, String resource)
Reader getResourceAsReader(String resource)
Reader getResourceAsReader(ClassLoader loader, String resource)
File getResourceAsFile(String resource)
File getResourceAsFile(ClassLoader loader, String resource)
InputStream getUrlAsStream(String urlString)
Reader getUrlAsReader(String urlString)
Properties getUrlAsProperties(String urlString)
Class classForName(String className)</code></pre>

  
<p>&#x3082;&#x3046;&#x4e00;&#x3064;&#x306e; build &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f; Configuration &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x5f15;&#x6570;&#x306b;&#x53d6;&#x308a;&#x307e;&#x3059;&#x3002;Configuration &#x30af;&#x30e9;&#x30b9;&#x306b;&#x306f;&#x3001;SqlSessionFactory &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x306b;&#x3064;&#x3044;&#x3066;&#x5fc5;&#x8981;&#x3068;&#x3055;&#x308c;&#x308b;&#x8a2d;&#x5b9a;&#x304c;&#x5168;&#x3066;&#x304c;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;Configuration &#x30af;&#x30e9;&#x30b9;&#x3092;&#x4f7f;&#x3046;&#x3068;&#x3001;&#x8a2d;&#x5b9a;&#x3092;&#x8abf;&#x3079;&#x305f;&#x308a;&#x3001;SQL &#x30de;&#x30c3;&#x30d7;&#x306e;&#x691c;&#x7d22;&#x3001;&#x5909;&#x66f4;&#x3092;&#x884c;&#x3046;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#xff08;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x30ea;&#x30af;&#x30a8;&#x30b9;&#x30c8;&#x3092;&#x53d7;&#x3051;&#x4ed8;&#x3051;&#x305f;&#x5f8c;&#x3067; SQL &#x30de;&#x30c3;&#x30d7;&#x3092;&#x64cd;&#x4f5c;&#x3059;&#x308b;&#x306e;&#x306f;&#x907f;&#x3051;&#x308b;&#x3079;&#x304d;&#x3067;&#x3059;&#x304c;&#xff09;&#x3002;Configuration &#x30af;&#x30e9;&#x30b9;&#x306f; Java API &#x304b;&#x3089;&#x306e;&#x307f;&#x5229;&#x7528;&#x53ef;&#x80fd;&#x3067;&#x3001;&#x3053;&#x308c;&#x307e;&#x3067;&#x306b;&#x51fa;&#x3066;&#x304d;&#x305f;&#x5168;&#x3066;&#x306e;&#x8a2d;&#x5b9a;&#x306b;&#x30a2;&#x30af;&#x30bb;&#x30b9;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;&#x30b3;&#x30fc;&#x30c9;&#x5185;&#x3067;&#x751f;&#x6210;&#x3057;&#x305f; Configuration &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092; build() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306b;&#x6e21;&#x3057;&#x3066; SqlSessionFactory &#x3092;&#x4f5c;&#x6210;&#x3059;&#x308b;&#x7c21;&#x5358;&#x306a;&#x4f8b;&#x3092;&#x6319;&#x3052;&#x3066;&#x304a;&#x304d;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>DataSource dataSource = BaseDataTest.createBlogDataSource();
TransactionFactory transactionFactory = new JdbcTransactionFactory();

Environment environment = new Environment(&quot;development&quot;, transactionFactory, dataSource);

Configuration configuration = new Configuration(environment);
configuration.setLazyLoadingEnabled(true);
configuration.setEnhancementEnabled(true);
configuration.getTypeAliasRegistry().registerAlias(Blog.class);
configuration.getTypeAliasRegistry().registerAlias(Post.class);
configuration.getTypeAliasRegistry().registerAlias(Author.class);
configuration.addMapper(BoundBlogMapper.class);
configuration.addMapper(BoundAuthorMapper.class);

SqlSessionFactoryBuilder builder = new SqlSessionFactoryBuilder();
SqlSessionFactory factory = builder.build(configuration);</code></pre>

  
<p>SqlSessionFactory &#x304c;&#x624b;&#x306b;&#x5165;&#x3063;&#x305f;&#x306e;&#x3067;&#x3001;SqlSession &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x751f;&#x6210;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>

  
<h4>SqlSessionFactory</h4>
  
<p>SqlSessionFactory &#x306b;&#x306f;&#x3001;SqlSession &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x4f5c;&#x6210;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#xff16;&#x3064;&#x7528;&#x610f;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x4e00;&#x822c;&#x7684;&#x306b;&#x306f;&#x3001;&#x4ee5;&#x4e0b;&#x306e;&#x3088;&#x3046;&#x306a;&#x6761;&#x4ef6;&#x3092;&#x8003;&#x616e;&#x3057;&#x3066;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x9078;&#x3076;&#x3053;&#x3068;&#x306b;&#x306a;&#x308b;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<ul>
    
<li><strong>Transaction</strong>: &#x751f;&#x6210;&#x3057;&#x305f;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x5bfe;&#x3057;&#x3066;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x7ba1;&#x7406;&#x304c;&#x5fc5;&#x8981;&#x304b;&#x3001;&#x3042;&#x308b;&#x3044;&#x306f; auto-commit &#x30e2;&#x30fc;&#x30c9;&#xff08;&#x307b;&#x3068;&#x3093;&#x3069;&#x306e;&#x30c7;&#x30fc;&#x30bf;&#x30d9;&#x30fc;&#x30b9;&#xff0f;JDBC &#x30c9;&#x30e9;&#x30a4;&#x30d0;&#x3067;&#x300c;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x7121;&#x3057;&#x300d;&#x3092;&#x610f;&#x5473;&#x3057;&#x307e;&#x3059;&#xff09;&#x3067;&#x5229;&#x7528;&#x3059;&#x308b;&#x304b;&#x3002;</li>
    
<li><strong>Connection</strong>: &#x8a2d;&#x5b9a;&#x3057;&#x305f; DataSource &#x7d4c;&#x7531;&#x3067; MyBatis &#x306b; Connection &#x3092;&#x53d6;&#x5f97;&#x3055;&#x305b;&#x308b;&#x304b;&#x3001;&#x3042;&#x308b;&#x3044;&#x306f;&#x3042;&#x306a;&#x305f;&#x304c; Connection &#x3092;&#x63d0;&#x4f9b;&#x3059;&#x308b;&#x304b;&#x3002;</li>
    
<li><strong>Execution</strong>: PreparedStatement &#x306e;&#x518d;&#x5229;&#x7528;&#x3068;&#x30d0;&#x30c3;&#x30c1;&#x66f4;&#x65b0;&#xff08;update, insert, delete&#xff09;&#x306e;&#x4e21;&#x65b9;&#x3042;&#x308b;&#x3044;&#x306f;&#x3069;&#x3061;&#x3089;&#x304b;&#x4e00;&#x65b9;&#x3092;&#x884c;&#x3046;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308b;&#x304b;&#x3002;</li>
  </ul>
  
<p>&#x4e0a;&#x8a18;&#x306e;&#x5224;&#x5b9a;&#x306b;&#x3088;&#x3063;&#x3066;&#x6e21;&#x3059;&#x3079;&#x304d;&#x5f15;&#x6570;&#x304c;&#x6c7a;&#x307e;&#x308c;&#x3070;&#x9069;&#x5207;&#x306a; openSession() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x9078;&#x629e;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x308b;&#x306f;&#x305a;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>SqlSession openSession()
SqlSession openSession(boolean autoCommit)
SqlSession openSession(Connection connection)
SqlSession openSession(TransactionIsolationLevel level)
SqlSession openSession(ExecutorType execType, TransactionIsolationLevel level)
SqlSession openSession(ExecutorType execType)
SqlSession openSession(ExecutorType execType, boolean autoCommit)
SqlSession openSession(ExecutorType execType, Connection connection)
Configuration getConfiguration();</code></pre>

  
<p>&#x5f15;&#x6570;&#x3092;&#x53d6;&#x3089;&#x306a;&#x3044;&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x306e; openSession() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x6b21;&#x306e;&#x3088;&#x3046;&#x306a;&#x6027;&#x8cea;&#x3092;&#x6301;&#x3063;&#x305f; SqlSession &#x3092;&#x751f;&#x6210;&#x3057;&#x307e;&#x3059;&#x3002;</p>
  
<ul>
    
<li>&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x30b9;&#x30b3;&#x30fc;&#x30d7;&#x304c;&#x958b;&#x59cb;&#x3055;&#x308c;&#x307e;&#x3059;&#xff08;&#x3064;&#x307e;&#x308a; auto-commit &#x3067;&#x306f;&#x306a;&#x3044;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3059;&#xff09;&#x3002;</li>
    
<li><code>Connection</code> &#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306f;&#x3001;&#x73fe;&#x5728;&#x306e; environment &#x3067;&#x8a2d;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b; DataSource &#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x304b;&#x3089;&#x53d6;&#x5f97;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</li>
    
<li>&#x30c9;&#x30e9;&#x30a4;&#x30d0;&#x30fc;&#x307e;&#x305f;&#x306f;&#x30c7;&#x30fc;&#x30bf;&#x30bd;&#x30fc;&#x30b9;&#x306e;&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x306e;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x5206;&#x96e2;&#x30ec;&#x30d9;&#x30eb;&#x304c;&#x9069;&#x7528;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</li>
    
<li>PreparedStatement &#x306f;&#x518d;&#x5229;&#x7528;&#x3055;&#x308c;&#x305a;&#x3001;&#x30d0;&#x30c3;&#x30c1;&#x66f4;&#x65b0;&#x3082;&#x884c;&#x308f;&#x308c;&#x307e;&#x305b;&#x3093;&#x3002;</li>
  </ul>
  
<p>&#x307b;&#x3068;&#x3093;&#x3069;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x898b;&#x305f;&#x307e;&#x307e;&#x3067;&#x3059;&#x3002;auto-commit &#x3092;&#x6709;&#x52b9;&#x306b;&#x3059;&#x308b;&#x306b;&#x306f;&#x3001;&#x30aa;&#x30d7;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x5f15;&#x6570; auto-commit &#x306b;&#x5bfe;&#x3057;&#x3066; <code>true</code> &#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;&#x81ea;&#x524d;&#x306e;&#x63a5;&#x7d9a;&#x3092;&#x4f7f;&#x3046;&#x5834;&#x5408;&#x306f;&#x3001;<code>Connection</code> &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066;&#x6e21;&#x3057;&#x307e;&#x3059;&#x3002;auto-commit &#x3068; Connection &#x3092;&#x4e21;&#x65b9;&#x5f15;&#x6570;&#x306b;&#x6301;&#x3064;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x304c;&#x3001;&#x3053;&#x308c;&#x306f; MyBatis &#x304c;&#x6e21;&#x3055;&#x308c;&#x305f; Connection &#x306e;&#x30e2;&#x30fc;&#x30c9;&#x3092;&#x305d;&#x306e;&#x307e;&#x307e;&#x5229;&#x7528;&#x3059;&#x308b;&#x304b;&#x3089;&#x3067;&#x3059;&#x3002;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x5206;&#x96e2;&#x30ec;&#x30d9;&#x30eb;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x5834;&#x5408;&#x3001;MyBatis &#x304c;&#x63d0;&#x4f9b;&#x3059;&#x308b; enum &#x578b;&#x306e;&#x30e9;&#x30c3;&#x30d1;&#x30fc; <code>TransactionIsolationLevel</code> &#x3092;&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066;&#x6e21;&#x3057;&#x307e;&#x3059;&#x3002;JDBC &#x306b;&#x3088;&#x3063;&#x3066;&#x63d0;&#x4f9b;&#x3055;&#x308c;&#x308b;&#xff15;&#x3064;&#x306e;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x5206;&#x96e2;&#x30ec;&#x30d9;&#x30eb;(<code>NONE</code>, <code>READ_UNCOMMITTED</code>, <code>READ_COMMITTED</code>, <code>REPEATABLE_READ</code>, <code>SERIALIZABLE</code>)  &#x304c;&#x7528;&#x610f;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<p>&#x3082;&#x3046;&#x4e00;&#x3064;&#x306e;&#x5f15;&#x6570; <code>ExecutorType</code> &#x306f;&#x5217;&#x6319;&#x578b;&#x3067;&#x3001;&#xff13;&#x3064;&#x306e;&#x5024;&#x304c;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<ul>
    
<li><code>ExecutorType.SIMPLE</code>: &#x7279;&#x5225;&#x306a;&#x3053;&#x3068;&#x306f;&#x884c;&#x3044;&#x307e;&#x305b;&#x3093;&#x3002;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x305f;&#x3073;&#x306b;&#x65b0;&#x3057;&#x3044; PreparedStatement &#x3092;&#x4f5c;&#x6210;&#x3057;&#x307e;&#x3059;&#x3002;</li>
    
<li><code>ExecutorType.REUSE</code>: PreparedStatement &#x3092;&#x518d;&#x5229;&#x7528;&#x3057;&#x307e;&#x3059;&#x3002;</li>
    
<li><code>ExecutorType.BATCH</code>: &#x5168;&#x3066;&#x306e;&#x66f4;&#x65b0;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x30d0;&#x30c3;&#x30c1;&#x3067;&#x5b9f;&#x884c;&#x3057;&#x3001;&#x9014;&#x4e2d;&#x3067; SELECT &#x304c;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x308b;&#x5834;&#x5408;&#x306f;&#x3001;&#x3088;&#x308a;&#x5206;&#x304b;&#x308a;&#x3084;&#x3059;&#x3044;&#x52d5;&#x4f5c;&#x3068;&#x306a;&#x308b;&#x3088;&#x3046;&#x5fc5;&#x8981;&#x306b;&#x5fdc;&#x3058;&#x3066;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x5883;&#x754c;&#x3092;&#x8a2d;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;</li>
  </ul>
  
<p><span class="label important">NOTE</span> &#x8aac;&#x660e;&#x3057;&#x307e;&#x305b;&#x3093;&#x3067;&#x3057;&#x305f;&#x304c;&#x3001;SqlSessionFactory &#x306b;&#x306f;&#x3082;&#x3046;&#x4e00;&#x3064; <em>getConfiguration()</em> &#x3068;&#x3044;&#x3046;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x3001;MyBatis &#x306e;&#x5b9f;&#x884c;&#x6642;&#x8a2d;&#x5b9a;&#x306b;&#x3064;&#x3044;&#x3066;&#x306e;&#x60c5;&#x5831;&#x3092;&#x4fdd;&#x6301;&#x3059;&#x308b; Configuration &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x8fd4;&#x3057;&#x307e;&#x3059;&#x3002;</p>
  
<p><span class="label important">NOTE</span> &#x65e7;&#x30d0;&#x30fc;&#x30b8;&#x30e7;&#x30f3;&#x306e; MyBatis &#x3067;&#x306f;&#x3001;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x3001;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x3001;&#x30d0;&#x30c3;&#x30c1;&#x306f;&#x4e92;&#x3044;&#x306b;&#x72ec;&#x7acb;&#x3057;&#x3066;&#x3044;&#x307e;&#x3057;&#x305f;&#x3002;MyBatis 3 &#x3067;&#x306f;&#x3001;&#x3053;&#x308c;&#x3089;&#xff13;&#x3064;&#x306f;&#x5168;&#x3066;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30b9;&#x30b3;&#x30fc;&#x30d7;&#x306b;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x308b;&#x306e;&#x3067;&#x3001;&#x305d;&#x308c;&#x305e;&#x308c;&#x3092;&#x5225;&#x3005;&#x306b;&#x6271;&#x3046;&#x5fc5;&#x8981;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002;</p>

  </section><section><a id="SqlSession"></a>
<h4>SqlSession</h4>
  
<p>&#x4ee5;&#x524d;&#x8aac;&#x660e;&#x3057;&#x305f;&#x3088;&#x3046;&#x306b;&#x3001;SqlSession &#x306f; MyBatis &#x3067;&#x3082;&#x6700;&#x3082;&#x5f37;&#x529b;&#x306a;&#x30af;&#x30e9;&#x30b9;&#x3067;&#x3001;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5b9f;&#x884c;&#x3001;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30b3;&#x30df;&#x30c3;&#x30c8;&#x307e;&#x305f;&#x306f;&#x30ed;&#x30fc;&#x30eb;&#x30d0;&#x30c3;&#x30af;&#x3001;Mapper &#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x306e;&#x53d6;&#x5f97;&#x3092;&#x884c;&#x3046;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x5168;&#x3066;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<p>SqlSession &#x306b;&#x306f; 20 &#x3092;&#x8d85;&#x3048;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x306e;&#x3067;&#x3001;&#x3044;&#x304f;&#x3064;&#x304b;&#x306e;&#x30b0;&#x30eb;&#x30fc;&#x30d7;&#x306b;&#x5206;&#x3051;&#x3066;&#x8aac;&#x660e;&#x3057;&#x307e;&#x3059;&#x3002;</p>

  <section><a id="a.E3.82.B9.E3.83.86.E3.83.BC.E3.83.88.E3.83.A1.E3.83.B3.E3.83.88.E3.82.92.E5.AE.9F.E8.A1.8C.E3.81.99.E3.82.8B.E3.83.A1.E3.82.BD.E3.83.83.E3.83.89"></a>
<h5>&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;</h5>
  
<p>&#x3053;&#x308c;&#x3089;&#x306f;&#x3001;SQL Mapper &#x3067;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b; SELECT, INSERT, UPDATE, DELETE &#x306e;&#x5404;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3067;&#x3059;&#x3002;&#x307b;&#x3068;&#x3093;&#x3069;&#x81ea;&#x660e;&#x3067;&#x3059;&#x304c;&#x3001;&#x305d;&#x308c;&#x305e;&#x308c;&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e; ID &#x3068;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5f15;&#x6570;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#xff08;&#x30d7;&#x30ea;&#x30df;&#x30c6;&#x30a3;&#x30d6;&#x3001;JavaBean&#x3001;POJO&#x3001;Map &#x306e;&#x3044;&#x305a;&#x308c;&#x304b;&#xff09;&#x3092;&#x53d6;&#x308a;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>&lt;T&gt; T selectOne(String statement, Object parameter)
&lt;E&gt; List&lt;E&gt; selectList(String statement, Object parameter)
&lt;T&gt; Cursor&lt;T&gt; selectCursor(String statement, Object parameter)
&lt;K,V&gt; Map&lt;K,V&gt; selectMap(String statement, Object parameter, String mapKey)
int insert(String statement, Object parameter)
int update(String statement, Object parameter)
int delete(String statement, Object parameter)</code></pre>
  
<p>selectOne &#x3068; selectList &#x306e;&#x9055;&#x3044;&#x306f;&#x3001;selectOne &#x306f;&#xff11;&#x3064;&#x306e;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x307e;&#x305f;&#x306f; null &#x3092;&#x8fd4;&#x3055;&#x306a;&#x304f;&#x3066;&#x306f;&#x306a;&#x3089;&#x306a;&#x3044;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;&#x8907;&#x6570;&#x306e;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x304c;&#x8fd4;&#x3055;&#x308c;&#x308b;&#x3068;&#x4f8b;&#x5916;&#x304c;&#x767a;&#x751f;&#x3057;&#x307e;&#x3059;&#x3002;&#x7d50;&#x679c;&#x306e;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x6570;&#x304c;&#x672a;&#x77e5;&#x306e;&#x5834;&#x5408;&#x306f; selectList &#x3092;&#x4f7f;&#x7528;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x304c;&#x5b58;&#x5728;&#x3059;&#x308b;&#x304b;&#x3069;&#x3046;&#x304b;&#x3092;&#x78ba;&#x8a8d;&#x3057;&#x305f;&#x3044;&#x306e;&#x306a;&#x3089;&#x3001;&#x30ab;&#x30a6;&#x30f3;&#x30c8;&#x7d50;&#x679c;&#xff08;0 or 1&#xff09;&#x3092;&#x8fd4;&#x3059;&#x3088;&#x3046;&#x306b;&#x3057;&#x305f;&#x65b9;&#x304c;&#x826f;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;selectMap &#x306f;&#x3001;&#x7d50;&#x679c;&#x306e;&#x30ea;&#x30b9;&#x30c8;&#x3092; mapKey &#x3067;&#x6307;&#x5b9a;&#x3057;&#x305f;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x306b;&#x57fa;&#x3065;&#x3044;&#x305f;&#x30de;&#x30c3;&#x30d7;&#x306b;&#x683c;&#x7d0d;&#x3057;&#x3066;&#x8fd4;&#x3059;&#x7279;&#x6b8a;&#x306a;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3067;&#x3059;&#x3002;<br />&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5f15;&#x6570;&#x306f;&#x4e0d;&#x8981;&#x306a;&#x5834;&#x5408;&#x3082;&#x3042;&#x308b;&#x306e;&#x3067;&#x3001;parameter &#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x5f15;&#x6570;&#x3092;&#x6301;&#x305f;&#x306a;&#x3044;&#x30aa;&#x30fc;&#x30d0;&#x30fc;&#x30ed;&#x30fc;&#x30c9;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3082;&#x7528;&#x610f;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<p>insert, update, delete &#x306e;&#x5404;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x3001;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5b9f;&#x884c;&#x306b;&#x3088;&#x3063;&#x3066;&#x5f71;&#x97ff;&#x3092;&#x53d7;&#x3051;&#x305f;&#x884c;&#x6570;&#x3092;&#x8fd4;&#x3057;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>&lt;T&gt; T selectOne(String statement)
&lt;E&gt; List&lt;E&gt; selectList(String statement)
&lt;T&gt; Cursor&lt;T&gt; selectCursor(String statement)
&lt;K,V&gt; Map&lt;K,V&gt; selectMap(String statement, String mapKey)
int insert(String statement)
int update(String statement)
int delete(String statement)</code></pre>

  
<p>A Cursor offers the same results as a List, except it fetches data lazily using an Iterator.</p>
  
<pre class="prettyprint"><code>try (Cursor&lt;MyEntity&gt; entities = session.selectCursor(statement, param)) {
   for (MyEntity entity:entities) {
      // process one entity
   }
}</code></pre>

  
<p>&#x6700;&#x5f8c;&#x306b;&#x3001;&#x9ad8;&#x5ea6;&#x306a;&#x51e6;&#x7406;&#x3092;&#x884c;&#x3046;&#x305f;&#x3081;&#x306e; select &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x3053;&#x308c;&#x3089;&#x306f;&#x4e3b;&#x306b;&#x975e;&#x5e38;&#x306b;&#x5927;&#x304d;&#x306a;&#x30c7;&#x30fc;&#x30bf;&#x30bb;&#x30c3;&#x30c8;&#x3092;&#x6271;&#x3046;&#x5834;&#x5408;&#x306b;&#x3001;&#x8fd4;&#x3055;&#x308c;&#x308b;&#x884c;&#x306e;&#x7bc4;&#x56f2;&#x3092;&#x9650;&#x5b9a;&#x3057;&#x305f;&#x308a;&#x3001;&#x30ab;&#x30b9;&#x30bf;&#x30e0;&#x306e; ResultHandler &#x3092;&#x4f7f;&#x3063;&#x3066;&#x72ec;&#x81ea;&#x306b;&#x7d50;&#x679c;&#x51e6;&#x7406;&#x3092;&#x884c;&#x3046;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x306b;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>&lt;E&gt; List&lt;E&gt; selectList (String statement, Object parameter, RowBounds rowBounds)
&lt;T&gt; Cursor&lt;T&gt; selectCursor(String statement, Object parameter, RowBounds rowBounds)
&lt;K,V&gt; Map&lt;K,V&gt; selectMap(String statement, Object parameter, String mapKey, RowBounds rowbounds)
void select (String statement, Object parameter, ResultHandler&lt;T&gt; handler)
void select (String statement, Object parameter, RowBounds rowBounds, ResultHandler&lt;T&gt; handler)</code></pre>

  
<p>RowBounds &#x5f15;&#x6570;&#x3092;&#x6e21;&#x3059;&#x3053;&#x3068;&#x306b;&#x3088;&#x3063;&#x3066;&#x3001;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x6570;&#x306e;&#x30ec;&#x30b3;&#x30fc;&#x30c9;&#x3092;&#x30b9;&#x30ad;&#x30c3;&#x30d7;&#x3057;&#x3001;&#x7d50;&#x679c;&#x3068;&#x3057;&#x3066;&#x8fd4;&#x3055;&#x308c;&#x308b;&#x884c;&#x306e;&#x6570;&#x3092;&#x5236;&#x9650;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;RowBounds &#x30af;&#x30e9;&#x30b9;&#x306f;&#x30a4;&#x30df;&#x30e5;&#x30fc;&#x30bf;&#x30d6;&#x30eb;&#x3067;&#x3001;&#x30b3;&#x30f3;&#x30b9;&#x30c8;&#x30e9;&#x30af;&#x30bf;&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066; offset &#x3068; limit &#x3092;&#x53d6;&#x308a;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>int offset = 100;
int limit = 25;
RowBounds rowBounds = new RowBounds(offset, limit);</code></pre>

  
<p>&#x30c9;&#x30e9;&#x30a4;&#x30d0;&#x30fc;&#x306b;&#x3088;&#x3063;&#x3066;&#x5f97;&#x3089;&#x308c;&#x308b;&#x52b9;&#x679c;&#x306f;&#x7570;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;SCROLL_SENSITIVE &#x307e;&#x305f;&#x306f; SCROLL_INSENSITIVE &#xff08;&#x3064;&#x307e;&#x308a; FORWARD_ONLY &#x4ee5;&#x5916;&#xff09;&#x306e;&#x7d50;&#x679c;&#x30bb;&#x30c3;&#x30c8;&#x30bf;&#x30a4;&#x30d7;&#x3092;&#x4f7f;&#x3063;&#x305f;&#x6642;&#x3001;&#x6700;&#x3082;&#x826f;&#x3044;&#x30d1;&#x30d5;&#x30a9;&#x30fc;&#x30de;&#x30f3;&#x30b9;&#x304c;&#x5f97;&#x3089;&#x308c;&#x307e;&#x3059;&#x3002;</p>
  
<p>ResultHandler &#x3092;&#x6e21;&#x3059;&#x3068;&#x3001;&#x5404;&#x884c;&#x3092;&#x81ea;&#x7531;&#x306b;&#x51e6;&#x7406;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;List &#x306b;&#x8ffd;&#x52a0;&#x3057;&#x305f;&#x308a;&#x3001;Map &#x3084; Set &#x3092;&#x4f5c;&#x6210;&#x3059;&#x308b;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#x3057;&#x3001;&#x7d50;&#x679c;&#x3092;&#x6368;&#x3066;&#x3066;&#x5408;&#x8a08;&#x5024;&#x306e;&#x307f;&#x3092;&#x8fd4;&#x3059;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;ResultHandler &#x3092;&#x4f7f;&#x3048;&#x3070;&#x597d;&#x304d;&#x306a;&#x51e6;&#x7406;&#x3092;&#x884c;&#x3046;&#x3053;&#x3068;&#x3082;&#x53ef;&#x80fd;&#x3067;&#x3001;MyBatis &#x81ea;&#x8eab;&#x3082;&#x5185;&#x90e8;&#x7684;&#x306b;&#x7d50;&#x679c;&#x30ea;&#x30b9;&#x30c8;&#x3092;&#x69cb;&#x7bc9;&#x3059;&#x308b;&#x305f;&#x3081;&#x306b; ResultHandler &#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<p>3.4.6 &#x4ee5;&#x964d;&#x3067;&#x306f;&#x3001;CALLABLE &#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306b;&#x6e21;&#x3055;&#x308c;&#x305f; ResultHandler &#x306f;&#x3001;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x30b9;&#x30c8;&#x30a2;&#x30c9;&#x30fb;&#x30d7;&#x30ed;&#x30b7;&#x30fc;&#x30b8;&#x30e3;&#x3067;&#x5ba3;&#x8a00;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b; REFCURSOR &#x578b;&#x306e; OUT &#x5f15;&#x6570;&#x5168;&#x3066;&#x306b;&#x5bfe;&#x3057;&#x3066;&#x9069;&#x7528;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</p>
  
<p>ResultHandler &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x306f;&#x975e;&#x5e38;&#x306b;&#x30b7;&#x30f3;&#x30d7;&#x30eb;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>package org.mybatis.executor.result;
public interface ResultHandler&lt;T&gt; {
  void handleResult(ResultContext&lt;? extends T&gt; context);
}</code></pre>

  
<p>&#x5f15;&#x6570; ResultContext &#x3092;&#x4ecb;&#x3057;&#x3066;&#x7d50;&#x679c;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306b;&#x30a2;&#x30af;&#x30bb;&#x30b9;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;ResultContext#getResultCount() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x4f5c;&#x6210;&#x3055;&#x308c;&#x305f;&#x7d50;&#x679c;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x6570;&#x3092;&#x8fd4;&#x3057;&#x307e;&#x3059;&#x3002;ResultContext#stop() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3059;&#x3068;&#x3001;&#x305d;&#x308c;&#x4ee5;&#x4e0a;&#x7d50;&#x679c;&#x3092;&#x8aad;&#x307f;&#x8fbc;&#x307e;&#x306a;&#x3044;&#x3088;&#x3046; MyBatis &#x306b;&#x6307;&#x793a;&#x3057;&#x307e;&#x3059;&#x3002;</p>

  
<p>ResultHandler &#x3092;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x5834;&#x5408;&#x306b;&#x6ce8;&#x610f;&#x3059;&#x3079;&#x304d;&#x70b9;&#x304c;&#xff12;&#x3064;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;</p>

  
<ul>
  
<li>ResultHandler &#x3092;&#x5f15;&#x6570;&#x306b;&#x53d6;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304b;&#x3089;&#x8fd4;&#x3055;&#x308c;&#x308b;&#x30c7;&#x30fc;&#x30bf;&#x306f;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x3055;&#x308c;&#x307e;&#x305b;&#x3093;&#x3002;</li>
  
<li>&#x8907;&#x96d1;&#x306a; ResultMap &#x3067;&#x306f;&#x8907;&#x6570;&#x884c;&#x306e;&#x30c7;&#x30fc;&#x30bf;&#x304c;&#x3072;&#x3068;&#x3064;&#x306e;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306b;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3055;&#x308c;&#x308b;&#x3053;&#x3068;&#x3082;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x3053;&#x3046;&#x3057;&#x305f; ResultMap &#x3092; ResultHandler &#x3068;&#x4f75;&#x7528;&#x3059;&#x308b;&#x969b;&#x3001;association &#x3084; collection &#x306e;&#x30c7;&#x30fc;&#x30bf;&#x304c;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3055;&#x308c;&#x308b;&#x524d;&#x306e;&#x72b6;&#x614b;&#x306e;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x304c;&#x6e21;&#x3055;&#x308c;&#x308b;&#x5834;&#x5408;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;</li>
  </ul>

  </section><section><a id="a.E3.83.90.E3.83.83.E3.83.81.E6.9B.B4.E6.96.B0.E3.82.B9.E3.83.86.E3.83.BC.E3.83.88.E3.83.A1.E3.83.B3.E3.83.88.E3.82.92.E3.83.95.E3.83.A9.E3.83.83.E3.82.B7.E3.83.A5.E3.81.99.E3.82.8B.E3.83.A1.E3.82.BD.E3.83.83.E3.83.89"></a>
<h5>&#x30d0;&#x30c3;&#x30c1;&#x66f4;&#x65b0;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x30d5;&#x30e9;&#x30c3;&#x30b7;&#x30e5;&#x3059;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;</h5>
  
<p>&#x30d0;&#x30c3;&#x30c1;&#x66f4;&#x65b0;&#x7528;&#x306b; JDBC &#x30c9;&#x30e9;&#x30a4;&#x30d0;&#x5185;&#x306b;&#x84c4;&#x7a4d;&#x3055;&#x308c;&#x305f;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x4efb;&#x610f;&#x306e;&#x30bf;&#x30a4;&#x30df;&#x30f3;&#x30b0;&#x3067;&#x30c7;&#x30fc;&#x30bf;&#x30d9;&#x30fc;&#x30b9;&#x3078;&#x30d5;&#x30e9;&#x30c3;&#x30b7;&#x30e5;(&#x5b9f;&#x884c;)&#x3059;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x3001; <code>ExecutorType</code> &#x3068;&#x3057;&#x3066; <code>ExecutorType.BATCH</code> &#x3092;&#x4f7f;&#x7528;&#x3057;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x306b;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>List&lt;BatchResult&gt; flushStatements()</code></pre>

  </section><section><a id="a.E3.83.88.E3.83.A9.E3.83.B3.E3.82.B6.E3.82.AF.E3.82.B7.E3.83.A7.E3.83.B3.E3.82.92.E5.88.B6.E5.BE.A1.E3.81.99.E3.82.8B.E3.83.A1.E3.82.BD.E3.83.83.E3.83.89"></a>
<h5 id="transaction-control-methods">&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x5236;&#x5fa1;&#x3059;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;</h5>
  
<p>&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30b9;&#x30b3;&#x30fc;&#x30d7;&#x3092;&#x5236;&#x5fa1;&#x3059;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#xff14;&#x3064;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x5f53;&#x7136;&#x3067;&#x3059;&#x304c;&#x3001;auto-commit &#x3092;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x5834;&#x5408;&#x3084;&#x3001;&#x5916;&#x90e8;&#x306e;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x30de;&#x30cd;&#x30fc;&#x30b8;&#x30e3;&#x30fc;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x3001;&#x3053;&#x308c;&#x3089;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x52b9;&#x679c;&#x304c;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002;&#x3057;&#x304b;&#x3057;&#x3001;Connection &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x306b;&#x3088;&#x3063;&#x3066;&#x7ba1;&#x7406;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b; JDBC &#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x30de;&#x30cd;&#x30fc;&#x30b8;&#x30e3;&#x30fc;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x306f;&#x4fbf;&#x5229;&#x306a;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>void commit()
void commit(boolean force)
void rollback()
void rollback(boolean force)</code></pre>
  
<p>&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x3067;&#x306f;&#x3001;&#x30c7;&#x30fc;&#x30bf;&#x30d9;&#x30fc;&#x30b9;&#x306e;&#x5909;&#x66f4;&#x3092;&#x4f34;&#x3046;&#x30e1;&#x30bd;&#x30c3;&#x30c9; insert, update, delete, <code>affectData</code> &#x3092;&#x6709;&#x52b9;&#x5316;&#x3057;&#x305f; select &#x304c;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x306a;&#x3044;&#x9650;&#x308a; MyBatis &#x306f; commit &#x3092;&#x5b9f;&#x884c;&#x3057;&#x307e;&#x305b;&#x3093;&#x3002;&#x4f55;&#x3089;&#x304b;&#x306e;&#x7406;&#x7531;&#x3067;&#x3053;&#x308c;&#x3089;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x4f7f;&#x308f;&#x305a;&#x306b;&#x30c7;&#x30fc;&#x30bf;&#x3092;&#x5909;&#x66f4;&#x3057;&#x305f;&#x5834;&#x5408;&#x306f;&#x78ba;&#x5b9f;&#x306b;&#x30b3;&#x30df;&#x30c3;&#x30c8;&#x3055;&#x308c;&#x308b;&#x3088;&#x3046;&#x306b; commit &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306b;&#x5f15;&#x6570; true &#x3092;&#x6e21;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#xff08;&#x305f;&#x3060;&#x3057;&#x3001;auto-commit &#x30e2;&#x30fc;&#x30c9;&#x306e;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x3084;&#x5916;&#x90e8;&#x306e;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x30de;&#x30cd;&#x30fc;&#x30b8;&#x30e3;&#x30fc;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x306f; true &#x3092;&#x6e21;&#x3057;&#x3066;&#x3082;&#x30b3;&#x30df;&#x30c3;&#x30c8;&#x3055;&#x308c;&#x307e;&#x305b;&#x3093;&#xff09;&#x3002;commit &#x304c;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x306a;&#x3044;&#x5834;&#x5408;&#x3001;MyBatis &#x304c;&#x30ed;&#x30fc;&#x30eb;&#x30d0;&#x30c3;&#x30af;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x306e;&#x3067;&#x3001;&#x901a;&#x5e38;&#x660e;&#x793a;&#x7684;&#x306b; rollback() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3059;&#x5fc5;&#x8981;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002;&#x3057;&#x304b;&#x3057;&#x3001;&#x4e00;&#x3064;&#x306e;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x4e2d;&#x3067;&#x8907;&#x6570;&#x306e;&#x30b3;&#x30df;&#x30c3;&#x30c8;&#x3084;&#x30ed;&#x30fc;&#x30eb;&#x30d0;&#x30c3;&#x30af;&#x304c;&#x5fc5;&#x8981;&#x3068;&#x3055;&#x308c;&#x308b;&#x3088;&#x3046;&#x306a;&#x30b1;&#x30fc;&#x30b9;&#x3067;&#x306f;&#x3001;rollback() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x3088;&#x308a;&#x7d30;&#x304b;&#x3044;&#x5236;&#x5fa1;&#x3092;&#x884c;&#x3046;&#x3053;&#x3068;&#x304c;&#x53ef;&#x80fd;&#x3067;&#x3059;&#x3002;</p>
  
<p><span class="label important">NOTE</span> Mybatis-Spring &#x3068; MyBatis-Guice &#x3067;&#x306f;&#x5ba3;&#x8a00;&#x7684;&#x30c8;&#x30e9;&#x30f3;&#x30b6;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x30b5;&#x30dd;&#x30fc;&#x30c8;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x8a73;&#x7d30;&#x306f;&#x5404;&#x30b5;&#x30d6;&#x30d7;&#x30ed;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x30c9;&#x30ad;&#x30e5;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x53c2;&#x7167;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;</p>

  </section><section><a id="a.E3.83.AD.E3.83.BC.E3.82.AB.E3.83.AB.E3.82.AD.E3.83.A3.E3.83.83.E3.82.B7.E3.83.A5"></a>
<h5>&#x30ed;&#x30fc;&#x30ab;&#x30eb;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;</h5>
  
<p>MyBatis &#x306f;&#xff12;&#x7a2e;&#x985e;&#x306e;&#x5185;&#x90e8;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x3092;&#x4f7f;&#x7528;&#x3057;&#x307e;&#x3059;&#x3002;</p>
  
<p>&#x65b0;&#x3057;&#x3044;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x751f;&#x6210;&#x3055;&#x308c;&#x308b;&#x969b;&#x3001;&#x540c;&#x6642;&#x306b;&#x30ed;&#x30fc;&#x30ab;&#x30eb;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x304c;&#x4f5c;&#x6210;&#x3055;&#x308c;&#x3001;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x30a2;&#x30bf;&#x30c3;&#x30c1;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x5185;&#x3067;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x308b;&#x30af;&#x30a8;&#x30ea;&#x306f;&#x5168;&#x3066;&#x30ed;&#x30fc;&#x30ab;&#x30eb;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x306b;&#x4fdd;&#x5b58;&#x3055;&#x308c;&#x3001;&#x540c;&#x4e00;&#x30d1;&#x30e9;&#x30e1;&#x30fc;&#x30bf;&#x30fc;&#x3067;&#x518d;&#x5ea6;&#x547c;&#x3073;&#x51fa;&#x3055;&#x308c;&#x305f;&#x5834;&#x5408;&#x306f;&#x30c7;&#x30fc;&#x30bf;&#x30d9;&#x30fc;&#x30b9;&#x306b;&#x554f;&#x3044;&#x5408;&#x308f;&#x305b;&#x305a;&#x306b;&#x7d50;&#x679c;&#x3092;&#x8fd4;&#x3057;&#x307e;&#x3059;&#x3002;&#x30ed;&#x30fc;&#x30ab;&#x30eb;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x306f; update, commit, rollback, close &#x304c;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x308b;&#x3068;&#x30af;&#x30ea;&#x30a2;&#x3055;&#x308c;&#x308b;&#x3088;&#x3046;&#x306b;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<p>&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x3067;&#x306f;&#x3001;&#x30ed;&#x30fc;&#x30ab;&#x30eb;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x306f;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x7834;&#x68c4;&#x3055;&#x308c;&#x308b;&#x307e;&#x3067;&#x4fdd;&#x6301;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;&#x30ed;&#x30fc;&#x30ab;&#x30eb;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x306f; ResultMap &#x306e;&#x5faa;&#x74b0;&#x53c2;&#x7167;&#x306e;&#x89e3;&#x6c7a;&#x3084;&#x30cd;&#x30b9;&#x30c8;&#x3055;&#x308c;&#x305f;&#x30af;&#x30a8;&#x30ea;&#x306e;&#x52b9;&#x7387;&#x5316;&#x306b;&#x3082;&#x4f7f;&#x7528;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x305f;&#x3081;&#x3001;&#x5b8c;&#x5168;&#x306b;&#x7121;&#x52b9;&#x5316;&#x3059;&#x308b;&#x3053;&#x3068;&#x306f;&#x3067;&#x304d;&#x307e;&#x305b;&#x3093;&#x304c;&#x3001;localCacheScope &#x306b; STATEMENT &#x3092;&#x8a2d;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;&#x4fdd;&#x6301;&#x671f;&#x9593;&#x3092;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x5358;&#x4f4d;&#x306b;&#x5909;&#x66f4;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>
  
<p>localCacheScope &#x306b; SESSION &#x304c;&#x8a2d;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x3001;MyBatis &#x306f;&#x540c;&#x4e00;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x3078;&#x306e;&#x53c2;&#x7167;&#x3092;&#x8fd4;&#x3059;&#x3068;&#x3044;&#x3046;&#x70b9;&#x306b;&#x6ce8;&#x610f;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;&#x8fd4;&#x3055;&#x308c;&#x305f;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x3084;&#x30ea;&#x30b9;&#x30c8;&#x306a;&#x3069;&#x306b;&#x5909;&#x66f4;&#x3092;&#x52a0;&#x3048;&#x305f;&#x5834;&#x5408;&#x3001;&#x30ed;&#x30fc;&#x30ab;&#x30eb;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x306e;&#x5185;&#x5bb9;&#x304c;&#x5909;&#x66f4;&#x3055;&#x308c;&#x308b;&#x3053;&#x3068;&#x306b;&#x306a;&#x308b;&#x306e;&#x3067;&#x3001;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x6709;&#x52b9;&#x306a;&#x9593;&#x306b;&#x540c;&#x3058;&#x30af;&#x30a8;&#x30ea;&#x3092;&#x767a;&#x884c;&#x3059;&#x308b;&#x3068;&#x610f;&#x56f3;&#x3057;&#x306a;&#x3044;&#x7d50;&#x679c;&#x304c;&#x623b;&#x308b;&#x3053;&#x3068;&#x306b;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;&#x540c;&#x4e00;&#x30bb;&#x30c3;&#x30b7;&#x30e7;&#x30f3;&#x5185;&#x3067;&#x540c;&#x3058;&#x30af;&#x30a8;&#x30ea;&#x3092;&#x7e70;&#x308a;&#x8fd4;&#x3057;&#x767a;&#x884c;&#x3059;&#x308b;&#x3088;&#x3046;&#x306a;&#x30b1;&#x30fc;&#x30b9;&#x3067;&#x306f;&#x3001;&#x7d50;&#x679c;&#x3068;&#x3057;&#x3066;&#x8fd4;&#x3055;&#x308c;&#x305f;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x3092;&#x5909;&#x66f4;&#x3057;&#x306a;&#x3044;&#x307b;&#x3046;&#x304c;&#x7121;&#x96e3;&#x3067;&#x3059;&#x3002;</p>
  
<p>&#x307e;&#x305f;&#x3001;&#x6b21;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3059;&#x3053;&#x3068;&#x306b;&#x3088;&#x308a;&#x4efb;&#x610f;&#x306e;&#x30bf;&#x30a4;&#x30df;&#x30f3;&#x30b0;&#x3067;&#x30ed;&#x30fc;&#x30ab;&#x30eb;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x3092;&#x30af;&#x30ea;&#x30a2;&#x3059;&#x308b;&#x3053;&#x3068;&#x3082;&#x53ef;&#x80fd;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>void clearCache()</code></pre>

  </section><section><a id="a.E7.A2.BA.E5.AE.9F.E3.81.AB_SqlSession_.E3.82.92.E3.82.AF.E3.83.AD.E3.83.BC.E3.82.BA.E3.81.99.E3.82.8B"></a>
<h5>&#x78ba;&#x5b9f;&#x306b; SqlSession &#x3092;&#x30af;&#x30ed;&#x30fc;&#x30ba;&#x3059;&#x308b;</h5>
  
<pre class="prettyprint"><code>void close()</code></pre>
  
<p>&#x6700;&#x3082;&#x91cd;&#x8981;&#x306a;&#x306e;&#x306f;&#x3001;&#x30aa;&#x30fc;&#x30d7;&#x30f3;&#x3057;&#x305f; session &#x306f;&#x5fc5;&#x305a;&#x30af;&#x30ed;&#x30fc;&#x30ba;&#x3059;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308b;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;&#x305d;&#x306e;&#x305f;&#x3081;&#x306b;&#x306f;&#x6b21;&#x306e;&#x3088;&#x3046;&#x306a;&#x30d1;&#x30bf;&#x30fc;&#x30f3;&#x3067;&#x30b3;&#x30fc;&#x30c9;&#x3092;&#x66f8;&#x304f;&#x306e;&#x304c;&#x6700;&#x3082;&#x78ba;&#x5b9f;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>try (SqlSession session = sqlSessionFactory.openSession()) {
    // following 3 lines pseudocode for &quot;doing some work&quot;
    session.insert(...);
    session.update(...);
    session.delete(...);
    session.commit();
}</code></pre>
  
<p><span class="label important">NOTE</span> SqlSessionFactory &#x3068;&#x540c;&#x69d8;&#x3001;getConfiguration() &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3059;&#x3053;&#x3068;&#x3067;&#x4f7f;&#x7528;&#x4e2d;&#x306e; Configuration &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>Configuration getConfiguration()</code></pre>

  </section><section><a id="Mapper_.E3.82.92.E4.BD.BF.E3.81.86"></a>
<h5>Mapper &#x3092;&#x4f7f;&#x3046;</h5>
  
<pre class="prettyprint"><code>&lt;T&gt; T getMapper(Class&lt;T&gt; type)</code></pre>
  
<p>SqlSession &#x306b;&#x7528;&#x610f;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b; insert, update, delete, select &#x306a;&#x3069;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x78ba;&#x304b;&#x306b;&#x5f37;&#x529b;&#x3067;&#x3059;&#x304c;&#x3001;&#x304b;&#x306a;&#x308a;&#x5197;&#x9577;&#x3067;&#x3001;&#x578b;&#x306b;&#x5b89;&#x5168;&#x3067;&#x306a;&#x3044;&#x305f;&#x3081; IDE &#x3084;&#x30e6;&#x30cb;&#x30c3;&#x30c8;&#x30c6;&#x30b9;&#x30c8;&#x306e;&#x6a5f;&#x80fd;&#x3092;&#x30d5;&#x30eb;&#x306b;&#x6d3b;&#x7528;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x305b;&#x3093;&#x3002;&#x65e2;&#x306b;&#x30b9;&#x30bf;&#x30fc;&#x30c8;&#x30ac;&#x30a4;&#x30c9;&#x306e;&#x7ae0;&#x3067; Mapper &#x3092;&#x4f7f;&#x3046;&#x4f8b;&#x304c;&#x51fa;&#x3066;&#x304d;&#x307e;&#x3057;&#x305f;&#x3002;</p>
  
<p>&#x30de;&#x30c3;&#x30d7;&#x30c9;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x969b;&#x306f; Mapper &#x30af;&#x30e9;&#x30b9;&#x3092;&#x4f7f;&#x3063;&#x305f;&#x65b9;&#x6cd5;&#x304c;&#x3088;&#x308a;&#x4e00;&#x822c;&#x7684;&#x3067;&#x3059;&#x3002;Mapper &#x30af;&#x30e9;&#x30b9;&#x306f; SqlSession &#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306b;&#x5bfe;&#x5fdc;&#x3057;&#x305f;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x5b9a;&#x7fa9;&#x3092;&#x6301;&#x3064;&#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3067;&#x3059;&#x3002;&#x6b21;&#x306e;&#x4f8b;&#x306f;&#x3001;Mapper &#x30af;&#x30e9;&#x30b9;&#x3067;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c; SqlSession &#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3068;&#x3069;&#x306e;&#x3088;&#x3046;&#x306b;&#x5bfe;&#x5fdc;&#x3057;&#x3066;&#x3044;&#x308b;&#x304b;&#x3092;&#x8868;&#x3057;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>public interface AuthorMapper {
  // (Author) selectOne(&quot;selectAuthor&quot;,5);
  Author selectAuthor(int id);
  // (List&lt;Author&gt;) selectList(&#x201c;selectAuthors&#x201d;)
  List&lt;Author&gt; selectAuthors();
  // (Map&lt;Integer,Author&gt;) selectMap(&quot;selectAuthors&quot;, &quot;id&quot;)
  @MapKey(&quot;id&quot;)
  Map&lt;Integer, Author&gt; selectAuthors();
  // insert(&quot;insertAuthor&quot;, author)
  int insertAuthor(Author author);
  // updateAuthor(&quot;updateAuthor&quot;, author)
  int updateAuthor(Author author);
  // delete(&quot;deleteAuthor&quot;,5)
  int deleteAuthor(int id);
}</code></pre>
  
<p>&#x57fa;&#x672c;&#x7684;&#x306b;&#x3001;&#x305d;&#x308c;&#x305e;&#x308c;&#x306e; Mapper &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x30b7;&#x30b0;&#x30cd;&#x30c1;&#x30e3;&#x306f;&#x3001;&#x5bfe;&#x5fdc;&#x3059;&#x308b; SqlSession &#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x30b7;&#x30b0;&#x30cd;&#x30c1;&#x30e3;&#x304b;&#x3089;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e; ID &#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b; String &#x578b;&#x306e;&#x5f15;&#x6570;&#x3092;&#x9664;&#x3044;&#x305f;&#x3082;&#x306e;&#x306b;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e; ID &#x306f;&#x5f15;&#x6570;&#x3067;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x306e;&#x3067;&#x306f;&#x306a;&#x304f;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x540d;&#x304b;&#x3089;&#x53d6;&#x5f97;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</p>
  
<p>&#x623b;&#x308a;&#x5024;&#x306e;&#x578b;&#x306b;&#x3064;&#x3044;&#x3066;&#x88dc;&#x8db3;&#x3057;&#x3066;&#x304a;&#x304f;&#x3068;&#x3001;&#x30af;&#x30a8;&#x30ea;&#x306e;&#x7d50;&#x679c;&#x304c;&#x5358;&#x4e00;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x5834;&#x5408;&#x306f;&#x305d;&#x306e;&#x578b;&#x3068;&#x4e00;&#x81f4;&#x3057;&#x3066;&#x3044;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308a;&#x3001;&#x8907;&#x6570;&#x306e;&#x5834;&#x5408;&#x306f;&#x914d;&#x5217;&#x307e;&#x305f;&#x306f;&#x30b3;&#x30ec;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;&#x30d7;&#x30ea;&#x30df;&#x30c6;&#x30a3;&#x30d6;&#x3001;Map, POJO, JavaBean &#x306a;&#x3069;&#x901a;&#x5e38;&#x306e;&#x578b;&#x306f;&#x4e00;&#x901a;&#x308a;&#x6307;&#x5b9a;&#x53ef;&#x80fd;&#x3067;&#x3059;&#x3002;</p>
  
<p><span class="label important">NOTE</span> Mapper &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x306f;&#x3001;&#x4ed6;&#x306e;&#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3092;&#x5b9f;&#x88c5;&#x3057;&#x305f;&#x308a;&#x3001;&#x4ed6;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x3092;&#x7d99;&#x627f;&#x3059;&#x308b;&#x5fc5;&#x8981;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x30b7;&#x30b0;&#x30cd;&#x30c1;&#x30e3;&#x304b;&#x3089;&#x5bfe;&#x5fdc;&#x3059;&#x308b;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x8b58;&#x5225;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x306b;&#x306a;&#x3063;&#x3066;&#x3044;&#x308c;&#x3070; OK &#x3067;&#x3059;&#x3002;</p>
  
<p><span class="label important">NOTE</span> Mapper &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x306f;&#x4ed6;&#x306e;&#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3092;&#x7d99;&#x627f;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;Mapper &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3092; XML &#x3068;&#x7d44;&#x307f;&#x5408;&#x308f;&#x305b;&#x3066;&#x4f7f;&#x3046;&#x5834;&#x5408;&#x306f;&#x3001;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x304c;&#x6b63;&#x3057;&#x3044;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x306b;&#x542b;&#x307e;&#x308c;&#x308b;&#x3088;&#x3046;&#x306b;&#x6ce8;&#x610f;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;&#x307e;&#x305f;&#x552f;&#x4e00;&#x306e;&#x5236;&#x9650;&#x3068;&#x3057;&#x3066;&#x3001;&#x7d99;&#x627f;&#x95a2;&#x4fc2;&#x306b;&#x3042;&#x308b;&#x8907;&#x6570;&#x306e;&#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x306b;&#x540c;&#x3058;&#x30b7;&#x30b0;&#x30cd;&#x30c1;&#x30e3;&#x3092;&#x6301;&#x3064;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x5b9a;&#x7fa9;&#x3059;&#x308b;&#x3053;&#x3068;&#x306f;&#x3067;&#x304d;&#x307e;&#x305b;&#x3093;&#xff08;&#x305d;&#x3082;&#x305d;&#x3082;&#x826f;&#x3044;&#x8003;&#x3048;&#x3067;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#xff09;&#x3002;</p>
  
<p>Mapper &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306b;&#x8907;&#x6570;&#x306e;&#x5f15;&#x6570;&#x3092;&#x6e21;&#x3059;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x4e2d;&#x3067;&#x306f; #{param1}, #{param2} &#x306e;&#x3088;&#x3046;&#x306b;&#x5f15;&#x6570;&#x306e;&#x9806;&#x756a;&#x3092;&#x5909;&#x6570;&#x540d;&#x3068;&#x3057;&#x3066;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;&#x6570;&#x5b57;&#x3067;&#x306f;&#x306a;&#x304f;&#x5206;&#x304b;&#x308a;&#x3084;&#x3059;&#x3044;&#x540d;&#x524d;&#x3067;&#x5f15;&#x6570;&#x3092;&#x53c2;&#x7167;&#x3057;&#x305f;&#x3044;&#x5834;&#x5408;&#x306f;&#x3001;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3063;&#x3066; @Param(&quot;paramName&quot;) &#x306e;&#x3088;&#x3046;&#x306b;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#xff08;&#x5f15;&#x6570;&#x304c;&#x8907;&#x6570;&#x5b58;&#x5728;&#x3059;&#x308b;&#x5834;&#x5408;&#x306e;&#x307f;&#xff09;&#x3002;</p>
  
<p>&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066; RowBounds &#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x6e21;&#x3059;&#x3068;&#x30af;&#x30a8;&#x30ea;&#x7d50;&#x679c;&#x306e;&#x884c;&#x6570;&#x3092;&#x5236;&#x9650;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>

  </section><section><a id="Mapper_.E3.82.A2.E3.83.8E.E3.83.86.E3.83.BC.E3.82.B7.E3.83.A7.E3.83.B3"></a>
<h5>Mapper &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;</h5>
  
<p>MyBatis &#x306f;&#x5f53;&#x521d;&#x304b;&#x3089; XML &#x99c6;&#x52d5;&#x578b;&#x306e;&#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;&#x3067;&#x3057;&#x305f;&#x3002;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x306f; XML &#x3067;&#x3057;&#x305f;&#x3057;&#x3001;&#x30de;&#x30c3;&#x30d7;&#x30c9;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3082; XML &#x3067;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;MyBatis 3 &#x304b;&#x3089;&#x306f;&#x65b0;&#x3057;&#x3044;&#x30aa;&#x30d7;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x8ffd;&#x52a0;&#x3055;&#x308c;&#x307e;&#x3057;&#x305f;&#x3002;MyBatis 3 &#x306f;&#x5305;&#x62ec;&#x7684;&#x3067;&#x5f37;&#x529b;&#x306a; Java &#x30d9;&#x30fc;&#x30b9;&#x306e; Configuration API &#x306e;&#x4e0a;&#x306b;&#x69cb;&#x7bc9;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e; Configuration API &#x304c;&#x3001;XML &#x306b;&#x3088;&#x308b;&#x8a2d;&#x5b9a;&#x3068;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x3088;&#x308b;&#x8a2d;&#x5b9a;&#x306e;&#x57fa;&#x790e;&#x3068;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3046;&#x3068;&#x3001;&#x30b7;&#x30f3;&#x30d7;&#x30eb;&#x306a;&#x30de;&#x30c3;&#x30d7;&#x30c9;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x7121;&#x99c4;&#x306a;&#x304f;&#x5b9f;&#x88c5;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>
  
<p><span class="label important">NOTE</span> &#x6b8b;&#x5ff5;&#x306a;&#x304c;&#x3089;&#x3001;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x8868;&#x73fe;&#x529b;&#x3068;&#x67d4;&#x8edf;&#x6027;&#x306b;&#x306f;&#x5236;&#x9650;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x8abf;&#x67fb;&#x3084;&#x8a66;&#x884c;&#x932f;&#x8aa4;&#x306b;&#x591a;&#x304f;&#x306e;&#x6642;&#x9593;&#x3092;&#x8cbb;&#x3084;&#x3057;&#x305f;&#x306b;&#x3082;&#x95a2;&#x308f;&#x3089;&#x305a;&#x3001;&#x8907;&#x96d1;&#x306a;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3092;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3067;&#x5b9f;&#x73fe;&#x3059;&#x308b;&#x3053;&#x3068;&#x306f;&#x3067;&#x304d;&#x307e;&#x305b;&#x3093;&#x3002;&#xff08;&#x4f8b;&#x3048;&#x3070;&#xff09;C# &#x306e; Attributes &#x306b;&#x306f;&#x3053;&#x306e;&#x3088;&#x3046;&#x306a;&#x5236;&#x9650;&#x304c;&#x7121;&#x3044;&#x306e;&#x3067;&#x3001;MyBatis.NET &#x3067;&#x306f; XML &#x306e;&#x4ee3;&#x308f;&#x308a;&#x306b; Attributes &#x3092;&#x6d3b;&#x7528;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;&#x3068;&#x306f;&#x8a00;&#x3063;&#x3066;&#x3082;&#x3001;Java &#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x3082;&#x5229;&#x70b9;&#x304c;&#x7121;&#x3044;&#x308f;&#x3051;&#x3067;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002;</p>
  
<p><strong>&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x4e00;&#x89a7;&#xff1a;</strong></p>
  
<table class="table table-striped">
    <thead>
      
<tr class="a">
        
<th>&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;</th>
        
<th>Target</th>
        
<th>&#x5bfe;&#x5fdc;&#x3059;&#x308b; XML &#x8981;&#x7d20;</th>
        
<th>&#x8aac;&#x660e;</th>
      </tr>
    </thead>
    <tbody>
      
<tr class="b">
        
<td><code>@CacheNamespace</code></td>
        
<td><code>Class</code></td>
        
<td><code>&lt;cache&gt;</code></td>
        
<td>&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4ed8;&#x52a0;&#x3057;&#x305f;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#xff08;&#xff1d;&#x30af;&#x30e9;&#x30b9;&#xff09;&#x306b;&#x5bfe;&#x3059;&#x308b;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x3092;&#x8a2d;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>implementation</code>, <code>eviction</code>, <code>flushInterval</code>, <code>size</code>, <code>readWrite</code>, <code>blocking</code>, <code>properties</code></td>
      </tr>
      
<tr class="a">
        
<td><code>@Property</code></td>
        
<td>N/A</td>
        
<td><code>&lt;property&gt;</code></td>
        
<td>&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x5024;&#x307e;&#x305f;&#x306f;&#x30d7;&#x30ec;&#x30fc;&#x30b9;&#x30db;&#x30eb;&#x30c0;(<code>mybatis-config.xml</code>&#x3067;&#x5b9a;&#x7fa9;&#x3057;&#x305f;&#x69cb;&#x6210;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x3067;&#x7f6e;&#x304d;&#x63db;&#x3048;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x308b;)&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>name</code>, <code>value</code>&#x3002; (MyBatis 3.4.2+&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)</td>
      </tr>
      
<tr class="b">
        
<td><code>@CacheNamespaceRef</code></td>
        
<td><code>Class</code></td>
        
<td><code>&lt;cacheRef&gt;</code></td>
        
<td>
          &#x5225;&#x306e;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x306b;&#x5bfe;&#x3057;&#x3066;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x306e;&#x8a2d;&#x5b9a;&#x3092;&#x53c2;&#x7167;&#x3057;&#x307e;&#x3059;&#x3002;XML &#x30de;&#x30c3;&#x30d1;&#x30fc;&#x3067;&#x5ba3;&#x8a00;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x306f;&#x3001;namespace &#x306b;&#x540c;&#x4e00; FQCN &#x304c;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x3066;&#x3082;&#x72ec;&#x7acb;&#x3057;&#x305f;&#x30ad;&#x30e3;&#x30c3;&#x30b7;&#x30e5;&#x3068;&#x3057;&#x3066;&#x6271;&#x308f;&#x308c;&#x307e;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>value</code>, <code>name</code>
          &#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x5834;&#x5408;&#x306f;&#x3001;<code>value</code>&#x307e;&#x305f;&#x306f;<code>name</code>&#x5c5e;&#x6027;&#x306e;&#x3069;&#x3061;&#x3089;&#x304b;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;
          <code>value</code>&#x5c5e;&#x6027;&#x306b;&#x306f;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x3092;&#x793a;&#x3059;Java&#x578b;(&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x540d;&#x306f;&#x6307;&#x5b9a;&#x3057;&#x305f;Java&#x578b;&#x306e;FQCN&#x306b;&#x306a;&#x308b;)&#x3092;&#x3001;
          <code>name</code>&#x5c5e;&#x6027;(&#x3053;&#x306e;&#x5c5e;&#x6027;&#x306f;3.4.2&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)&#x306b;&#x306f;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x3092;&#x793a;&#x3059;&#x540d;&#x524d;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;
        </td>
      </tr>
      
<tr class="a">
        
<td><code>@ConstructorArgs</code></td>
        
<td><code>Method</code></td>
        
<td><code>&lt;constructor&gt;</code></td>
        
<td>&#x7d50;&#x679c;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x30b3;&#x30f3;&#x30b9;&#x30c8;&#x30e9;&#x30af;&#x30bf;&#x30fc;&#x306b;&#x6e21;&#x3059;&#x7d50;&#x679c;&#x306e;&#x30b0;&#x30eb;&#x30fc;&#x30d7;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;&#x5358;&#x4e00;&#x5024; <code>value</code> &#x3068;&#x3057;&#x3066; <code>Arg</code> &#x306e;&#x914d;&#x5217;&#x3092;&#x53d6;&#x308a;&#x307e;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="b">
        
<td><code>@Arg</code></td>
        
<td>N/A</td>
        
<td>
          
<ul>
            
<li><code>&lt;arg&gt;</code></li>
            
<li><code>&lt;idArg&gt;</code></li>
          </ul>
        </td>
        
<td>ConstructorArgs &#x306b;&#x542b;&#x307e;&#x308c;&#x308b;&#x500b;&#x3005;&#x306e;&#x30b3;&#x30f3;&#x30b9;&#x30c8;&#x30e9;&#x30af;&#x30bf;&#x30fc;&#x5f15;&#x6570;&#x3067;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>id</code>,
        <code>column</code>, <code>javaType</code>, <code>jdbcType</code>, <code>typeHandler</code>, <code>select</code>,
        <code>resultMap</code>. id &#x306f;&#x771f;&#x507d;&#x5024;&#x3067;&#x3001;&#x6307;&#x5b9a;&#x3057;&#x305f;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x304c;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x3092;&#x30e6;&#x30cb;&#x30fc;&#x30af;&#x306b;&#x8b58;&#x5225;&#x3067;&#x304d;&#x308b;&#x5024;&#x3067;&#x3042;&#x308b;&#x3053;&#x3068;&#x3092;&#x8868;&#x3057;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e;&#x50cd;&#x304d;&#x306f; XML &#x8981;&#x7d20;&#x306e; <code>&lt;idArg&gt;</code> &#x306b;&#x76f8;&#x5f53;&#x3057;&#x307e;&#x3059;&#x3002;
        3.5.4&#x4ee5;&#x964d;&#x3067;&#x306f;&#x3001;&#x7e70;&#x308a;&#x8fd4;&#x3057;&#x53ef;&#x80fd;&#x306a;&#x6ce8;&#x91c8;&#x3068;&#x3057;&#x3066;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="a">
        
<td><code>@TypeDiscriminator</code></td>
        
<td><code>Method</code></td>
        
<td><code>&lt;discriminator&gt;</code></td>
        
<td>&#x4f7f;&#x7528;&#x3059;&#x308b;&#x7d50;&#x679c;&#x30de;&#x30c3;&#x30d7;&#x3092;&#x6c7a;&#x5b9a;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e; Case &#x306e;&#x30b0;&#x30eb;&#x30fc;&#x30d7;&#x3092;&#x69cb;&#x6210;&#x3057;&#x307e;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>column</code>,
        <code>javaType</code>, <code>jdbcType</code>, <code>typeHandler</code>, <code>cases</code>. case &#x306e;&#x5024;&#x306f; <code>Case</code> &#x306e;&#x914d;&#x5217;&#x3067;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="b">
        
<td><code>@Case</code></td>
        
<td>N/A</td>
        
<td><code>&lt;case&gt;</code></td>
        
<td>&#x5024;&#x3068;&#x5bfe;&#x5fdc;&#x3059;&#x308b;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3092;&#x542b;&#x3080;&#x500b;&#x3005;&#x306e;&#x5224;&#x5b9a;&#x6761;&#x4ef6;&#x3067;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>value</code>, <code>type</code>,
        <code>results</code>. results &#x306f; Result &#x306e;&#x914d;&#x5217;&#x3092;&#x5024;&#x306b;&#x53d6;&#x308b;&#x306e;&#x3067;&#x3001;&#x3053;&#x306e; Case &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306f;&#x6b21;&#x306b;&#x6319;&#x3052;&#x308b; <code>Results</code> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x3088;&#x3063;&#x3066;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x308b;&#x5b9f;&#x969b;&#x306e; resultMap &#x306b;&#x8fd1;&#x3044;&#x3082;&#x306e;&#x3067;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="a">
        
<td><code>@Results</code></td>
        
<td><code>Method</code></td>
        
<td><code>&lt;resultMap&gt;</code></td>
        
<td>&#x3042;&#x308b;&#x7d50;&#x679c;&#x5217;&#x3068;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x307e;&#x305f;&#x306f;&#x30d5;&#x30a3;&#x30fc;&#x30eb;&#x30c9;&#x306e;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x60c5;&#x5831;&#x3092;&#x5b9a;&#x7fa9;&#x3059;&#x308b; Results &#x306e;&#x30ea;&#x30b9;&#x30c8;&#x3067;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>value</code>, <code>id</code>. value &#x5c5e;&#x6027;&#x306f; <code>Result</code> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x914d;&#x5217;&#x3067;&#x3059;&#x3002; id &#x5c5e;&#x6027;&#x3067;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x60c5;&#x5831;&#x306e;&#x540d;&#x524d;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="b">
        
<td><code>@Result</code></td>
        
<td>N/A</td>
        
<td>
          
<ul>
            
<li><code>&lt;result&gt;</code></li>
            
<li><code>&lt;id&gt;</code></li>
          </ul>
        </td>
        
<td>&#x3042;&#x308b;&#x7d50;&#x679c;&#x5217;&#x3068;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x307e;&#x305f;&#x306f;&#x30d5;&#x30a3;&#x30fc;&#x30eb;&#x30c9;&#x306e;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x60c5;&#x5831;&#x3092;&#x5b9a;&#x7fa9;&#x3057;&#x307e;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>id</code>, <code>column</code>,
        <code>property</code>, <code>javaType</code>, <code>jdbcType</code>, <code>typeHandler</code>, <code>one</code>,
        <code>many</code>. id &#x306f;&#x771f;&#x507d;&#x5024;&#x3067;&#x3001;&#x305d;&#x306e;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x304c;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x6bd4;&#x8f03;&#x306b;&#x4f7f;&#x3046;&#x3088;&#x3046;&#x6307;&#x793a;&#x3057;&#x307e;&#x3059;&#xff08;XML &#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x306b;&#x304a;&#x3051;&#x308b; id &#x8981;&#x7d20;&#x3068;&#x307b;&#x307c;&#x540c;&#x3058;&#x3067;&#x3059;&#xff09;&#x3002;one &#x306f; XML &#x306b;&#x304a;&#x3051;&#x308b; association &#x8981;&#x7d20;&#x306b;&#x3001;many &#x306f; collection &#x8981;&#x7d20;&#x306b;&#x76f8;&#x5f53;&#x3057;&#x307e;&#x3059;&#xff08;&#x30af;&#x30e9;&#x30b9;&#x540d;&#x306e;&#x30b3;&#x30f3;&#x30d5;&#x30ea;&#x30af;&#x30c8;&#x3092;&#x907f;&#x3051;&#x308b;&#x305f;&#x3081;&#x7570;&#x306a;&#x308b;&#x540d;&#x79f0;&#x304c;&#x4f7f;&#x308f;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#xff09;&#x3002;
        3.5.4&#x4ee5;&#x964d;&#x3067;&#x306f;&#x3001;&#x7e70;&#x308a;&#x8fd4;&#x3057;&#x53ef;&#x80fd;&#x306a;&#x6ce8;&#x91c8;&#x3068;&#x3057;&#x3066;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="a">
        
<td><code>@One</code></td>
        
<td>N/A</td>
        
<td><code>&lt;association&gt;</code></td>
        
<td>&#x8907;&#x96d1;&#x578b;&#x306e;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x306e;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x60c5;&#x5831;&#x3092;&#x5b9a;&#x7fa9;&#x3057;&#x307e;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>select</code>, <code>fetchType</code>, <code>resultMap</code>(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;), <code>columnPrefix</code>(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;).
        select &#x306f;&#x9069;&#x5207;&#x306a;&#x578b;&#x3092;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x308b;&#x30de;&#x30c3;&#x30d7;&#x30c9;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#xff08;Mapper &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#xff09;&#x306e;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3067;&#x3059;&#x3002;
        fetchType &#x306f;&#x30b0;&#x30ed;&#x30fc;&#x30d0;&#x30eb;&#x306a;&#x8a2d;&#x5b9a; <code>lazyLoadingEnabled</code> &#x3092;&#x30aa;&#x30fc;&#x30d0;&#x30fc;&#x30e9;&#x30a4;&#x30c9;&#x3059;&#x308b;&#x5834;&#x5408;&#x306b;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;
        resultMap &#x306f;&#x7d50;&#x679c;&#x5217;&#x3092;&#x5358;&#x4e00;&#x306e;&#x30b3;&#x30f3;&#x30c6;&#x30ca;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;(JavaBean&#x306a;&#x3069;)&#x3078;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x7d50;&#x679c;&#x30de;&#x30c3;&#x30d7;&#x306e;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;
        columnPrefix &#x306f;&#x30cd;&#x30b9;&#x30c8;&#x3057;&#x305f;&#x7d50;&#x679c;&#x30de;&#x30c3;&#x30d7;&#x3067;&#x7d50;&#x679c;&#x5217;&#x3092;&#x30b0;&#x30eb;&#x30fc;&#x30d7;&#x5316;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x30ab;&#x30e9;&#x30e0;&#x540d;&#x306e;&#x30d7;&#x30ec;&#x30d5;&#x30a3;&#x30c3;&#x30af;&#x30b9;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;
        <span class="label important">NOTE</span> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3; API &#x3067;&#x306f;&#x7d50;&#x5408;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x304c;&#x30b5;&#x30dd;&#x30fc;&#x30c8;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x305b;&#x3093;&#x3002;&#x3053;&#x308c;&#x306f; Java &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3067;&#x306f;&#x5faa;&#x74b0;&#x53c2;&#x7167;&#x304c;&#x8a31;&#x53ef;&#x3055;&#x308c;&#x306a;&#x3044;&#x305f;&#x3081;&#x3067;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="b">
        
<td><code>@Many</code></td>
        
<td>N/A</td>
        
<td><code>&lt;collection&gt;</code></td>
        
<td>&#x8907;&#x96d1;&#x578b;&#x306e;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x306e;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x60c5;&#x5831;&#x3092;&#x5b9a;&#x7fa9;&#x3057;&#x307e;&#x3059;&#x3002;&#x5c5e;&#x6027;: <code>select</code>, <code>fetchType</code>, <code>resultMap</code>(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;), <code>columnPrefix</code>(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;).
        select &#x306f;&#x9069;&#x5207;&#x306a;&#x578b;&#x306e;&#x30b3;&#x30ec;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x8aad;&#x307f;&#x8fbc;&#x3080;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x308b;&#x30de;&#x30c3;&#x30d7;&#x30c9;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#xff08;Mapper &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#xff09;&#x306e;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3067;&#x3059;&#x3002;
        fetchType &#x306f;&#x30b0;&#x30ed;&#x30fc;&#x30d0;&#x30eb;&#x306a;&#x8a2d;&#x5b9a; <code>lazyLoadingEnabled</code> &#x3092;&#x30aa;&#x30fc;&#x30d0;&#x30fc;&#x30e9;&#x30a4;&#x30c9;&#x3059;&#x308b;&#x5834;&#x5408;&#x306b;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;
        resultMap &#x306f;&#x7d50;&#x679c;&#x5217;&#x3092;&#x30b3;&#x30ec;&#x30af;&#x30b7;&#x30e7;&#x30f3;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;(JavaBean&#x306e;&#x30ea;&#x30b9;&#x30c8;&#x306a;&#x3069;)&#x3078;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x7d50;&#x679c;&#x30de;&#x30c3;&#x30d7;&#x306e;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;
        columnPrefix &#x306f;&#x30cd;&#x30b9;&#x30c8;&#x3057;&#x305f;&#x7d50;&#x679c;&#x30de;&#x30c3;&#x30d7;&#x3067;&#x7d50;&#x679c;&#x5217;&#x3092;&#x30b0;&#x30eb;&#x30fc;&#x30d7;&#x5316;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x30ab;&#x30e9;&#x30e0;&#x540d;&#x306e;&#x30d7;&#x30ec;&#x30d5;&#x30a3;&#x30c3;&#x30af;&#x30b9;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;
        <span class="label important">NOTE</span> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3; API &#x3067;&#x306f;&#x7d50;&#x5408;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x304c;&#x30b5;&#x30dd;&#x30fc;&#x30c8;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x305b;&#x3093;&#x3002;&#x3053;&#x308c;&#x306f; Java &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3067;&#x306f;&#x5faa;&#x74b0;&#x53c2;&#x7167;&#x304c;&#x8a31;&#x53ef;&#x3055;&#x308c;&#x306a;&#x3044;&#x305f;&#x3081;&#x3067;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="a">
        
<td><code>@MapKey</code></td>
        
<td><code>Method</code></td>
        
<td> </td>
        
<td>&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306f; Map &#x3092;&#x8fd4;&#x3059;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306b;&#x4ed8;&#x52a0;&#x3057;&#x307e;&#x3059;&#x3002;&#x7d50;&#x679c;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x30ea;&#x30b9;&#x30c8;&#x3092; Map &#x3068;&#x3057;&#x3066;&#x8fd4;&#x3059;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;&#x5358;&#x4e00;&#x5024; <code>value</code> &#x306f;&#x3001;&#x7d50;&#x679c;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x3067;&#x3001;Map &#x306e;&#x30ad;&#x30fc;&#x3068;&#x3057;&#x3066;&#x4f7f;&#x7528;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="b">
        
<td><code>@Options</code></td>
        
<td><code>Method</code></td>
        
<td>&#x30de;&#x30c3;&#x30d7;&#x30c9;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5c5e;&#x6027;</td>
        
<td>&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3046;&#x3068;&#x3001;&#x901a;&#x5e38;&#x30de;&#x30c3;&#x30d7;&#x30c9;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5c5e;&#x6027;&#x3068;&#x3057;&#x3066;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x308b;&#x591a;&#x69d8;&#x306a;&#x30b9;&#x30a4;&#x30c3;&#x30c1;&#x3084;&#x8a2d;&#x5b9a;&#x30aa;&#x30d7;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x30a2;&#x30af;&#x30bb;&#x30b9;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;<code>Options</code> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x3088;&#x3063;&#x3066;&#x3001;&#x5404;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x8907;&#x96d1;&#x5316;&#x3059;&#x308b;&#x3053;&#x3068;&#x306a;&#x304f;&#x3001;&#x4e00;&#x8cab;&#x3057;&#x305f;&#x30af;&#x30ea;&#x30fc;&#x30f3;&#x306a;&#x65b9;&#x6cd5;&#x3067;&#x8a2d;&#x5b9a;&#x306b;&#x30a2;&#x30af;&#x30bb;&#x30b9;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x5de5;&#x592b;&#x3055;&#x308c;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x30ad;&#x30fc;: Attributes:
        <code>useCache=true</code>, <code>flushCache=FlushCachePolicy.DEFAULT</code>, <code>resultSetType=DEFAULT</code>,
        <code>statementType=PREPARED</code>, <code>fetchSize=-1</code>, <code>timeout=-1</code>,
        <code>useGeneratedKeys=false</code>, <code>keyProperty=&quot;&quot;</code>, <code>keyColumn=&quot;&quot;</code>, <code>resultSets=&quot;&quot;</code>,
        <code>databaseId=&quot;&quot;</code>.
        Java &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3046;&#x5834;&#x5408;&#x3001;&#x5024;&#x3068;&#x3057;&#x3066; <code>null</code> &#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x306f;&#x3067;&#x304d;&#x306a;&#x3044;&#x3068;&#x3044;&#x3046;&#x5236;&#x9650;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x3053;&#x308c;&#x306f;&#x3069;&#x3046;&#x3044;&#x3046;&#x3053;&#x3068;&#x304b;&#x3068;&#x3044;&#x3046;&#x3068;&#x3001;<code>Options</code> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4ed8;&#x52a0;&#x3057;&#x305f;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306b;&#x306f;&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x306e;&#x30aa;&#x30d7;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x9069;&#x7528;&#x3055;&#x308c;&#x308b;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;&#x4e88;&#x671f;&#x3057;&#x306a;&#x3044;&#x52d5;&#x4f5c;&#x3092;&#x9632;&#x3050;&#x305f;&#x3081;&#x3001;&#x5404;&#x30aa;&#x30d7;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x5024;&#x3092;&#x628a;&#x63e1;&#x3057;&#x3066;&#x304a;&#x304f;&#x3088;&#x3046;&#x306b;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;
        <code>databaseId</code>(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)&#xff1a;<code>DatabaseIdProvider</code>&#x306e;&#x8a2d;&#x5b9a;&#x304c;&#x3042;&#x308b;&#x5834;&#x5408;&#x306f;&#x3001;
        MyBatis&#x306f;<code>databaseId</code>&#x306e;&#x6307;&#x5b9a;&#x304c;&#x306a;&#x3044;&#x3082;&#x306e;&#x307e;&#x305f;&#x306f;<code>DatabaseIdProvider</code>&#x304c;&#x63d0;&#x4f9b;&#x3059;&#x308b;&#x5024;&#x3068;&#x4e00;&#x81f4;&#x3059;&#x308b;&#x3082;&#x306e;&#x3092;&#x5229;&#x7528;&#x3057;&#x307e;&#x3059;&#x3002;
        &#x3082;&#x3057;<code>databaseId</code>&#x306e;&#x6307;&#x5b9a;&#x304c;&#x3042;&#x308b;&#x3082;&#x306e;&#x3068;&#x306a;&#x3044;&#x3082;&#x306e;&#x3092;&#x4e21;&#x65b9;&#x898b;&#x3064;&#x3051;&#x305f;&#x5834;&#x5408;&#x306f;&#x3001;&#x5f8c;&#x8005;&#x306f;&#x7834;&#x68c4;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;<br /><br />

        <code>keyColumn</code> &#x306f;&#x7279;&#x5b9a;&#x306e;&#x30c7;&#x30fc;&#x30bf;&#x30d9;&#x30fc;&#x30b9;&#xff08;Oracle &#x3084; PostgreSQL &#x306a;&#x3069;&#xff09;&#x3067;&#x306e;&#x307f;&#x5fc5;&#x9808;&#x3068;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;
        <code>keyColumn</code> &#x3068; <code>keyProperty</code> &#x306b;&#x5bfe;&#x3057;&#x3066;&#x6307;&#x5b9a;&#x53ef;&#x80fd;&#x306a;&#x5024;&#x306b;&#x3064;&#x3044;&#x3066;&#x306f;&#x3001;&#x4e0a;&#x3067;&#x51fa;&#x3066;&#x304d;&#x305f; insert &#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306b;&#x3064;&#x3044;&#x3066;&#x306e;&#x8aac;&#x660e;&#x3092;&#x53c2;&#x7167;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;</td>
      </tr>
      
<tr class="a">
        
<td>
          
<ul>
            
<li><code>@Insert</code></li>
            
<li><code>@Update</code></li>
            
<li><code>@Delete</code></li>
            
<li><code>@Select</code></li>
          </ul>
        </td>
        
<td><code>Method</code></td>
        
<td>
          
<ul>
            
<li><code>&lt;insert&gt;</code></li>
            
<li><code>&lt;update&gt;</code></li>
            
<li><code>&lt;delete&gt;</code></li>
            
<li><code>&lt;select&gt;</code></li>
          </ul>
        </td>
        
<td>
          &#x3053;&#x308c;&#x3089;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306f;&#x3001;&#x305d;&#x308c;&#x305e;&#x308c;&#x5b9f;&#x884c;&#x5bfe;&#x8c61;&#x306e; SQL &#x306b;&#x5bfe;&#x5fdc;&#x3057;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x5404;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306f; String &#x306e;&#x914d;&#x5217;&#xff08;&#x5358;&#x4e00;&#x306e; String &#x3067;&#x3082; OK&#xff09;&#x3092;&#x5f15;&#x6570;&#x306b;&#x53d6;&#x308a;&#x307e;&#x3059;&#x3002;
          &#x6e21;&#x3055;&#x308c;&#x305f; String &#x306e;&#x914d;&#x5217;&#x306f;&#x3001;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x533a;&#x5207;&#x308a;&#x3067;&#x9023;&#x7d50;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;&#x3053;&#x308c;&#x306b;&#x3088;&#x3063;&#x3066;&#x3001;Java &#x306e;&#x30b3;&#x30fc;&#x30c9;&#x5185;&#x3067; SQL &#x3092;&#x69cb;&#x7bc9;&#x3059;&#x308b;&#x3068;&#x304d;&#x306b;&#x826f;&#x304f;&#x3042;&#x308b; '&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x306e;&#x4ed8;&#x3051;&#x5fd8;&#x308c;' &#x306b;&#x3088;&#x308b;&#x30d0;&#x30b0;&#x3092;&#x9632;&#x3050;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;&#x4e00;&#x5fdc;&#x3001;'+' &#x8a18;&#x53f7;&#x3067;&#x9023;&#x7d50;&#x3057;&#x305f;&#x6587;&#x5b57;&#x5217;&#x3092;&#x5f15;&#x6570;&#x3068;&#x3059;&#x308b;&#x3053;&#x3068;&#x3082;&#x53ef;&#x80fd;&#x3067;&#x3059;&#x3002;
          <code>value</code>&#xff1a;SQL &#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x69cb;&#x6210;&#x3059;&#x308b; String &#x306e;&#x914d;&#x5217;&#x3067;&#x3059;&#x3002;
          <code>databaseId</code>(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)&#xff1a;<code>DatabaseIdProvider</code>&#x306e;&#x8a2d;&#x5b9a;&#x304c;&#x3042;&#x308b;&#x5834;&#x5408;&#x306f;&#x3001;
          MyBatis&#x306f;<code>databaseId</code>&#x306e;&#x6307;&#x5b9a;&#x304c;&#x306a;&#x3044;&#x3082;&#x306e;&#x307e;&#x305f;&#x306f;<code>DatabaseIdProvider</code>&#x304c;&#x63d0;&#x4f9b;&#x3059;&#x308b;&#x5024;&#x3068;&#x4e00;&#x81f4;&#x3059;&#x308b;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5229;&#x7528;&#x3057;&#x307e;&#x3059;&#x3002;
          &#x3082;&#x3057;<code>databaseId</code>&#x306e;&#x6307;&#x5b9a;&#x304c;&#x3042;&#x308b;&#x3082;&#x306e;&#x3068;&#x306a;&#x3044;&#x3082;&#x306e;&#x3092;&#x4e21;&#x65b9;&#x898b;&#x3064;&#x3051;&#x305f;&#x5834;&#x5408;&#x306f;&#x3001;&#x5f8c;&#x8005;&#x306f;&#x7834;&#x68c4;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;
        </td>
      </tr>
      
<tr class="b">
        
<td>
          
<ul>
            
<li><code>@InsertProvider</code></li>
            
<li><code>@UpdateProvider</code></li>
            
<li><code>@DeleteProvider</code></li>
            
<li><code>@SelectProvider</code></li>
          </ul>
        </td>
        
<td><code>Method</code></td>
        
<td>
          
<ul>
            
<li><code>&lt;insert&gt;</code></li>
            
<li><code>&lt;update&gt;</code></li>
            
<li><code>&lt;delete&gt;</code></li>
            
<li><code>&lt;select&gt;</code></li>
          </ul>
        </td>
        
<td>&#x3053;&#x308c;&#x3089;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306f;&#x52d5;&#x7684; SQL &#x3092;&#x751f;&#x6210;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x3082;&#x306e;&#x3067;&#x3059;&#x3002;&#x5b9f;&#x884c;&#x6642;&#x306b;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x547c;&#x3073;&#x51fa;&#x3055;&#x308c;&#x3001;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304b;&#x3089;&#x8fd4;&#x3055;&#x308c;&#x305f; SQL &#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x304c;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x307e;&#x3059; (MyBatis 3.4.6&#x4ee5;&#x964d;&#x3067;&#x306f;&#x3001;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x8fd4;&#x308a;&#x5024;&#x3068;&#x3057;&#x3066; <code>String</code> &#x3067;&#x306f;&#x306a;&#x304f; <code>CharSequence</code> &#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;)&#x3002;
        &#x30de;&#x30c3;&#x30d7;&#x30c9;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x969b;&#x3001;&#x30d7;&#x30ed;&#x30d0;&#x30a4;&#x30c0;&#x30fc;&#x306b;&#x3088;&#x3063;&#x3066;&#x6307;&#x5b9a;&#x3057;&#x305f;&#x30af;&#x30e9;&#x30b9;&#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x304c;&#x4f5c;&#x6210;&#x3055;&#x308c;&#x3001;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;
        &#x306a;&#x304a;&#x3001;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x5f15;&#x6570;&#x306b;&#x306f;Mapper&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x5f15;&#x6570;&#x306b;&#x6e21;&#x3057;&#x305f;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306b;&#x52a0;&#x3048;&#x3001;<code>ProviderContext</code>(MyBatis 3.4.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)&#x3092;&#x4ecb;&#x3057;&#x3066;&#x300c;Mapper&#x30a4;&#x30f3;&#x30bf;&#x30d5;&#x30a7;&#x30fc;&#x30b9;&#x306e;&#x578b;&#x300d;&#x300c;Mapper&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x300d;&#x300c;&#x30c7;&#x30fc;&#x30bf;&#x30d9;&#x30fc;&#x30b9;ID&#x300d;&#x3092;&#x6e21;&#x3059;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;(MyBatis 3.4&#x4ee5;&#x964d;&#x3067;&#x306f;&#x3001;&#x8907;&#x6570;&#x306e;&#x5f15;&#x6570;&#x3092;&#x6e21;&#x3059;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;)
        &#x30ad;&#x30fc;: <code>value</code>, <code>type</code>, <code>method</code>.
        <code>value</code> &#x3068; <code>type</code> &#x306b;&#x306f;&#x30af;&#x30e9;&#x30b9;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;
        (<code>type</code> &#x306f; <code>value</code> &#x306e;&#x5225;&#x540d;&#x3067;&#x3001;&#x3069;&#x3061;&#x3089;&#x304b;&#x4e00;&#x65b9;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;
        &#x305f;&#x3060;&#x3057;&#x3001;&#x30b0;&#x30ed;&#x30fc;&#x30d0;&#x30eb;&#x8a2d;&#x5b9a;&#x3068;&#x3057;&#x3066;<code>defaultSqlProviderType</code>&#x3092;&#x6307;&#x5b9a;&#x3057;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x306f;&#x4e21;&#x65b9;&#x3068;&#x3082;&#x7701;&#x7565;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;)&#x3002;
        <code>method</code> &#x306b;&#x306f;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x540d;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;
        (MyBatis 3.5.1&#x4ee5;&#x964d;&#x3067;&#x306f;&#x3001;<code>method</code> &#x5c5e;&#x6027;&#x3092;&#x7701;&#x7565;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;&#x305d;&#x306e;&#x969b;MyBatis&#x306f;&#x3001;<code>ProviderMethodResolver</code> &#x30a4;&#x30f3;&#x30bf;&#x30d5;&#x30a7;&#x30fc;&#x30b9;&#x3092;&#x4ecb;&#x3057;&#x3066;&#x5bfe;&#x8c61;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x89e3;&#x6c7a;&#x3092;&#x8a66;&#x307f;&#x3001;
        &#x5bfe;&#x8c61;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x89e3;&#x6c7a;&#x3067;&#x304d;&#x306a;&#x3044;&#x5834;&#x5408;&#x306f;&#x3001;<code>provideSql</code>&#x3068;&#x3044;&#x3046;&#x540d;&#x524d;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x4ee3;&#x66ff;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3068;&#x3057;&#x3066;&#x5229;&#x7528;&#x3057;&#x307e;&#x3059;)&#x3002;
        <code>databaseId</code>(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)&#xff1a;<code>DatabaseIdProvider</code>&#x306e;&#x8a2d;&#x5b9a;&#x304c;&#x3042;&#x308b;&#x5834;&#x5408;&#x306f;&#x3001;
        MyBatis&#x306f;<code>databaseId</code>&#x306e;&#x6307;&#x5b9a;&#x304c;&#x306a;&#x3044;&#x3082;&#x306e;&#x307e;&#x305f;&#x306f;<code>DatabaseIdProvider</code>&#x304c;&#x63d0;&#x4f9b;&#x3059;&#x308b;&#x5024;&#x3068;&#x4e00;&#x81f4;&#x3059;&#x308b;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x5229;&#x7528;&#x3057;&#x307e;&#x3059;&#x3002;
        &#x3082;&#x3057;<code>databaseId</code>&#x306e;&#x6307;&#x5b9a;&#x304c;&#x3042;&#x308b;&#x3082;&#x306e;&#x3068;&#x306a;&#x3044;&#x3082;&#x306e;&#x3092;&#x4e21;&#x65b9;&#x898b;&#x3064;&#x3051;&#x305f;&#x5834;&#x5408;&#x306f;&#x3001;&#x5f8c;&#x8005;&#x306f;&#x7834;&#x68c4;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;

        <span class="label important">NOTE</span> &#x6b21;&#x306e;&#x7ae0;&#x3067;&#x3001;&#x30af;&#x30ea;&#x30fc;&#x30f3;&#x3067;&#x53ef;&#x8aad;&#x6027;&#x306e;&#x9ad8;&#x3044;&#x30b3;&#x30fc;&#x30c9;&#x3067;&#x52d5;&#x7684; SQL &#x3092;&#x69cb;&#x7bc9;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x306b;&#x3064;&#x3044;&#x3066;&#x8aac;&#x660e;&#x3057;&#x307e;&#x3059;&#x3002;
</td>
      </tr>
      
<tr class="a">
        
<td><code>@Param</code></td>
        
<td><code>Parameter</code></td>
        
<td>N/A</td>
        
<td>Mapper &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x8907;&#x6570;&#x306e;&#x5f15;&#x6570;&#x3092;&#x53d6;&#x308b;&#x5834;&#x5408;&#x3001;&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4ed8;&#x52a0;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;&#x5404;&#x5f15;&#x6570;&#x3092;&#x540d;&#x524d;&#x3067;&#x53c2;&#x7167;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x306b;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x306a;&#x3044;&#x5834;&#x5408;&#x3001;&#x5404;&#x5f15;&#x6570;&#x306f;&#x4f4d;&#x7f6e;&#x3092;&#x8868;&#x3059;&#x6570;&#x5b57;&#x3067; <code>#{param1}</code>, <code>#{param2}</code> &#x306e;&#x3088;&#x3046;&#x306b;&#x53c2;&#x7167;&#x3057;&#x307e;&#x3059;&#xff08;<code>RowBounds</code> &#x5f15;&#x6570;&#x306f;&#x30ab;&#x30a6;&#x30f3;&#x30c8;&#x3057;&#x307e;&#x305b;&#x3093;&#xff09;&#x3002;
        &#x5f15;&#x6570;&#x306b; <code>@Param(&quot;person&quot;)</code> &#x3068;&#x3044;&#x3046;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4ed8;&#x52a0;&#x3059;&#x308b;&#x3068;&#x3001;&#x3053;&#x306e;&#x5f15;&#x6570;&#x306f; <code>#{person}</code> &#x3068;&#x3057;&#x3066;&#x53c2;&#x7167;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x306b;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="b">
        
<td><code>@SelectKey</code></td>
        
<td><code>Method</code></td>
        
<td><code>&lt;selectKey&gt;</code></td>
        
<td>&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092; <code>@Insert</code>, <code>@InsertProvider</code>, <code>@Update</code>, <code>@UpdateProvider</code> &#x304c;&#x4ed8;&#x52a0;&#x3055;&#x308c;&#x305f;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306b;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;&#x3001;XML &#x306e; <code>&lt;selectKey&gt;</code> &#x306b;&#x76f8;&#x5f53;&#x3059;&#x308b;&#x6a5f;&#x80fd;&#x3092;&#x5b9f;&#x73fe;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#xff08;&#x4ed6;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306b;&#x8ffd;&#x52a0;&#x3057;&#x3066;&#x3082;&#x7121;&#x8996;&#x3055;&#x308c;&#x307e;&#x3059;&#xff09;&#x3002;<code>@SelectKey</code> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x3001;<code>@Options</code> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3084;&#x8a2d;&#x5b9a;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x306b;&#x3088;&#x308b;&#x30ad;&#x30fc;&#x306e;&#x81ea;&#x52d5;&#x751f;&#x6210;&#x306b;&#x95a2;&#x3059;&#x308b;&#x8a2d;&#x5b9a;&#x306f;&#x7121;&#x8996;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;
        &#x5c5e;&#x6027;: <code>statement</code> SQL &#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x69cb;&#x6210;&#x3059;&#x308b; String &#x306e;&#x914d;&#x5217;&#x3067;&#x3059;&#x3002; <code>keyProperty</code> &#x306f;&#x81ea;&#x52d5;&#x751f;&#x6210;&#x3055;&#x308c;&#x305f;&#x30ad;&#x30fc;&#x306e;&#x5024;&#x304c;&#x8a2d;&#x5b9a;&#x3055;&#x308c;&#x308b;&#x5f15;&#x6570;&#x30aa;&#x30d6;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;<code>before</code> insert &#x306e;&#x524d;&#x306b;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x5834;&#x5408;&#x306f; true&#x3001;&#x5f8c;&#x306b;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x5834;&#x5408;&#x306f; false &#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;<code>resultType</code> &#x306f; keyProperty &#x3067;&#x6307;&#x5b9a;&#x3057;&#x305f;&#x30d7;&#x30ed;&#x30d1;&#x30c6;&#x30a3;&#x306e; Java &#x30bf;&#x30a4;&#x30d7;&#x3067;&#x3059;&#x3002;<code>statementType</code> &#x306f;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x7a2e;&#x985e;&#x3067; STATEMENT, PREPARED, CALLABLE &#x306e;&#x3044;&#x305a;&#x308c;&#x304b;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#xff08;&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x306f; PREPARED&#xff09;&#x3002;
        <code>databaseId</code>(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)&#xff1a;<code>DatabaseIdProvider</code>&#x306e;&#x8a2d;&#x5b9a;&#x304c;&#x3042;&#x308b;&#x5834;&#x5408;&#x306f;&#x3001;
        MyBatis&#x306f;<code>databaseId</code>&#x306e;&#x6307;&#x5b9a;&#x304c;&#x306a;&#x3044;&#x3082;&#x306e;&#x307e;&#x305f;&#x306f;<code>DatabaseIdProvider</code>&#x304c;&#x63d0;&#x4f9b;&#x3059;&#x308b;&#x5024;&#x3068;&#x4e00;&#x81f4;&#x3059;&#x308b;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5229;&#x7528;&#x3057;&#x307e;&#x3059;&#x3002;
        &#x3082;&#x3057;<code>databaseId</code>&#x306e;&#x6307;&#x5b9a;&#x304c;&#x3042;&#x308b;&#x3082;&#x306e;&#x3068;&#x306a;&#x3044;&#x3082;&#x306e;&#x3092;&#x4e21;&#x65b9;&#x898b;&#x3064;&#x3051;&#x305f;&#x5834;&#x5408;&#x306f;&#x3001;&#x5f8c;&#x8005;&#x306f;&#x7834;&#x68c4;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;
        </td>
      </tr>
      
<tr class="a">
        
<td><code>@ResultMap</code></td>
        
<td><code>Method</code></td>
        
<td>N/A</td>
        
<td>&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092; <code>@Select</code> &#x307e;&#x305f;&#x306f; <code>@SelectProvider</code> &#x304c;&#x4ed8;&#x52a0;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306b;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;&#x3001;&#x7d50;&#x679c;&#x306e;&#x30de;&#x30c3;&#x30d4;&#x30f3;&#x30b0;&#x306b; XML &#x306e; Mapper &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3067;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b; resultMap &#x8981;&#x7d20;&#x3092;&#x5229;&#x7528;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;&#x306e; id &#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;&#x5358;&#x4e00;&#x5024;&#x306e; <code>value</code> &#x306b;&#x306f; resultMap &#x306e; id &#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306f; <code>@Results</code> &#x3084; <code>@ConstructorArgs</code> &#x306b;&#x3088;&#x308b;&#x6307;&#x5b9a;&#x3088;&#x308a;&#x3082;&#x512a;&#x5148;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="b">
        
<td><code>@ResultType</code></td>
        
<td><code>Method</code></td>
        
<td>N/A</td>
        
<td>ResultHandler &#x3092;&#x4f7f;&#x3046;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3067;&#x306f;&#x623b;&#x308a;&#x5024;&#x306e;&#x578b;&#x304c; void &#x3068;&#x306a;&#x308b;&#x306e;&#x3067;&#x3001;&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x5404;&#x884c;&#x306e;&#x30c7;&#x30fc;&#x30bf;&#x3092;&#x3069;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x306b;&#x30de;&#x30c3;&#x30d7;&#x3059;&#x308b;&#x304b;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;XML&#x306e; ResultMap &#x304c;&#x5b58;&#x5728;&#x3059;&#x308b;&#x5834;&#x5408;&#x306f; @ResultMap &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3067;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;XML &#x306e; <code>&lt;select&gt;</code> &#x8981;&#x7d20;&#x3067; resultType &#x304c;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x306f;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306b;&#x3088;&#x308b;&#x6307;&#x5b9a;&#x306f;&#x4e0d;&#x8981;&#x3067;&#x3059;&#x3002;&#x305d;&#x308c;&#x4ee5;&#x5916;&#x306e;&#x5834;&#x5408;&#x3001;&#x4f8b;&#x3048;&#x3070; @Select &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x304c;&#x4ed8;&#x52a0;&#x3055;&#x308c;&#x305f;&#x5f15;&#x6570;&#x306b; ResultHandler &#x3092;&#x542b;&#x3080;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x5834;&#x5408;&#x306f;&#x623b;&#x308a;&#x5024;&#x306e;&#x578b;&#x306f; void &#x3067;&#x3042;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308b;&#x306e;&#x3067;&#x3001;&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#xff08;&#x3042;&#x308b;&#x3044;&#x306f; @ResultMap&#xff09;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x578b;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;&#x623b;&#x308a;&#x5024;&#x306e;&#x578b;&#x304c; void &#x4ee5;&#x5916;&#x306e;&#x5834;&#x5408;&#x3001;&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306f;&#x7121;&#x8996;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</td>
      </tr>
      
<tr class="a">
        
<td><code>@Flush</code></td>
        
<td><code>Method</code></td>
        
<td>N/A</td>
        
<td>&#x3053;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x3068;&#x3001;<code>SqlSession#flushStatements()</code>&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092; Mapper &#x30a4;&#x30f3;&#x30bf;&#x30d5;&#x30a7;&#x30fc;&#x30b9;&#x306b;&#x5b9a;&#x7fa9;&#x3057;&#x305f;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x7d4c;&#x7531;&#x3067;&#x547c;&#x3073;&#x51fa;&#x3059;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;(MyBatis 3.3&#x4ee5;&#x4e0a;)</td>
      </tr>
    </tbody>
  </table>

  </section><section><a id="Mapper_.E3.82.A2.E3.83.8E.E3.83.86.E3.83.BC.E3.82.B7.E3.83.A7.E3.83.B3.E3.81.AE.E3.82.B5.E3.83.B3.E3.83.97.E3.83.AB"></a>
<h5>Mapper &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30b5;&#x30f3;&#x30d7;&#x30eb;</h5>
  
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f; @SelectKey &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3063;&#x3066; insert &#x524d;&#x306b;&#x30b7;&#x30fc;&#x30b1;&#x30f3;&#x30b9;&#x306e;&#x5024;&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;&#x4f8b;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>@Insert(&quot;insert into table3 (id, name) values(#{nameId}, #{name})&quot;)
@SelectKey(statement=&quot;call next value for TestSequence&quot;, keyProperty=&quot;nameId&quot;, before=<strong>true</strong>, resultType=<strong>int.class</strong>)
<strong>int</strong> insertTable3(Name name);</code></pre>

  
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f; @SelectKey &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3063;&#x3066; insert &#x5f8c;&#x306b; identity &#x306e;&#x5024;&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;&#x4f8b;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>@Insert(&quot;insert into table2 (name) values(#{name})&quot;)
@SelectKey(statement=&quot;call identity()&quot;, keyProperty=&quot;nameId&quot;, before=<strong>false</strong>, resultType=<strong>int.class</strong>)
<strong>int</strong> insertTable2(Name name);</code></pre>

  
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f; <code>@Flush</code> &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x3063;&#x3066; <code>SqlSession#flushStatements()</code>&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3059;&#x4f8b;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>@Flush
List&lt;BatchResult&gt; flush();</code></pre>

  
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f; @Results &#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e; id &#x5c5e;&#x6027;&#x3067;&#x540d;&#x524d;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x4f8b;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>@Results(id = &quot;userResult&quot;, value = {
  @Result(property = &quot;id&quot;, column = &quot;uid&quot;, id = <strong>true</strong>),
  @Result(property = &quot;firstName&quot;, column = &quot;first_name&quot;),
  @Result(property = &quot;lastName&quot;, column = &quot;last_name&quot;)
})
@Select(&quot;select * from users where id = #{id}&quot;)
User getUserById(Integer id);

@Results(id = &quot;companyResults&quot;)
@ConstructorArgs({
  @Arg(column = &quot;cid&quot;, javaType = Integer.class, id = <strong>true</strong>),
  @Arg(column = &quot;name&quot;, javaType = String.class)
})
@Select(&quot;select * from company where id = #{id}&quot;)
Company getCompanyById(Integer id);</code></pre>

  
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f; SQL&#x30d7;&#x30ed;&#x30d0;&#x30a4;&#x30c0;&#x30fc;&#x7528;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x7528;&#x3057;&#x3066;&#x3001;&#x30d1;&#x30e9;&#x30e1;&#x30fc;&#x30bf;&#x3092;&#x3072;&#x3068;&#x3064;&#x53d7;&#x3051;&#x53d6;&#x308b;&#x4f8b;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>@SelectProvider(type = UserSqlBuilder.class, method = &quot;buildGetUsersByName&quot;)
List&lt;User&gt; getUsersByName(String name);

class UserSqlBuilder {
  public static String buildGetUsersByName(final String name) {
    return new SQL(){{
      SELECT(&quot;*&quot;);
      FROM(&quot;users&quot;);
      if (name != null) {
        WHERE(&quot;name like #{value} || '%'&quot;);
      }
      ORDER_BY(&quot;id&quot;);
    }}.toString();
  }
}</code></pre>

  
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f; SQL&#x30d7;&#x30ed;&#x30d0;&#x30a4;&#x30c0;&#x30fc;&#x7528;&#x306e;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x4f7f;&#x7528;&#x3057;&#x3066;&#x3001;&#x8907;&#x6570;&#x30d1;&#x30e9;&#x30e1;&#x30fc;&#x30bf;&#x3092;&#x3072;&#x3068;&#x3064;&#x53d7;&#x3051;&#x53d6;&#x308b;&#x4f8b;&#x3067;&#x3059;&#x3002;</p>
  
<pre class="prettyprint"><code>@SelectProvider(type = UserSqlBuilder.class, method = &quot;buildGetUsersByName&quot;)
List&lt;User&gt; getUsersByName(
    @Param(&quot;name&quot;) String name, @Param(&quot;orderByColumn&quot;) String orderByColumn);

class UserSqlBuilder {

  // @Param&#x3092;&#x4f7f;&#x308f;&#x306a;&#x3044;&#x5834;&#x5408;&#x306f;, Mapper&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3068;&#x540c;&#x3058;&#x5f15;&#x6570;&#x3067;&#x5b9a;&#x7fa9;&#x3059;&#x308b;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;
  public static String buildGetUsersByName(
      final String name, final String orderByColumn) {
    return new SQL(){{
      SELECT(&quot;*&quot;);
      FROM(&quot;users&quot;);
      WHERE(&quot;name like #{name} || '%'&quot;);
      ORDER_BY(orderByColumn);
    }}.toString();
  }

  // @Param&#x3092;&#x4f7f;&#x3046;&#x5834;&#x5408;&#x306f;, &#x5fc5;&#x8981;&#x306a;&#x5f15;&#x6570;&#x306e;&#x307f;&#x5b9a;&#x7fa9;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;
  public static String buildGetUsersByName(@Param(&quot;orderByColumn&quot;) final String orderByColumn) {
    return new SQL(){{
      SELECT(&quot;*&quot;);
      FROM(&quot;users&quot;);
      WHERE(&quot;name like #{name} || '%'&quot;);
      ORDER_BY(orderByColumn);
    }}.toString();
  }
}</code></pre>

    
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f;&#x3001;&#x30b0;&#x30ed;&#x30fc;&#x30d0;&#x30eb;&#x8a2d;&#x5b9a;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x5168;&#x3066;&#x306e;&#x30de;&#x30c3;&#x30d1;&#x30fc;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3067;&#x540c;&#x3058;SQL&#x30d7;&#x30ed;&#x30d0;&#x30a4;&#x30c0;&#x30af;&#x30e9;&#x30b9;&#x3092;&#x5229;&#x7528;&#x3059;&#x308b;&#x4f8b;&#x3067;&#x3059;&#x3002;(3.5.6&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)</p>
    
<pre class="prettyprint"><code>
Configuration configuration = new Configuration();
configuration.setDefaultSqlProviderType(TemplateFilePathProvider.class); // &#x5168;&#x3066;&#x306e;&#x30de;&#x30c3;&#x30d1;&#x30fc;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3067;&#x5229;&#x7528;&#x3059;&#x308b;SQL&#x30d7;&#x30ed;&#x30d0;&#x30a4;&#x30c0;&#x30af;&#x30e9;&#x30b9;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;
// ...</code></pre>
    
<pre class="prettyprint"><code>
// &#x5404;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306e;SQL&#x30d7;&#x30ed;&#x30d0;&#x30a4;&#x30c0;&#x30a2;&#x30ce;&#x30c6;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e; type &#x307e;&#x305f;&#x306f; value &#x5c5e;&#x6027;&#x306f;&#x7701;&#x7565;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x3001;
// &#x7701;&#x7565;&#x3057;&#x305f;&#x5834;&#x5408;&#x306f;MyBaits&#x306f;&#x30b0;&#x30ed;&#x30fc;&#x30d0;&#x30eb;&#x8a2d;&#x5b9a;&#x306e; defaultSqlProviderType &#x306b;&#x6307;&#x5b9a;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x30af;&#x30e9;&#x30b9;&#x3092;&#x9069;&#x7528;&#x3059;&#x308b;
public interface UserMapper {

  @SelectProvider // @SelectProvider(TemplateFilePathProvider.class) &#x3068;&#x540c;&#x7fa9;
  User findUser(int id);

  @InsertProvider // @InsertProvider(TemplateFilePathProvider.class) &#x3068;&#x540c;&#x7fa9;
  void createUser(User user);

  @UpdateProvider // @UpdateProvider(TemplateFilePathProvider.class) &#x3068;&#x540c;&#x7fa9;
  void updateUser(User user);

  @DeleteProvider // @DeleteProvider(TemplateFilePathProvider.class) &#x3068;&#x540c;&#x7fa9;
  void deleteUser(int id);
}</code></pre>

    
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f;&#x3001;<code>ProviderMethodResolver</code>(MyBatis 3.5.1&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)&#x306e;&#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x5b9f;&#x88c5;&#x306e;&#x5229;&#x7528;&#x4f8b;&#x3067;&#x3059;&#x3002;</p>
    
<pre class="prettyprint"><code>@SelectProvider(UserSqlProvider.class)
List&lt;User&gt; getUsersByName(String name);

// SQL&#x30d7;&#x30ed;&#x30d0;&#x30a4;&#x30c0;&#x30af;&#x30e9;&#x30b9;&#x306b;ProviderMethodResolver&#x3092;&#x5b9f;&#x88c5;&#x3059;&#x308b;
class UserSqlProvider implements ProviderMethodResolver {

  // &#x30c7;&#x30d5;&#x30a9;&#x30eb;&#x30c8;&#x5b9f;&#x88c5;&#x3067;&#x306f;&#x3001;&#x30de;&#x30c3;&#x30d1;&#x30fc;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3068;&#x540c;&#x540d;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304c;&#x5bfe;&#x8c61;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3068;&#x3057;&#x3066;&#x6271;&#x308f;&#x308c;&#x307e;&#x3059;&#x3002;
  public static String getUsersByName(final String name) {
    return new SQL(){{
      SELECT(&quot;*&quot;);
      FROM(&quot;users&quot;);
      if (name != null) {
        WHERE(&quot;name like #{value} || '%'&quot;);
      }
      ORDER_BY(&quot;id&quot;);
    }}.toString();
  }

}</code></pre>

    
<p>&#x6b21;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x306f;&#x3001;<code>databaseId</code>&#x5c5e;&#x6027;(3.5.5&#x4ee5;&#x964d;&#x3067;&#x5229;&#x7528;&#x53ef;&#x80fd;)&#x306e;&#x5229;&#x7528;&#x4f8b;&#x3067;&#x3059;&#x3002;</p>
    
<pre class="prettyprint"><code>
@Select(value = &quot;SELECT SYS_GUID() FROM dual&quot;, databaseId = &quot;oracle&quot;) // DatabaseIdProvider&#x304c;&#x63d0;&#x4f9b;&#x3059;&#x308b;&#x5024;&#x304c; &quot;oracle&quot; &#x306e;&#x6642;&#x306b;&#x3053;&#x306e;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5229;&#x7528;&#x3059;&#x308b;
@Select(value = &quot;SELECT uuid_generate_v4()&quot;, databaseId = &quot;postgres&quot;) // DatabaseIdProvider&#x304c;&#x63d0;&#x4f9b;&#x3059;&#x308b;&#x5024;&#x304c; &quot;postgres&quot; &#x306e;&#x6642;&#x306b;&#x3053;&#x306e;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5229;&#x7528;&#x3059;&#x308b;
@Select(&quot;SELECT RANDOM_UUID()&quot;) // DatabaseIdProvider&#x306e;&#x8a2d;&#x5b9a;&#x304c;&#x306a;&#x3044;&#x307e;&#x305f;&#x306f;DatabaseIdProvider&#x304c;&#x63d0;&#x4f9b;&#x3059;&#x308b;&#x5024;&#x306b;&#x4e00;&#x81f4;&#x3057;&#x306a;&#x3044;&#x6642;&#x306b;&#x3053;&#x306e;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x5229;&#x7528;&#x3059;&#x308b;
String generateId();
</code></pre>

  </section></section></section></section>

  </section>
  

        </main>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>©      2009–2024
<a href="https://www.mybatis.org/">MyBatis.org</a>
</p>
        </div>
      </div>
    </footer>
<script>
  if(anchors) {
    anchors.add();
  }
</script>
  </body>
</html>
