<!DOCTYPE html>
<!--
 | Generated by Apache Maven Doxia Site Renderer 1.9.2 from src/site/ja/xdoc/logging.xml at 26 12月 2021
 | Rendered using Apache Maven Fluido Skin 1.8
-->
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="generator" content="Apache Maven Doxia Site Renderer 1.9.2" />
    <meta name="author" content="Clinton Begin" />
    <meta name="author" content="Iwao AVE!" />
    <title>MyBatis &#x2013; MyBatis 3 | ロギング</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-1.8.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
    <script src="./js/apache-maven-fluido-1.8.min.js"></script>
  </head>
  <body class="topBarDisabled">
    <div class="container-fluid">
      <header>
        <div id="banner">
          <div class="pull-left"><div id="bannerLeft"><h2>mybatis</h2>
</div>
</div>
          <div class="pull-right"><a href="../../" id="bannerRight" title="MyBatis logo"><img src="../../images/mybatis-logo.png"  alt="MyBatis logo"/></a></div>
          <div class="clear"><hr/></div>
        </div>

        <div id="breadcrumbs">
          <ul class="breadcrumb">
        <li id="publishDate">最終更新: 26 12月 2021<span class="divider">|</span>
</li>
          <li id="projectVersion">バージョン: 3.5.9</li>
          </ul>
        </div>
      </header>
      <div class="row-fluid">
        <header id="leftColumn" class="span2">
          <nav class="well sidebar-nav">
  <ul class="nav nav-list">
   <li class="nav-header">Core</li>
    <li><a href="index.html" title="イントロダクション"><span class="none"></span>イントロダクション</a></li>
    <li><a href="getting-started.html" title="スタートガイド"><span class="none"></span>スタートガイド</a></li>
    <li><a href="configuration.html" title="設定"><span class="icon-chevron-right"></span>設定</a></li>
    <li><a href="sqlmap-xml.html" title="Mapper XML ファイル"><span class="icon-chevron-right"></span>Mapper XML ファイル</a></li>
    <li><a href="dynamic-sql.html" title="動的 SQL"><span class="none"></span>動的 SQL</a></li>
    <li><a href="java-api.html" title="Java API"><span class="icon-chevron-right"></span>Java API</a></li>
    <li><a href="statement-builders.html" title="ステートメントビルダー"><span class="icon-chevron-right"></span>ステートメントビルダー</a></li>
    <li class="active"><a href="#"><span class="none"></span>ロギング</a></li>
   <li class="nav-header">プロジェクト文書</li>
    <li><a href="project-info.html" title="プロジェクト情報"><span class="icon-chevron-right"></span>プロジェクト情報</a></li>
    <li><a href="project-reports.html" title="プロジェクトレポート"><span class="icon-chevron-right"></span>プロジェクトレポート</a></li>
  </ul>
          </nav>
          <div class="well sidebar-nav">
            <hr />
            <div id="poweredBy">
              <div class="clear"></div>
              <div class="clear"></div>
              <div class="clear"></div>
<a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy"><img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" /></a>
            </div>
          </div>
        </header>
        <main id="bodyColumn"  class="span10" >


  
    <section>
<h2><a name="a.E3.83.AD.E3.82.AE.E3.83.B3.E3.82.B0"></a>&#x30ed;&#x30ae;&#x30f3;&#x30b0;</h2>
      
<p></p>
      
<p>MyBatis &#x306f;&#x3001;&#x5185;&#x90e8;&#x306e; Log Factory &#x3092;&#x901a;&#x3057;&#x3066;&#x30ed;&#x30b0;&#x60c5;&#x5831;&#x3092;&#x51fa;&#x529b;&#x3057;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e; Log Factory &#x306f;&#x3001;&#x30ed;&#x30b0;&#x60c5;&#x5831;&#x3092;&#x6b21;&#x306b;&#x6319;&#x3052;&#x308b;&#x5b9f;&#x88c5;&#x306e;&#x3044;&#x305a;&#x308c;&#x304b;&#x306b;&#x59d4;&#x8b72;&#xff08;delegate&#xff09;&#x3057;&#x307e;&#x3059;&#x3002;
      </p>
      
<ul>
        
<li>
          SLF4J
        </li>
        
<li>
          Apache Commons Logging
        </li>
        
<li>
          Log4j 2
        </li>
        
<li>
          Log4j (3.5.9&#x4ee5;&#x964d;&#x975e;&#x63a8;&#x5968;)
        </li>
        
<li>
          JDK logging
        </li>
      </ul>
      
<p>&#x5b9f;&#x969b;&#x306b;&#x4f7f;&#x7528;&#x3055;&#x308c;&#x308b;&#x306e;&#x306f;&#x3001;MyBatis &#x5185;&#x90e8;&#x306e; Log Factory &#x304c;&#x691c;&#x51fa;&#x3057;&#x305f;&#x5b9f;&#x88c5;&#x306b;&#x306a;&#x308a;&#x307e;&#x3059;&#x3002;MyBatis &#x306e; Log Factory &#x306f;&#x4e0a;&#x306b;&#x6319;&#x3052;&#x305f;&#x9806;&#x756a;&#x3067;&#x30ed;&#x30ae;&#x30f3;&#x30b0;&#x5b9f;&#x88c5;&#x3092;&#x691c;&#x7d22;&#x3057;&#x3001;&#x6700;&#x521d;&#x306b;&#x898b;&#x3064;&#x3051;&#x305f;&#x5b9f;&#x88c5;&#x3092;&#x4f7f;&#x7528;&#x3057;&#x307e;&#x3059;&#x3002;&#x4e0a;&#x8a18;&#x306e;&#x5b9f;&#x88c5;&#x304c;&#x691c;&#x51fa;&#x3067;&#x304d;&#x306a;&#x304b;&#x3063;&#x305f;&#x5834;&#x5408;&#x3001;&#x30ed;&#x30b0;&#x306f;&#x51fa;&#x529b;&#x3055;&#x308c;&#x307e;&#x305b;&#x3093;&#x3002;
      </p>
      
<p>&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x30b5;&#x30fc;&#x30d0;&#x30fc;&#x3067;&#x306f;&#x3001;&#x51fa;&#x8377;&#x6642;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x306b; Commons Logging &#x304c;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x308b;&#x3053;&#x3068;&#x304c;&#x3088;&#x304f;&#x3042;&#x308a;&#x307e;&#x3059;&#xff08;Tomcat &#x3084; WebSphere &#x306f;&#x826f;&#x3044;&#x4f8b;&#x3067;&#x3057;&#x3087;&#x3046;&#xff09;&#x3002;&#x91cd;&#x8981;&#x306a;&#x306e;&#x306f;&#x3001;&#x3053;&#x306e;&#x3088;&#x3046;&#x306a;&#x74b0;&#x5883;&#x3067;&#x306f; MyBatis &#x306f; Commons Logging &#x3092;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;&#x3053;&#x308c;&#x306f;&#x3064;&#x307e;&#x308a;&#x3001;&#x72ec;&#x81ea;&#x306e; Commons Logging &#x5b9f;&#x88c5;&#x3092;&#x4f7f;&#x3046; WebSphere &#x306e;&#x3088;&#x3046;&#x306a;&#x74b0;&#x5883;&#x3067;&#x306f;&#x3001;&#x3042;&#x306a;&#x305f;&#x304c;&#x8ffd;&#x52a0;&#x3057;&#x305f; Log4J &#x306e;&#x8a2d;&#x5b9a;&#x306f;&#x7121;&#x8996;&#x3055;&#x308c;&#x308b;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3092;&#x610f;&#x5473;&#x3057;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;&#x3053;&#x306e;&#x73fe;&#x8c61;&#x304c;&#x5384;&#x4ecb;&#x306a;&#x306e;&#x306f;&#x3001;MyBatis &#x304c; Log4J &#x306e;&#x8a2d;&#x5b9a;&#x3092;&#x7121;&#x8996;&#x3057;&#x3066;&#x3044;&#x308b;&#x3088;&#x3046;&#x306b;&#x898b;&#x3048;&#x308b;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3059;&#xff08;&#x5b9f;&#x306f;&#x3001;&#x3053;&#x306e;&#x3088;&#x3046;&#x306a;&#x74b0;&#x5883;&#x3067;&#x306f; MyBatis &#x304c; Commons Loggin &#x3092;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x305f;&#x3081;&#x3001;Log4J &#x306e;&#x8a2d;&#x5b9a;&#x304c;&#x7121;&#x8996;&#x3055;&#x308c;&#x3066;&#x3044;&#x308b;&#x306e;&#x3067;&#x3059;&#xff09;&#x3002;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x306b; Commons Logging &#x3092;&#x542b;&#x3080;&#x74b0;&#x5883;&#x3067;&#x52d5;&#x4f5c;&#x3059;&#x308b;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3067;&#x3082;&#x3001;mybatis-config.xml &#x306b;&#x8a2d;&#x5b9a;&#x3092;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;&#x5225;&#x306e;&#x30ed;&#x30ae;&#x30f3;&#x30b0;&#x5b9f;&#x88c5;&#x3092;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;
      </p>

<div class="source"><pre class="prettyprint">
&lt;configuration&gt;
  &lt;settings&gt;
    ...
    &lt;setting name=&quot;logImpl&quot; value=&quot;LOG4J&quot;/&gt;
    ...
  &lt;/settings&gt;
&lt;/configuration&gt;
</pre></div>
      
<p>&#x6307;&#x5b9a;&#x53ef;&#x80fd;&#x306a;&#x5024;&#x306f; SLF4J, LOG4J, LOG4J2, JDK_LOGGING, COMMONS_LOGGING, STDOUT_LOGGING, NO_LOGGING &#x3067;&#x3059;&#x304c;&#x3001;<code>org.apache.ibatis.logging.Log</code> &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3092;&#x5b9f;&#x88c5;&#x3057;&#x3001;&#x30b3;&#x30f3;&#x30b9;&#x30c8;&#x30e9;&#x30af;&#x30bf;&#x30fc;&#x5f15;&#x6570;&#x3068;&#x3057;&#x3066; String &#x3092;&#x53d7;&#x3051;&#x53d6;&#x308b;&#x72ec;&#x81ea;&#x306b;&#x5b9f;&#x88c5;&#x3057;&#x305f;&#x30af;&#x30e9;&#x30b9;&#x306e;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x30af;&#x30e9;&#x30b9;&#x540d;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;
      </p>
      
<p>&#x4e0b;&#x8a18;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x547c;&#x3073;&#x51fa;&#x3059;&#x3053;&#x3068;&#x3067;&#x30ed;&#x30ae;&#x30f3;&#x30b0;&#x5b9f;&#x88c5;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x3082;&#x53ef;&#x80fd;&#x3067;&#x3059;&#x3002;
      </p>

<div class="source"><pre class="prettyprint">
org.apache.ibatis.logging.LogFactory.useSlf4jLogging();
org.apache.ibatis.logging.LogFactory.useLog4JLogging();
org.apache.ibatis.logging.LogFactory.useJdkLogging();
org.apache.ibatis.logging.LogFactory.useCommonsLogging();
org.apache.ibatis.logging.LogFactory.useStdOutLogging();
</pre></div>
      
<p>&#x3053;&#x308c;&#x3089;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;&#x3001;&#x4ed6;&#x306e; MyBatis &#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3088;&#x308a;&#x524d;&#x306b;&#x547c;&#x3073;&#x51fa;&#x3059;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;&#x307e;&#x305f;&#x3001;&#x8981;&#x6c42;&#x3055;&#x308c;&#x305f;&#x5b9f;&#x88c5;&#x304c;&#x5b9f;&#x884c;&#x6642;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x306b;&#x542b;&#x307e;&#x308c;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x306b;&#x306e;&#x307f;&#x5207;&#x308a;&#x66ff;&#x3048;&#x308b;&#x3053;&#x3068;&#x304c;&#x53ef;&#x80fd;&#x3067;&#x3059;&#x3002;&#x4f8b;&#x3048;&#x3070;&#x3001;Log4J2 &#x306b;&#x5207;&#x308a;&#x66ff;&#x3048;&#x3088;&#x3046;&#x3068;&#x3057;&#x3066;&#x3001;&#x5b9f;&#x884c;&#x6642;&#x306b; Log4J2 &#x304c;&#x898b;&#x3064;&#x304b;&#x3089;&#x306a;&#x3044;&#x5834;&#x5408;&#x3001;MyBatis &#x306f;&#x5207;&#x308a;&#x66ff;&#x3048;&#x306e;&#x8981;&#x6c42;&#x3092;&#x7121;&#x8996;&#x3057;&#x3066;&#x901a;&#x5e38;&#x306e;&#x30a2;&#x30eb;&#x30b4;&#x30ea;&#x30ba;&#x30e0;&#x3067;&#x30ed;&#x30ae;&#x30f3;&#x30b0;&#x5b9f;&#x88c5;&#x3092;&#x691c;&#x7d22;&#x3057;&#x307e;&#x3059;&#x3002;
      </p>
      
<p>SLF4J, Apache Commons Logging, Apache Log4J, JDK Logging API &#x306b;&#x3064;&#x3044;&#x3066;&#x306e;&#x8a73;&#x7d30;&#x306f;&#x3053;&#x306e;&#x30c9;&#x30ad;&#x30e5;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x7bc4;&#x56f2;&#x5916;&#x3068;&#x306a;&#x308a;&#x307e;&#x3059;&#x304c;&#x3001;&#x5f8c;&#x8ff0;&#x306e;&#x8a2d;&#x5b9a;&#x4f8b;&#x306f;&#x53c2;&#x8003;&#x306b;&#x306a;&#x308b;&#x3068;&#x601d;&#x3044;&#x307e;&#x3059;&#x3002;&#x3053;&#x308c;&#x3089;&#x306e;&#x30d5;&#x30ec;&#x30fc;&#x30e0;&#x30ef;&#x30fc;&#x30af;&#x306b;&#x3064;&#x3044;&#x3066;&#x306e;&#x8a73;&#x3057;&#x3044;&#x60c5;&#x5831;&#x306f;&#x3001;&#x4ee5;&#x4e0b;&#x306e;&#x5404;&#x30b5;&#x30a4;&#x30c8;&#x3092;&#x53c2;&#x7167;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;
      </p>
      
<ul>
        
<li>
          <a class="externalLink" href="http://www.slf4j.org/">SLF4J</a>
        </li>
        
<li>
          <a class="externalLink" href="http://commons.apache.org/logging">Apache Commons Logging</a>
        </li>
        
<li>
          <a class="externalLink" href="http://logging.apache.org/log4j/">Apache Log4j</a>
        </li>
        
<li>
          <a class="externalLink" href="https://docs.oracle.com/javase/8/docs/technotes/guides/logging/overview.html">JDK Logging API</a>
        </li>
      </ul>
      <section>
<h3><a name="Logging_Configuration"></a>Logging Configuration</h3>
        
<p>&#x5b9f;&#x884c;&#x3055;&#x308c;&#x308b;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x30ed;&#x30b0;&#x3092;&#x51fa;&#x529b;&#x3059;&#x308b;&#x305f;&#x3081;&#x306b;&#x306f;&#x3001;&#x30d1;&#x30c3;&#x30b1;&#x30fc;&#x30b8;&#x3001;Mapper &#x306e;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x3001;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x3001;&#x3042;&#x308b;&#x3044;&#x306f;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x5b8c;&#x5168;&#x4fee;&#x98fe;&#x540d;&#x306b;&#x5bfe;&#x3057;&#x3066;&#x30ed;&#x30b0;&#x51fa;&#x529b;&#x3092;&#x6709;&#x52b9;&#x306b;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;
        </p>
        
<p>&#x5177;&#x4f53;&#x7684;&#x306a;&#x8a2d;&#x5b9a;&#x65b9;&#x6cd5;&#x306f;&#x4f7f;&#x7528;&#x3059;&#x308b;&#x30ed;&#x30ae;&#x30f3;&#x30b0;&#x5b9f;&#x88c5;&#x306b;&#x3088;&#x308a;&#x307e;&#x3059;&#x3002;&#x4ee5;&#x4e0b;&#x306f; SLF4J(Logback) &#x3067;&#x306e;&#x8a2d;&#x5b9a;&#x4f8b;&#x3067;&#x3059;&#x3002;&#x30ed;&#x30ae;&#x30f3;&#x30b0;&#x30b5;&#x30fc;&#x30d3;&#x30b9;&#x306e;&#x8a2d;&#x5b9a;&#x306f;&#x3001;&#x5358;&#x7d14;&#x306b;&#x3044;&#x304f;&#x3064;&#x304b;&#x306e;&#x8a2d;&#x5b9a;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#xff08;&#x4f8b;&#x3048;&#x3070; <code>logback.xml</code>&#xff09;&#x3068;&#x3001;&#x5834;&#x5408;&#x306b;&#x3088;&#x3063;&#x3066;&#x306f;&#x65b0;&#x3057;&#x3044; JAR&#x3092;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x3060;&#x3051;&#x306e;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;&#x4ee5;&#x4e0b;&#x306f;&#x3001;SLF4J(Logback) &#x3092;&#x30d7;&#x30ed;&#x30d0;&#x30a4;&#x30c0;&#x30fc;&#x3068;&#x3057;&#x3066;&#x5b8c;&#x5168;&#x306a;&#x30ed;&#x30ae;&#x30f3;&#x30b0;&#x30b5;&#x30fc;&#x30d3;&#x30b9;&#x3092;&#x8a2d;&#x5b9a;&#x3059;&#x308b;&#x624b;&#x9806;&#x3067;&#x3059;&#x3002;
        </p>
        
<p></p>
        <section>
<h4><a name="a.E3.82.B9.E3.83.86.E3.83.83.E3.83.97.EF.BC.91:_SLF4J_.2B_Logback_.E3.81.AE_JAR_.E3.83.95.E3.82.A1.E3.82.A4.E3.83.AB.E3.82.92.E8.BF.BD.E5.8A.A0.E3.81.99.E3.82.8B.E3.80.82"></a>
          &#x30b9;&#x30c6;&#x30c3;&#x30d7;&#xff11;: SLF4J + Logback &#x306e; JAR &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x3002;
        </h4>
        
<p>SLF4J(Logback) &#x3092;&#x4f7f;&#x3046;&#x306e;&#x3067;&#x3001;SLF4J(Logback) &#x306e; JAR &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x304c;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x304b;&#x3089;&#x5229;&#x7528;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x306b;&#x3057;&#x3066;&#x304a;&#x304f;&#x5fc5;&#x8981;&#x304c;&#x3042;&#x308a;&#x307e;&#x3059;&#x3002;SLF4J(Logback) &#x306e; JAR &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x30c0;&#x30a6;&#x30f3;&#x30ed;&#x30fc;&#x30c9;&#x3057;&#x3066;&#x3042;&#x306a;&#x305f;&#x306e;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x306b;&#x8ffd;&#x52a0;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;
        </p>
        
<p>Web &#x3042;&#x308b;&#x3044;&#x306f;&#x30a8;&#x30f3;&#x30bf;&#x30fc;&#x30d7;&#x30e9;&#x30a4;&#x30ba;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x5834;&#x5408;&#x306f;&#x3001;&#x30c0;&#x30a6;&#x30f3;&#x30ed;&#x30fc;&#x30c9;&#x3057;&#x305f; <code>logback-classic.jar</code>
          ,<code>logback-core.jar</code>, <code>slf4j-api.jar</code> &#x3092; <code>WEB-INF/lib</code> &#x30c7;&#x30a3;&#x30ec;&#x30af;&#x30c8;&#x30ea;&#x306b;&#x8ffd;&#x52a0;&#x3057;&#x307e;&#x3059;&#x3002;&#x30b9;&#x30bf;&#x30f3;&#x30c9;&#x30a2;&#x30ed;&#x30fc;&#x30f3;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x5834;&#x5408;&#x306f;&#x8d77;&#x52d5;&#x6642;&#x306e; JVM &#x5f15;&#x6570; <code>-classpath</code> &#x306b;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x3060;&#x3051;&#x3067;&#x3059;&#x3002;
        </p>

        
<p>Maven&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x306f;&#x3001;<code>pom.xml</code>&#x306b;&#x4ee5;&#x4e0b;&#x306e;&#x3088;&#x3046;&#x306a;&#x8a2d;&#x5b9a;&#x3092;&#x8ffd;&#x52a0;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;JAR&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x30c0;&#x30a6;&#x30f3;&#x30ed;&#x30fc;&#x30c9;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;
        </p>

<div class="source"><pre class="prettyprint">
&lt;dependency&gt;
  &lt;groupId&gt;ch.qos.logback&lt;/groupId&gt;
  &lt;artifactId&gt;logback-classic&lt;/artifactId&gt;
  &lt;version&gt;1.x.x&lt;/version&gt;
&lt;/dependency&gt;
</pre></div>

        
<p></p>
        </section><section>
<h4><a name="a.E3.82.B9.E3.83.86.E3.83.83.E3.83.97.EF.BC.92:_Logback_.E3.82.92.E8.A8.AD.E5.AE.9A.E3.81.99.E3.82.8B.E3.80.82"></a>
          &#x30b9;&#x30c6;&#x30c3;&#x30d7;&#xff12;: Logback &#x3092;&#x8a2d;&#x5b9a;&#x3059;&#x308b;&#x3002;
        </h4>
        
<p>Logback &#x306e;&#x8a2d;&#x5b9a;&#x306f;&#x30b7;&#x30f3;&#x30d7;&#x30eb;&#x3067;&#x3059;&#x3002;&#x4f8b;&#x3048;&#x3070;&#x6b21;&#x306e; Mapper &#x306e;&#x30ed;&#x30b0;&#x3092;&#x51fa;&#x529b;&#x3059;&#x308b;&#x5834;&#x5408;&#xff1a;
        </p>
        
<div class="source"><pre class="prettyprint">
package org.mybatis.example;
public interface BlogMapper {
  @Select(&quot;SELECT * FROM blog WHERE id = #{id}&quot;)
  Blog selectBlog(int id);
}
</pre></div>
        
<p>&#x6b21;&#x306e;&#x30c6;&#x30ad;&#x30b9;&#x30c8;&#x3092;&#x542b;&#x3080; <code>logback.xml</code> &#x3068;&#x3044;&#x3046;&#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x4f5c;&#x6210;&#x3057;&#x3001;&#x30af;&#x30e9;&#x30b9;&#x30d1;&#x30b9;&#x306b;&#x914d;&#x7f6e;&#x3057;&#x307e;&#x3059;&#x3002;
        </p>


<div class="source"><pre class="prettyprint">
&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;!DOCTYPE configuration&gt;
&lt;configuration&gt;

  &lt;appender name=&quot;stdout&quot; class=&quot;ch.qos.logback.core.ConsoleAppender&quot;&gt;
    &lt;encoder&gt;
      &lt;pattern&gt;%5level [%thread] - %msg%n&lt;/pattern&gt;
    &lt;/encoder&gt;
  &lt;/appender&gt;

  &lt;logger name=&quot;org.mybatis.example.BlogMapper&quot;&gt;
    &lt;level value=&quot;trace&quot;/&gt;
  &lt;/logger&gt;
  &lt;root level=&quot;error&quot;&gt;
    &lt;appender-ref ref=&quot;stdout&quot;/&gt;
  &lt;/root&gt;

&lt;/configuration&gt;
</pre></div>

        
<p>&#x4e0a;&#x8a18;&#x306e;&#x3088;&#x3046;&#x306b;&#x8a2d;&#x5b9a;&#x3059;&#x308b;&#x3068;&#x3001;SLF4J(Logback) &#x306f; <code>org.mybatis.example.BlogMapper</code> &#x306b;&#x3064;&#x3044;&#x3066;&#x8a73;&#x7d30;&#x306a;&#x30ed;&#x30b0;&#x3092;&#x51fa;&#x529b;&#x3057;&#x3001;&#x305d;&#x308c;&#x4ee5;&#x5916;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x306b;&#x3064;&#x3044;&#x3066;&#x306f;&#x30a8;&#x30e9;&#x30fc;&#x306e;&#x307f;&#x3092;&#x51fa;&#x529b;&#x3057;&#x307e;&#x3059;&#x3002;</p>
        
<p>&#x30ed;&#x30b0;&#x306b;&#x51fa;&#x529b;&#x3055;&#x308c;&#x308b;&#x60c5;&#x5831;&#x3092;&#x7d30;&#x304b;&#x304f;&#x8abf;&#x6574;&#x3057;&#x305f;&#x3044;&#x306e;&#x306a;&#x3089;&#x3001;Mapper &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x5168;&#x4f53;&#x3067;&#x306f;&#x306a;&#x304f;&#x7279;&#x5b9a;&#x306e;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x3082;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>


<div class="source"><pre class="prettyprint">
&lt;logger name=&quot;org.mybatis.example.BlogMapper.selectBlog&quot;&gt;
  &lt;level value=&quot;trace&quot;/&gt;
&lt;/logger&gt;
</pre></div>

        
<p>&#x9006;&#x306b;&#x3001;&#x8907;&#x6570;&#x306e; Mapper &#x306b;&#x5bfe;&#x3059;&#x308b;&#x30ed;&#x30b0;&#x3092;&#x6709;&#x52b9;&#x5316;&#x3057;&#x305f;&#x3044;&#x5834;&#x5408;&#x3082;&#x3042;&#x308b;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x305d;&#x306e;&#x5834;&#x5408;&#x306f;&#x3001;&#x5bfe;&#x8c61;&#x3068;&#x306a;&#x308b; Mapper &#x3092;&#x542b;&#x3080;&#x30d1;&#x30c3;&#x30b1;&#x30fc;&#x30b8;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>


<div class="source"><pre class="prettyprint">
&lt;logger name=&quot;org.mybatis.example&quot;&gt;
  &lt;level value=&quot;trace&quot;/&gt;
&lt;/logger&gt;
</pre></div>

        
<p>&#x30af;&#x30a8;&#x30ea;&#x304c;&#x5927;&#x91cf;&#x306e;&#x7d50;&#x679c;&#x30bb;&#x30c3;&#x30c8;&#x3092;&#x8fd4;&#x3059;&#x3088;&#x3046;&#x306a;&#x30b1;&#x30fc;&#x30b9;&#x3067;SQL&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x307f;&#x3092;&#x51fa;&#x529b;&#x3057;&#x305f;&#x3044;&#x5834;&#x5408;&#x306b;&#x5bfe;&#x5fdc;&#x3067;&#x304d;&#x308b;&#x3088;&#x3046;&#x3001;SQL&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306f; DEBUG&#xff08;JDK logging &#x3067;&#x306f; FINE&#xff09;&#x30ec;&#x30d9;&#x30eb;&#x3001;&#x7d50;&#x679c;&#x306f; TRACE&#xff08;JDK logging &#x3067;&#x306f; FINER&#xff09;&#x30ec;&#x30d9;&#x30eb;&#x3067;&#x51fa;&#x529b;&#x3055;&#x308c;&#x308b;&#x3088;&#x3046;&#x306b;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3059;&#x3002;SQL&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x307f;&#x3092;&#x51fa;&#x529b;&#x3057;&#x305f;&#x3044;&#x5834;&#x5408;&#x3001;&#x30ed;&#x30b0;&#x30ec;&#x30d9;&#x30eb;&#x306b; DEBUG &#x3092;&#x8a2d;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;</p>


<div class="source"><pre class="prettyprint">
&lt;logger name=&quot;org.mybatis.example&quot;&gt;
  &lt;level value=&quot;debug&quot;/&gt;
&lt;/logger&gt;
</pre></div>

        
<p>Mapper &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x3044;&#x306a;&#x3044;&#x5834;&#x5408;&#x3001;&#x4f8b;&#x3048;&#x3070;&#x6b21;&#x306e;&#x3088;&#x3046;&#x306a; Mapper XML &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x3044;&#x305f;&#x3089;&#x3069;&#x3046;&#x3059;&#x308c;&#x3070;&#x826f;&#x3044;&#x306e;&#x3067;&#x3057;&#x3087;&#x3046;&#x304b;&#x3002;
        </p>


<div class="source"><pre class="prettyprint">
&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; ?&gt;
&lt;!DOCTYPE mapper
  PUBLIC &quot;-//mybatis.org//DTD Mapper 3.0//EN&quot;
  &quot;http://mybatis.org/dtd/mybatis-3-mapper.dtd&quot;&gt;
&lt;mapper namespace=&quot;org.mybatis.example.BlogMapper&quot;&gt;
  &lt;select id=&quot;selectBlog&quot; resultType=&quot;Blog&quot;&gt;
    select * from Blog where id = #{id}
  &lt;/select&gt;
&lt;/mapper&gt;
</pre></div>

        
<p>&#x3053;&#x306e;&#x5834;&#x5408;&#x3001;&#x6b21;&#x306e;&#x3088;&#x3046;&#x306b;&#x30cd;&#x30fc;&#x30e0;&#x30b9;&#x30da;&#x30fc;&#x30b9;&#x3092;&#x6307;&#x5b9a;&#x3059;&#x308b;&#x3053;&#x3068;&#x3067;&#x3053;&#x306e; XML &#x30d5;&#x30a1;&#x30a4;&#x30eb;&#x5168;&#x4f53;&#x306e;&#x30ed;&#x30b0;&#x3092;&#x6709;&#x52b9;&#x5316;&#x3059;&#x308b;&#x3053;&#x3068;&#x304c;&#x3067;&#x304d;&#x307e;&#x3059;&#x3002;</p>


<div class="source"><pre class="prettyprint">
&lt;logger name=&quot;org.mybatis.example.BlogMapper&quot;&gt;
  &lt;level value=&quot;trace&quot;/&gt;
&lt;/logger&gt;
</pre></div>

        
<p>&#x7279;&#x5b9a;&#x306e;&#x30b9;&#x30c6;&#x30fc;&#x30c8;&#x30e1;&#x30f3;&#x30c8;&#x306e;&#x307f;&#x3092;&#x5bfe;&#x8c61;&#x3068;&#x3059;&#x308b;&#x5834;&#x5408;&#x306f;&#x6b21;&#x306e;&#x3088;&#x3046;&#x306b;&#x6307;&#x5b9a;&#x3057;&#x307e;&#x3059;&#x3002;</p>


<div class="source"><pre class="prettyprint">
&lt;logger name=&quot;org.mybatis.example.BlogMapper.selectBlog&quot;&gt;
  &lt;level value=&quot;trace&quot;/&gt;
&lt;/logger&gt;
</pre></div>

        
<p>&#x304a;&#x6c17;&#x3065;&#x304d;&#x306e;&#x3088;&#x3046;&#x306b;&#x3001;Mapper &#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30a4;&#x30b9;&#x3068; XML &#x306e;&#x3069;&#x3061;&#x3089;&#x3092;&#x4f7f;&#x3063;&#x3066;&#x3044;&#x308b;&#x5834;&#x5408;&#x3067;&#x3082;&#x3001;&#x8a2d;&#x5b9a;&#x65b9;&#x6cd5;&#x306b;&#x9055;&#x3044;&#x306f;&#x3042;&#x308a;&#x307e;&#x305b;&#x3093;&#x3002;</p>

        
<p><span class="label important">NOTE</span> SLF4J or Log4j 2 &#x3092;&#x304a;&#x4f7f;&#x3044;&#x306e;&#x5834;&#x5408;&#x3001;MyBatis &#x306e;&#x30ed;&#x30b0;&#x306f; <code>MYBATIS</code> &#x3068;&#x3044;&#x3046;&#x30de;&#x30fc;&#x30ab;&#x30fc;&#x3067;&#x51fa;&#x529b;&#x3055;&#x308c;&#x307e;&#x3059;&#x3002;</p>

        
<p>&#x4e0a;&#x8a18;&#x306e; <code>logback.xml</code> &#x306e;&#x6b8b;&#x308a;&#x306e;&#x90e8;&#x5206;&#x306f;&#x30a2;&#x30da;&#x30f3;&#x30c0;&#x30fc;&#x306e;&#x8a2d;&#x5b9a;&#x306b;&#x306a;&#x3063;&#x3066;&#x3044;&#x307e;&#x3059;&#x304c;&#x3001;&#x3053;&#x306e;&#x30c9;&#x30ad;&#x30e5;&#x30e1;&#x30f3;&#x30c8;&#x3067;&#x306f;&#x8aac;&#x660e;&#x3057;&#x307e;&#x305b;&#x3093;&#x3002;<a class="externalLink" href="https://logback.qos.ch/">Logback</a> &#x306e;&#x30b5;&#x30a4;&#x30c8;&#x3092;&#x53c2;&#x7167;&#x3057;&#x3066;&#x304f;&#x3060;&#x3055;&#x3044;&#x3002;&#x3042;&#x308b;&#x3044;&#x306f;&#x3001;&#x8a2d;&#x5b9a;&#x5024;&#x3092;&#x5909;&#x66f4;&#x3057;&#x3066;&#x307f;&#x3066;&#x3069;&#x306e;&#x3088;&#x3046;&#x306a;&#x7d50;&#x679c;&#x306b;&#x306a;&#x308b;&#x304b;&#x8a66;&#x3057;&#x3066;&#x307f;&#x308b;&#x306e;&#x3082;&#x826f;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;
        </p>

        
<p></p>
        </section><section>
<h4><a name="Log4j_2.E3.81.AE.E8.A8.AD.E5.AE.9A.E4.BE.8B"></a>
          Log4j 2&#x306e;&#x8a2d;&#x5b9a;&#x4f8b;
        </h4>

        
<p><code>pom.xml</code></p>


<div class="source"><pre class="prettyprint">
&lt;dependency&gt;
  &lt;groupId&gt;org.apache.logging.log4j&lt;/groupId&gt;
  &lt;artifactId&gt;log4j-core&lt;/artifactId&gt;
  &lt;version&gt;2.x.x&lt;/version&gt;
&lt;/dependency&gt;
</pre></div>

        
<p><code>log4j2.xml</code></p>


<div class="source"><pre class="prettyprint">
&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;Configuration xmlns=&quot;http://logging.apache.org/log4j/2.0/config&quot;&gt;

  &lt;Appenders&gt;
    &lt;Console name=&quot;stdout&quot; target=&quot;SYSTEM_OUT&quot;&gt;
      &lt;PatternLayout pattern=&quot;%5level [%t] - %msg%n&quot;/&gt;
    &lt;/Console&gt;
  &lt;/Appenders&gt;

  &lt;Loggers&gt;
    &lt;Logger name=&quot;org.mybatis.example.BlogMapper&quot; level=&quot;trace&quot;/&gt;
    &lt;Root level=&quot;error&quot; &gt;
      &lt;AppenderRef ref=&quot;stdout&quot;/&gt;
    &lt;/Root&gt;
  &lt;/Loggers&gt;

&lt;/Configuration&gt;
</pre></div>

        
<p></p>
        </section><section>
<h4><a name="Log4j.E3.81.AE.E8.A8.AD.E5.AE.9A.E4.BE.8B"></a>
          Log4j&#x306e;&#x8a2d;&#x5b9a;&#x4f8b;
        </h4>

        
<p><code>pom.xml</code></p>


<div class="source"><pre class="prettyprint">
&lt;dependency&gt;
  &lt;groupId&gt;log4j&lt;/groupId&gt;
  &lt;artifactId&gt;log4j&lt;/artifactId&gt;
  &lt;version&gt;1.2.17&lt;/version&gt;
&lt;/dependency&gt;
</pre></div>

        
<p><code>log4j.properties</code></p>


<div class="source"><pre class="prettyprint">
log4j.rootLogger=ERROR, stdout

log4j.logger.org.mybatis.example.BlogMapper=TRACE

log4j.appender.stdout=org.apache.log4j.ConsoleAppender
log4j.appender.stdout.layout=org.apache.log4j.PatternLayout
log4j.appender.stdout.layout.ConversionPattern=%5p [%t] - %m%n
</pre></div>

        
<p></p>
        </section><section>
<h4><a name="JDK_Logging.E3.81.AE.E8.A8.AD.E5.AE.9A.E4.BE.8B"></a>
          JDK Logging&#x306e;&#x8a2d;&#x5b9a;&#x4f8b;
        </h4>

        
<p><code>logging.properties</code></p>

        
<div class="source"><pre class="prettyprint">
handlers=java.util.logging.ConsoleHandler
.level=SEVERE

org.mybatis.example.BlogMapper=FINER

java.util.logging.ConsoleHandler.level=ALL
java.util.logging.ConsoleHandler.formatter=java.util.logging.SimpleFormatter
java.util.logging.SimpleFormatter.format=%1$tT.%1$tL %4$s %3$s - %5$s%6$s%n
</pre></div>

      </section></section>
    </section>
  

        </main>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>Copyright &#169;      2009&#x2013;2021<a href="https://www.mybatis.org/">MyBatis.org</a>.
.</p>
        </div>
      </div>
    </footer>
  </body>
</html>
